var _0xb7847f = _0x2f56,
    normal = _0xb7847f(0x3f7),
    default_text = _0xb7847f(0x2);

function applyCharMap(_0x183cee, _0x109dfc) {
    var _0x14ea0a = _0xb7847f;
    let _0x556993 = '';
    for (let _0x15c8af of _0x109dfc[_0x14ea0a(0x25)]('')) {
        if (_0x183cee[_0x15c8af] !== undefined) _0x556993 += _0x183cee[_0x15c8af];
        else {
            if (_0x183cee[_0x15c8af[_0x14ea0a(0x2b2)]()] !== undefined) _0x556993 += _0x183cee[_0x15c8af['toLowerCase']()];
            else _0x556993 += _0x15c8af;
        }
    }
    return _0x556993;
}

function invertedSquaresCharMapFun(_0xe7bd52) {
    return applyCharMap(invertedSquaresCharMap, _0xe7bd52);
}

function wideTextCharMapFun(_0x370b97) {
    return applyCharMap(wideTextCharMap, _0x370b97);
}

function squaresCharMapFun(_0x61ad89) {
    return applyCharMap(squaresCharMap, _0x61ad89);
}

function subscriptCharMapFun(_0x29c94d) {
    return applyCharMap(subscriptCharMap, _0x29c94d);
}

function bentTextCharMapFun(_0x1c06d1) {
    return applyCharMap(bentTextCharMap, _0x1c06d1);
}

function neonCharMapFun(_0x19c3d0) {
    return applyCharMap(neonCharMap, _0x19c3d0);
}

function futureAlienCharMapFun(_0x2cef4b) {
    return applyCharMap(futureAlienCharMap, _0x2cef4b);
}

function squiggleCharMapFun(_0x91545) {
    return applyCharMap(squiggleCharMap, _0x91545);
}

function squiggle2CharMapFun(_0x4b50a3) {
    return applyCharMap(squiggle2CharMap, _0x4b50a3);
}

function squiggle3CharMapFun(_0x28925f) {
    return applyCharMap(squiggle3CharMap, _0x28925f);
}

function squiggle4CharMapFun(_0x939b9a) {
    return applyCharMap(squiggle4CharMap, _0x939b9a);
}

function _0x2f56(_0x378b96, _0x2f561d) {
    var _0x53da9c = _0x378b();
    return _0x2f56 = function(_0x4542fe, _0x5049ac) {
        _0x4542fe = _0x4542fe - 0x0;
        var _0x1ae3ef = _0x53da9c[_0x4542fe];
        return _0x1ae3ef;
    }, _0x2f56(_0x378b96, _0x2f561d);
}

function squiggle5CharMapFun(_0x29e655) {
    return applyCharMap(squiggle5CharMap, _0x29e655);
}

function squiggle6CharMapFun(_0x4a331e) {
    return applyCharMap(squiggle6CharMap, _0x4a331e);
}

function boldCharMapFun(_0x462d9a) {
    return applyCharMap(boldCharMap, _0x462d9a);
}

function oldEnglishCharMapFun(_0x4d8429) {
    return applyCharMap(oldEnglishCharMap, _0x4d8429);
}

function medievalCharMapFun(_0x133af8) {
    return applyCharMap(medievalCharMap, _0x133af8);
}

function cursiveCharMapFun(_0x2383e1) {
    return applyCharMap(cursiveCharMap, _0x2383e1);
}

function doubleStruckCharMapFun(_0x522c4c) {
    return applyCharMap(doubleStruckCharMap, _0x522c4c);
}

function italicCharMapFun(_0x66e312) {
    return applyCharMap(italicCharMap, _0x66e312);
}

function boldItalicCharMapFun(_0x264312) {
    return applyCharMap(boldItalicCharMap, _0x264312);
}

function monospaceCharMapFun(_0x211f7d) {
    return applyCharMap(monospaceCharMap, _0x211f7d);
}

function upperAnglesCharMapFun(_0x28eb12) {
    return applyCharMap(upperAnglesCharMap, _0x28eb12);
}

function greekCharMapFun(_0x4772e4) {
    return applyCharMap(greekCharMap, _0x4772e4);
}

function symbolsCharMapFun(_0x212d53) {
    return applyCharMap(symbolsCharMap, _0x212d53);
}

function currencyCharMapFun(_0x2f6270) {
    return applyCharMap(currencyCharMap, _0x2f6270);
}

function asianStyleCharMapFun(_0x446d9a) {
    return applyCharMap(asianStyleCharMap, _0x446d9a);
}

function asianStyle2CharMapFun(_0x1ddb0d) {
    return applyCharMap(asianStyle2CharMap, _0x1ddb0d);
}
var luni = new Lunicode();
luni[_0xb7847f(0x404)][_0xb7847f(0x31c)][_0xb7847f(0x18)][_0xb7847f(0x3cf)] = 0xa;

function crazyWithFlourishOrSymbols(_0x347fa1) {
    var _0x3d777f = _0xb7847f;
    if (Math[_0x3d777f(0x505)]() < 0.7) return wrapInSymbols(crazifyText(_0x347fa1), 0x2);
    else return wrapInFlourish(crazifyText(_0x347fa1), 0x2);
}

function _0x378b() {
    var _0x3bafb8 = ['a&#857;', 'charCodeAt', 'Nama\x20Pubg\x20Keren', '\x20\x20█\x20▇\x20▆\x20▅\x20▄\x20▂▁', 'M&#828;', '.crazyWithFlourishOrSymbols3', '&#41575;', '♡❤●•◦', '⫷\x20\x20', '.clear', '&#1360;', 'querySelector', '&#1180;', 'k&#799;', 'w&#826;', '⚔️\x20[[text]]\x20⚔️', 'm&#846;', 'k&#846;', '&#1059;', 't&#828;', 'Y&#846;', '.wrap4', '.arrowBelow', '(づ｡◕‿‿◕｡)づ', 'options', 'P&#828;', '&#3182;', '.thickBlockFramed', '&#5029;', '6&#830;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', '.result-s17', 'floor', 'n&#826;', '.squiggle4CharMap', 'n&#866;', 'щ（ﾟДﾟщ）\x20<\x20', 'split', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'f&#857;', '&#3923;', '1&#830;', 'N&#830;', '9&#866;', '.text', '&#387;', '&#447;', 'z&#828;', '&#41922;', '&#41392;', 'b&#846;', '9&#828;', '.boldItalicCharMap', 'V&#830;', '&upsilon;', '`✵•.¸,✵°✵.｡.✰\x20\x20', 'V&#857;', '&#381;', '&#355;', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '&Delta;', 'q&#826;', 'Y&#838;', 'm&#829;&#851;', '.italicCharMap', '¨˜ˆ”°⍣~•✡⊹٭„¸\x20\x20', '8&#866;', '🖮︎', '.wideTextCharMap', 'f&#829;&#851;', '&part;', '4&#826;', 'X&#829;&#851;', '°°°·.°·..·°¯°·._.·\x20', '.cursiveCharMap', '&#5845;', 'hasOwnProperty', 'esrever', '.crossAboveBelow', 'm&#799;', '&#4306;', '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', '.squaresCharMap', '§.•´¨\x27°÷•..×\x20', '(y)', '.sad5', 'mirror', '1&#866;', '⧼$1&#828;⧽', '&#8627;', 'B&#826;', '&#276;', 'u&#830;', 's21', '&#1097;', '╚»★«╝', '.thankyou7', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '&#1028;', 'h&#829;&#851;', '1&#846;', 'V&#846;', '&#41949;', 'a&#838;', '🏱︎', 'L&#838;', 'd&#838;', 'h&#846;', 'L&#830;', '&#420;', '.heart1', '&#5620;', '&#41203;', 's17', '&#1046;', 's&#829;&#851;', '.fullCrazy4', '&#120435;&#823;', 'y&#830;', '♥࿐✮', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '&#9790;', '.greekCharMap', '&#308;', '🕙︎', '&#120460;&#823;', 'R&#838;', '💣︎', '.sad7', '6&#826;', '5&#838;', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', '&#9835;', '&#41807;', ']\x20𒆜𓊉꧂', '.sad4', '.star8', 'I&#866;', '&#595;', 'A&#838;', 'B&#857;', '&#120831;&#823;', '.lunitoolstinyencode', '\x20.o0×X×0o.\x20', 'E&#857;', '0&#866;', '&#392;', 'ღ⊱♥', '&#1048;', 'E&#799;', '&#10127;', 'N&#866;', 'input', '&#120825;&#823;', 'px}\x20</style>', '.•°¤*(¯`★´¯)*¤°\x20', 'Z&#830;', '.wrap5', '&#974;', '&#653;', '&#120445;&#823;', '.result-s6', 'execCommand', 'K&#830;', '『$1』', '&#23610;', '\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '&#120471;&#823;', 'g&#857;', '&#1072;', 'B&#828;', '&#1052;', 'm&#838;', '&#270;', 'X&#866;', '&#1349;', 'p&#829;&#851;', '[[text]]', '&#120446;&#823;', '&#120437;&#823;', '.medievalCharMap', 'P&#829;&#851;', '&#2414;', '&#407;', '&eta;', 'amd', '&#41706;', '.emoticon7', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '&iuml;', '&#1347;', 'z&#838;', '&#120441;&#823;', 'T&#866;', 'n&#857;', 'V&#829;&#851;', '෴❤️෴\x20\x20', 'b&#866;', '&fnof;', 'X&#799;', '▌│█║▌║▌║\x20', 'K&#857;', 'B&#799;', 'function', 'r&#799;', 'S&#838;', '.doubleUnderline', '.thankyou2', '.result-s31', '.sad1', 'c&#828;', '4&#828;', 'T&#828;', 'k&#826;', '&#5609;', '&Xi;', '&#12552;', '.diametricBox', '0&#799;', '&#41571;', '&#1356;', 'K&#846;', 'E&#828;', '9&#830;', 'a&#846;', '&#1075;', '&#633;', '&#613;', 'C&#828;', 'Z&#799;', '.underline', '&#1085;', 'N&#846;', '.o0×X×0o.\x20', 'appendChild', 'body', '&#382;', '&#41105;', '&#394;', 'W&#826;', '&#8023;', '&#120479;&#823;', '.emoticon2', '&#120439;&#823;', 'ﾟ･:,｡★＼(^-^\x20)♪', 'j&#826;', 'Y&#826;', '.result-s18', 'm&#826;', 'u&#828;', '&#4336;', '👓︎', '&#286;', '&#404;', '7&#799;', '.fullCrazy1', 'N&#857;', '3&#866;', 'Z&#826;', '&#41204;', '1&#838;', '2&#830;', 'G&#857;', '.crazyWithFlourishOrSymbols4', '.wavyJoiner', 's&#799;', 'z&#830;', '3&#830;', 'bottom', 'Y&#829;&#851;', '.asianStyleCharMap', '♦👺\x20（（●´∧｀●））', 'u&#857;', '🖴︎', 'b&#828;', 'V&#838;', '⦑$1⦒', '⎝⎝✧GͥOͣDͫ✧⎠⎠', '🕘︎', '(•◡•)', 'T&#829;&#851;', '&#985;', 'c&#799;', '.result-s4', '&#372;', 'v&#826;', '&#120440;&#823;', '🕚︎', 'l&#838;', '&#670;', 'x&#846;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '&#545;', '&#406;', '&#272;', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', 's29', '<(_\x20_*)>', '&#1488;', '&#400;', '5&#828;', 'X&#846;', '0&#857;', '&chi;', '&kappa;', '★·.·´¯`·.·★\x20', '&#41008;', '6&#828;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', '&#548;', '&#120436;&#823;', 'T&#838;', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', 'click', '🕕︎', '&#1352;', '&#120828;&#823;', '&#41074;', '&#438;', '&#429;', '&#5167;', '&#1331;', '═─◄█▓▒░', 'q&#830;', '&#41045;', '&#41120;', 'r&#866;', '7&#826;', '.fullCrazy', 'n&#799;', 'e&#799;', '&#408;', 'diacriticsTop', '9&#826;', 'object', 'B&#866;', '&#1056;', '╰•★★\x20', '&#1340;', 'select', '8&#826;', '[[text]]\x20☜(`o´)', '◕‿◕', '&#1130;', '&#403;', 'I&#838;', '&#477;', '&#268;', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '.result-s21', 'D&#838;', 'W&#866;', '&#258;', '������', '.lunitoolsbubbles', '&ugrave;', '♪(\x20^-^)/★,｡･:･ﾟ', '0&#826;', 'E&#838;', '3&#857;', '&szlig;', 'map', '&#413;', 'o&#846;', '\x20»-(¯`v´¯)-»', '彡(✿╹◡╹)\x20', 's10', '&#294;', '9&#846;', '*´¯`*.¸¸.*´¯`*\x20', '&#5500;', 'K&#826;', '.sad0', '4&#857;', 'd&#846;', '9&#857;', 'x&#829;&#851;', '(/◔◡◔)/', '.currencyCharMap', 'j&#799;', '&#41080;', 'k&#828;', 's24', '•´¯`•.\x20', 'D&#866;', 'f&#826;', '&#340;', '&#1074;', 'nodeType', '⫷\x20[[text]]\x20⫸', '$2$1', '&#41053;', '&#9773;', 'R&#857;', '•._.••´¯``•.¸¸.•`\x20', '.fullCrazy2', '&#42148;', 'l&#846;', '&#615;', 'w&#830;', 'D&#846;', '&#41426;', '••¤(`×', 'v&#866;', 'diacriticsBottom', '🐿\x20🎀', 'X&#857;', '&#120449;&#823;', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '&#341;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '5&#857;', 'L&#846;', '&#41079;', '.Sk-text', '5&#826;', 'K&#829;&#851;', '<style>\x20.DiscordFonts\x20p{font-size:', '&forall;', '(¯`·.¸¸.->\x20°º\x20', '8&#799;', 'M&#829;&#851;', '3&#826;', 'C&#838;', '&#120465;&#823;', '&#20057;', 'X&#838;', 'length', 'I&#829;&#851;', '(☝◞‸◟)☞', '.firework', '&#295;', 'd&#826;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', '&#120454;&#823;', '&#41042;', '&#346;', '&#5610;', 'u&#826;', '&scaron;', 't&#829;&#851;', '&#1076;', '•´¯`•.\x20[[text]]\x20.•´¯`•', 'O&#829;&#851;', '(✿^▽^)', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', 'y&#846;', '&psi;', '&#5556;', 'f&#830;', '&#416;', '&#418;', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', '3&#799;', 'j&#838;', 'f&#828;', '&#1141;', 's&#828;', '&#1342;', '▀▄▀▄▀▄\x20', '&#607;', '8&#830;', '\x20║▌║▌║█│▌', '.result-s23', 'D&#826;', '&#2790;', 'Q&#838;', '¸„٭⊹✡•~⍣°”ˆ˜¨', '&#7433;', '.result-s12', 'z&#829;&#851;', '\x20(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '&#41076;', '&#10003;', '&#654;', '.:｡+ﾟ', '&#3588;', '&#41266;', '.result-s30', 'randomization', '&#1210;', '.lunisquares', '.curlybrackets', '.crazyWithFlourishOrSymbols5', 'n&#838;', '&#9834;', '«-(¯`v´¯)-«\x20', 'G&#826;', '&#41555;', '💘🎀', '&#1330;', '&#120464;&#823;', '&#490;', 'Q&#799;', '&#120469;&#823;', 'Q&#829;&#851;', '•´¯`•»\x20[[text]]\x20«•´¯`•', '&#423;', '&phi;', '&#374;', '&#3619;', '&#120477;&#823;', '••.•´¯`•.••\x20', '`•.¸¸.•´´¯`••._.•\x20', '&#120476;&#823;', '&#1213;', 'F&#866;', 'Y&#828;', '&epsilon;', 'M&#838;', '×º°”˜`”°º×\x20', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '.result-s16', 'R&#826;', '&#647;', '.wrap3', '&#41346;', '&#942;', '&#989;', '¸,ø¤º°`°º¤ø,¸\x20', 'C&#846;', '&#435;', '&Oslash;', '&nu;', '👌︎', '**•.¸♥¸.•*´💖', '&#358;', 'K&#828;', 'N&#799;', '&#4327;', '&#9687;', '&#41295;', '.emoticon5', 'P&#826;', 'r&#838;', 'M&#866;', 'x&#857;', '🗐︎', '&#4330;', '&#41005;', 'f&#799;', '9&#829;&#851;', 'window', '&#41029;', '&#5229;', '&#10129;', '&#313;', 'forEach', 'y&#857;', '&#120823;&#823;', '.pubggame1', '2&#829;&#851;', '&#1337;', 'ஜ۩۞۩ஜ', '&#10128;', 'p&#830;', 'd&#857;', '🖬︎', 'U&#838;', '.subscriptCharMap', '.kirbyHug', '2&#838;', '&#9450;', '&#292;', 'M&#826;', 'v&#829;&#851;', '💧︎', '&#2799;', '🕆︎', '&dagger;', 'P&#830;', 'h&#838;', '5&#829;&#851;', '\x20●︿●', '.wrap1', 'l&#866;', '&#120468;&#823;', 'N&#828;', '\x20¤]×´)¤••', '¨˜ˆ”°⍣~•✡⊹٭„¸', 'G&#829;&#851;', '░▒▓█►─═', '&#40984;', '&#1193;', 'q&#829;&#851;', '&#120443;&#823;', 'x&#830;', '\x20(\x20◔\x20ʖ̯\x20◔\x20)', '&#5615;', 'g&#826;', '&#41433;', '&#4315;', '.bricks', '🌸ξξ(∵❤◡❤∵)ξξ·¯·♩¸\x20', '.result-s29', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', 'B&#830;', '-漫~*\x27¨¯¨\x27*·舞~\x20', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', 'b&#826;', '꧁𓊈𒆜', '&#541;', '••¤(`×[¤\x20', '٭⊹•꧂', '&#996;', 'G&#830;', '&#4310;', 'i&#838;', '&#9730;', 'J&#866;', '&#5205;', 'i&#857;', '.lunicreepify', '&#120448;&#823;', 'd&#799;', '&#1062;', '&#120483;&#823;', 'o&#799;', '🐣♖', '.fullCrazy3', '&oplus;', '&#41754;', '9&#799;', '&#2794;', '&#12425;', 'z&#826;', '&#41081;', 'g&#829;&#851;', '&#41427;', 'R&#830;', '.pubggame3', '3&#829;&#851;', '&#315;', 'l&#799;', '.heart5', '.result-s5', '&#5397;', '&#652;', '.oldEnglishCharMap', '&#5511;', '^ㅅ^', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', 'F&#829;&#851;', '&#42075;', '(-_-)\x20[[text]]\x20(-_-)', '&#41863;', '&#42171;', '📂︎', '&#1344;', '&otilde;', '&#1043;', '★彡\x20[[text]]\x20彡★', '&#940;', 'R&#829;&#851;', '.hashJoiner', 'r&#826;', 'T&#799;', 's&#826;', '5&#830;', 'p&#838;', '&#428;', '&#645;', '&#1358;', 'S&#826;', '♥╣[-_-]╠♥', '&#1139;', '░▒▓█\x20[[text]]\x20█▓▒░', 'p&#826;', '&thorn;', '.fullCrazy5', '.result-s7', '.cuteText4', 's12', '&#8857;', 'A&#846;', '4&#829;&#851;', '&#1031;', 'd&#829;&#851;', '&#120826;&#823;', '#Sk-text', 'o&#857;', '&#7990;', '2&#866;', '&#5290;', 'P&#838;', '&euro;', '&rho;', 'e&#830;', 'g&#838;', 'u&#838;', 'toLowerCase', '&#9796;', '🎯🍧', 's19', '&#1049;', 'z&#857;', 'g&#828;', '&#9736;', '&#2670;', '2&#826;', '&#3057;', '&#120451;&#823;', '&#4331;', 'H&#829;&#851;', 'Z&#857;', '.DiscordFonts', '&#120432;&#823;', '&#41991;', 'T&#830;', '.thankyou1', '&#42180;', 'b&#799;', 's13', '🕈︎', '&#351;', 'j&#828;', '&#1359;', 'ஜ۩۞۩ஜ\x20', '&#41126;', '&#41240;', '&#8467;', '2&#828;', 'h&#826;', '&#549;', '&yen;', '📁︎', 't&#799;', 'W&#846;', '`•.,¸¸,.•´¯\x20', '&#41532;', '&#1064;', '&#592;', 'J&#799;', 'https://www.discordfonts.com/?=', '.result-s24', 'C&#830;', '4&#799;', '(ɔ◔‿◔)ɔ', 'max', 'D&#857;', '&ETH;', '&#41007;', 'encode', '◔◡◔', 'href', '&#40983;', 'q&#838;', '&#5196;', '.arrowBox', '&#1131;', '&#12581;', '&#1291;', '&#291;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', 'D&#829;&#851;', '.monospaceCharMap', '&#10081;', '&#1140;', '.stinky', '.cuteText3', '&#4357;', '\x20ıllıllı⭐🌟', '.crazyWithFlourishOrSymbols2', '&#9791;', '&#972;', 'I&#857;', '&#41733;', 'r&#857;', '&sigmaf;', '&#1060;', '&#4317;', '.emoticon3', 'J&#857;', 'G&#799;', '【｡_｡】\x20[[text]]\x20【｡_｡】', '.dotBox', 'e&#838;', '&#310;', 'w&#828;', '.sad6', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '.textgun', 'Y&#799;', '.symbolsCharMap', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '&#42128;', 'g&#830;', 'G&#846;', 'classList', '.squiggleCharMap', '&#9739;', '&#4318;', '&#3648;', '★ᶦᶰᵈ᭄', 'replace', 'creepify', 'test', '0&#828;', 'add', 'k&#830;', 'd&#828;', 'L&#866;', '.star7', '&#120822;&#823;', '&#5198;', '&#1095;', 'e&#866;', '&#120433;&#823;', 'Y&#830;', 'U&#828;', 'join', '0&#846;', '8&#828;', '&#120434;&#823;', 'F&#799;', '.heart3', '۝༒༺', '.result-s8', 'h&#830;', '&#10130;', '&#1111;', 'p&#866;', 'p&#799;', 'K&#799;', '+｡:.ﾟヽ(*´∀)ﾉﾟ', '&#41823;', 'x&#799;', 'e&#826;', '&#10126;', '&#41731;', '&#5741;', '&#1008;', '&#9442;', '&#2749;', 'Q&#866;', 'M&#799;', 'J&#826;', '&#120481;&#823;', 'V&#866;', '💜💘', '&#410;', 'q&#846;', '.star6', '&#41296;', '&#321;', 'Z&#866;', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', 's11', 'F&#838;', '🖃︎', '.upperAnglesCharMap', 'a&#826;', '.result-s13', 'Q&#828;', '.sad3', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '.star10', 'f&#838;', 'getHTML', '💖´\x20*•.¸♥¸.•**\x20', '&#618;', 'S&#829;&#851;', '.futureAlienCharMap', 'v&#838;', '&#262;', 'textarea', '🗄︎', '.heart7', 'o&#829;&#851;', '&#41804;', 'flip', 'middle', '.heart2', '🗏︎', 's&#857;', '&#120482;&#823;', 'I&#830;', '🖳︎', '&#323;', '.superscriptCharMap', 'L&#829;&#851;', 'n&#830;', 'm&#866;', '&#42159;', 'X&#830;', 'c&#866;', '.thickBox', '¸♩·¯·ξξ(∵❤◡❤∵)ξξ🌸', 'S&#857;', '(.﹒︠₋﹒︡.)\x20ﾟ😳☹', 'u&#829;&#851;', 'undefined', '&#988;', 'r&#846;', 'X&#828;', 'input\x20change', '&#65420;', 'toString', '.strikeThrough', 'ᵔ⌣ᵔ', '(✿ヘᴥヘ)', 's(^‿^)-b', 'd&#830;', '&#9812;', 'ᵔᴥᵔ', 'S&#828;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '(人◕‿◕)', 'g&#846;', '&#4329;', 'charAt', '✰.｡.✵°✵,¸.•✵´', 'M&#846;', '&#1178;', '(^▽^)\x20\x20', '&beta;', '[̲̅$1]', 't&#866;', '.asianStyle2CharMap', 'k&#838;', '👍︎', '♡〜ლ(๑癶\x20', 'y&#866;', '(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '&#4335;', '&#120459;&#823;', '&#19973;', '&#4308;', '&#41556;', '&#296;', 'H&#826;', '&#1078;', 'V&#799;', 'trim', 'R&#828;', '3&#846;', 'diacriticsMiddle', '&#639;', 'h&#828;', 'a&#866;', '1&#829;&#851;', '&#1040;', 'N&#829;&#851;', 'E&#826;', '&#1041;', '&omega;', '&#120461;&#823;', 'C&#799;', '&#120462;&#823;', 'toUpperCase', '&micro;', '★¸.•☆•.¸★\x20', 'W&#828;', '\x20\x20🎀\x20\x20', '<%=\x20version\x20%>', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '&#120452;&#823;', 'reverse', '&#1192;', 'y&#826;', 's&#830;', '&#1138;', '.star4', '★⌒(●ゝω・)', 'p&#828;', '7&#838;', '♥⊱ღ', '\x20٩꒰´·⌢•｀꒱۶⁼³₌₃', '.pubggame2', '.thankyou3', '🖂︎', '♪(･ω･)ﾉ', '&#42014;', 'v&#846;', 'maxHeight', '\x20🎀\x20🐿', '&#2798;', '&#42150;', '&#41508;', 'pop', '&#5597;', '&#41833;', '&#1506;', '&#646;', 'querySelectorAll', 'location', '&#1105;', '&#422;', 'W&#830;', '&#x', '🕭︎', 'y&#838;', 's26', 'val', 'ツﻬஐﻬ', '(･ω･)♪', '&#411;', 'k&#866;', '&#1185;', '&#120463;&#823;', 'L&#826;', '&#5616;', '&#336;', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '&#10122;', '&#42131;', '&#7828;', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '&#669;', 'tiny', 'push', '&#40996;', '&#1350;', '&#120466;&#823;', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', 'A&#857;', 'Q&#857;', 's22', '&#1082;', '.result-s19', 'R&#846;', 'c&#826;', 'roundsquares', 'bubbles', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', 'V&#828;', '🕿︎', 'tools', '╰☆☆\x20[[text]]\x20☆☆╮', '.thankyou0', '.cuteText1', '&#42181;', '&#41712;', 'innerText', '(*ˊᗜˋ*)', 's&#838;', '.thankyou6', '❀◕‿◕❀', 'createElement', '.lunitoolsflipencode', '3&#828;', 'R&#799;', '&#41016;', '&#41674;', 'y&#799;', 'init', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', '&#1112;', '&#1044;', '(oꆤ︵ꆤo)\x20', '⟦$1⟧', '3&#838;', '&#5623;', 'O&#826;', 's30', '&#2797;', '【〖〘〚［', 'U&#830;', 'c&#857;', '&#623;', '🕔︎', '&#1084;', '&#350;', 'J&#830;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', 't&#857;', '🕗︎', '✬☆*.•⨳•.¤⊹٭', '&#385;', '&Lambda;', '🕐︎', '】〗〙〛］', 'q&#828;', 'y&#829;&#851;', 'a&#799;', '&#586;', '8&#846;', 'o&#866;', '.result-s2', 'i&#828;', 't&#846;', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '.tildeStrikeThrough', 'ıllıllı\x20', '◠◡◠', '&#1090;', '&sigma;', '.star0', '&#120830;&#823;', 'ﻬஐﻬツ', 'A&#829;&#851;', '&Omega;', 'O&#830;', '&#391;', '&#1051;', '&#4325;', '&#941;', 'O&#866;', '.thankyou4', '&#41751;', ']|I{•------»\x20[[text]]\x20«------•}I|[', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '&#65434;', '\x20٩(˘◡˘)۶', '&#10123;', 'i&#830;', '.crazyWithFlourishOrSymbols1', '*•.¸♡\x20[[text]]\x20♡¸.•*', '—(••÷[\x20', '4&#838;', 'html', 'j&#857;', '2&#846;', '&#401;', 'insertBefore', 's&#846;', 'b&#829;&#851;', 'o&#826;', 'Y&#857;', 'Q&#830;', '&#638;', '&#1071;', '⦏$1&#x302;⦎', 'C&#866;', '🌘‿🌘', 'w&#829;&#851;', '.emoticon6', 's25', 'l&#828;', 'h&#799;', '&#41660;', '&#625;', '6&#866;', '&#1333;', '.invertedSquaresCharMap', '<style>\x20//\x20Discord\x20Fonts\x20by\x20:DiscordFonts@gmail.com\x20</style>', '&#41976;', '9&#838;', '&#8134;', '👻ൠ', '🖫︎', 'b&#857;', '&#651;', 't&#826;', 'fromCharCode', 'M&#857;', '&Gamma;', '1&#799;', '.star5', '&#120456;&#823;', 'u&#799;', 'B&#829;&#851;', 'J&#838;', 'A&#830;', 'm&#830;', '&#356;', '&alpha;', 'i&#846;', '●‿●', '&#2792;', 'n&#828;', '&#1050;', '.result-s3', '&#42130;', '.emoticon0', 'S&#866;', '(◍•ᴗ•◍)\x20ミ💖\x20', 'f&#866;', '&#627;', 'e&#829;&#851;', 'exports', '&#5262;', '6&#799;', '•°¯`••\x20', '.vaporwaveText', '.result-s14', 'I&#799;', '&#1179;', 'p&#846;', 'A&#826;', 'r&#828;', 'U&#866;', 'H&#828;', '٭⊹¤.•⨳•.*☆✬\x20', '(っ◔◡◔)っ\x20♥\x20', '&#41707;', '&#41648;', '#fontSize', '꜍$1꜉', '&#576;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '\x20•°*”˜.•°*”˜', '꧁༒☬\x20[[text]]\x20☬༒꧂', '•´¯`•»\x20', '&#409;', '&#41157;', '&#1065;', '&#1171;', 's31', '&#1202;', 'o&#838;', '6&#838;', 'U&#826;', 'o&#830;', '★·.·´¯`·.·★.·', '&#42015;', '(｀∀´)Ψ', '&#608;', '&#344;', '&#41766;', 'O&#838;', 'w&#846;', '&#434;', 'W&#857;', 'U&#846;', '.squiggle3CharMap', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', 'U&#829;&#851;', 'Z&#838;', '.star2', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20\x20', '&#1079;', 'D&#799;', 'L&#828;', 'u&#866;', 'B&#846;', '&#9815;', '📭︎', '&#12579;', '&#1338;', '&#41246;', '.squiggle6CharMap', '.bigrus', '2&#799;', '&Uacute;', 'N&#838;', '(⌒‿⌒)', '&#1351;', 'n&#846;', '&#9761;', '.result-s22', '\x20⋆\x20', 'i&#799;', 'r&#829;&#851;', 'i&#829;&#851;', '&#41141;', 's18', '&#41769;', '4&#866;', 'e&#846;', '&#484;', '෴❤️෴', '&#1223;', 'c&#830;', '4&#846;', 'F&#857;', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', 'z&#846;', 'round', '&#943;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', '.singlewavyJoiner', '7&#857;', '&#120455;&#823;', '【$1】', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', '.result-s9', 'b&#830;', 'F&#826;', '&#311;', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '&#1348;', 'W&#838;', '.starJoiner', 'q&#799;', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', 's&#866;', '༻༒۝', 'H&#866;', '.sad2', '(^▽^)', '·.★·.·´¯`·.·★', 'V&#826;', 'v&#857;', 'random', '.result-s10', '&#412;', '&#377;', '(*ゝω・)', '&#40974;', '.boldCharMap', '☞ó\x20͜つò☞\x20\x20', '★彡[', '&#1377;', 'value', 'O&#857;', '&#327;', '1&#828;', 'j&#866;', '&#41155;', '•●◉✿\x20', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', 'B&#838;', 'H&#857;', 'C&#826;', 'i&#826;', '&Mu;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 'r&#830;', '💖彡', '&#120457;&#823;', '—(••÷', '&#596;', '.cuteText2', '(\x20◔\x20ʖ̯\x20◔\x20)\x20', '.cuteText5', 'a&#829;&#851;', '🕯︎', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', 'L&#799;', '&iota;', 'remove'];
    _0x378b = function() {
        return _0x3bafb8;
    };
    return _0x378b();
}

function illuminati(_0x1f0c71) {
    var _0x1226a7 = _0xb7847f;
    return applyCharMap(doubleStruckCharMap, _0x1226a7(0x93) + _0x1f0c71 + _0x1226a7(0x3c7));
}

function textgun(_0x44431e) {
    var _0x380749 = _0xb7847f;
    return '▄︻デ' + _0x44431e[_0x380749(0x25)]('')[_0x380749(0x32b)]('&#823;') + '══━一';
}

function minigame(_0x2bcdd9) {
    var _0xcd7a67 = _0xb7847f;
    return _0xcd7a67(0x50d) + luni['tools'][_0xcd7a67(0x3f2)][_0xcd7a67(0x2e6)](_0x2bcdd9) + ']彡★';
}

function pubggame1(_0x50e6c3) {
    return applyCharMap(cursiveCharMap, '༒☬' + _0x50e6c3 + '☬༒');
}

function pubggame2(_0x47ac20) {
    var _0x28a96b = _0xb7847f;
    return applyCharMap(boldCharMap, _0x28a96b(0x331) + _0x47ac20 + _0x28a96b(0x4fe));
}

function pubggame3(_0x2bb0b3) {
    var _0x1a2387 = _0xb7847f;
    return applyCharMap(invertedSquaresCharMap, _0x1a2387(0x258) + _0x2bb0b3 + '𒆜𓊉꧂');
}

function bricks(_0x26541e) {
    var _0x3332c1 = _0xb7847f;
    return applyCharMap(medievalCharMap, _0x3332c1(0x3e3) + _0x26541e + _0x3332c1(0x442));
}

function bigrus(_0x1550fe) {
    var _0x5e7a4e = _0xb7847f;
    return applyCharMap(boldCharMap, _0x5e7a4e(0x31a) + _0x1550fe + _0x5e7a4e(0x77));
}

function strikeThrough(_0x41ce4d) {
    var _0x190e8e = _0xb7847f;
    return _0x41ce4d[_0x190e8e(0x25)]('')['join']('̶') + '̶';
}

function tildeStrikeThrough(_0x2cd242) {
    var _0x31c8a0 = _0xb7847f;
    return _0x2cd242[_0x31c8a0(0x25)]('')[_0x31c8a0(0x32b)]('̴') + '̴';
}

function underline(_0x254a31) {
    var _0x1458a8 = _0xb7847f;
    return _0x254a31[_0x1458a8(0x25)]('')['join']('̲') + '̲';
}

function doubleUnderline(_0x24abe1) {
    var _0x106bf2 = _0xb7847f;
    return _0x24abe1[_0x106bf2(0x25)]('')[_0x106bf2(0x32b)]('̳') + '̳';
}

function slashThrough(_0x5ab41e) {
    var _0x27b406 = _0xb7847f;
    return _0x5ab41e[_0x27b406(0x25)]('')[_0x27b406(0x32b)]('̷') + '̷';
}

function stinky(_0x3a6bb0) {
    var _0x3ac134 = _0xb7847f;
    return _0x3a6bb0[_0x3ac134(0x25)]('')[_0x3ac134(0x32b)]('̾') + '̾';
}

function heartsBetween(_0x2b9835) {
    var _0x483b37 = _0xb7847f;
    return _0x2b9835[_0x483b37(0x25)]('')[_0x483b37(0x32b)]('♥');
}

function arrowBelow(_0x169a29) {
    return _0x169a29['split']('')['join']('͎') + '͎';
}

function crossAboveBelow(_0xbf6649) {
    var _0x29782e = _0xb7847f;
    return _0xbf6649['split']('')[_0x29782e(0x32b)]('͓̽') + '͓̽';
}
const wingdingsCharMap = {
    0x0: _0xb7847f(0x2d5),
    0x1: _0xb7847f(0x287),
    0x2: '📄︎',
    0x3: _0xb7847f(0x36a),
    0x4: _0xb7847f(0x219),
    0x5: _0xb7847f(0x363),
    0x6: '⌛︎',
    0x7: _0xb7847f(0x43),
    0x8: '🖰︎',
    0x9: '🖲︎',
    '!': '✏︎',
    '\x22': '✂︎',
    '#': '✁︎',
    '$': _0xb7847f(0xfb),
    '%': _0xb7847f(0x3df),
    '&': '🕮︎',
    '\x27': _0xb7847f(0x526),
    '(': _0xb7847f(0x403),
    ')': '✆︎',
    '*': _0xb7847f(0x3cb),
    '+': _0xb7847f(0x352),
    ',': '📪︎',
    '-': '📫︎',
    '.': '📬︎',
    '/': _0xb7847f(0x4cc),
    ':': _0xb7847f(0x36e),
    ';': _0xb7847f(0x111),
    '<': _0xb7847f(0x475),
    '=': _0xb7847f(0x22d),
    '>': '✇︎',
    '?': '✍︎',
    'A': '✌︎',
    'B': _0xb7847f(0x20c),
    'C': _0xb7847f(0x399),
    'D': '👎︎',
    'E': '☜︎',
    'F': '☞︎',
    'G': '☝︎',
    'H': '☟︎',
    'I': '✋︎',
    'J': '☺︎',
    'K': '😐︎',
    'L': '☹︎',
    'M': _0xb7847f(0x7f),
    'N': '☠︎',
    'O': '⚐︎',
    'P': _0xb7847f(0x68),
    'Q': '✈︎',
    'R': '☼︎',
    'S': _0xb7847f(0x236),
    'T': '❄︎',
    'U': _0xb7847f(0x238),
    'V': '✞︎',
    'W': _0xb7847f(0x2c9),
    'X': '✠︎',
    'Y': '✡︎',
    'Z': '☪︎',
    '[': '☯︎',
    '\x5c': 'ॐ︎',
    ']': '☸︎',
    '^': '♈︎',
    '_': '♉︎',
    '`': '♊︎',
    'a': '♋︎',
    'b': '♌︎',
    'c': '♍︎',
    'd': '♎︎',
    'e': '♏︎',
    'f': '♐︎',
    'g': '♑︎',
    'h': '♒︎',
    'i': '♓︎',
    'j': '🙰',
    'k': '🙵',
    'l': '●︎',
    'm': '❍︎',
    'n': '■︎',
    'o': '□︎',
    'p': '◻︎',
    'q': '❑︎',
    'r': '❒︎',
    's': '⬧︎',
    't': '⧫︎',
    'u': '◆︎',
    'v': '❖︎',
    'w': '⬥︎',
    'x': '⌧︎',
    'y': '⍓︎',
    'z': '⌘︎',
    '{': '❀︎',
    '|': '✿︎',
    '}': '❝︎',
    '~': '❞︎',
    '\x20': '▯︎',
    '€': '⓪︎',
    '\x20': '①︎',
    '‚': '②︎',
    'ƒ': '③︎',
    '„': '④︎',
    '…': '⑤︎',
    '†': '⑥︎',
    '‡': '⑦︎',
    'ˆ': '⑧︎',
    '‰': '⑨︎',
    'Š': '⑩︎',
    '‹': '⓿︎',
    'Œ': '❶︎',
    '\x20': '❷︎',
    'Ž': '❸︎',
    '\x20': '❹︎',
    '\x20': '❺︎',
    '‘': '❻︎',
    '’': '❼︎',
    '“': '❽︎',
    '”': '❾︎',
    '•': '❿︎',
    '–': '◻︎',
    '—': '◻︎',
    '˜': '◻︎',
    '™': '◻︎',
    'š': '◻︎',
    '›': '◻︎',
    'œ': '◻︎',
    '\x20': '◻︎',
    'ž': '·︎',
    'Ÿ': '•︎',
    '¡': '○︎',
    '¢': '⭕︎',
    '£': '◻︎',
    '¤': '◉︎',
    '¥': '◎︎',
    '¦': '◻︎',
    '§': '▪︎',
    '¨': '◻︎',
    '©': '◻︎',
    'ª': '✦︎',
    '«': '★︎',
    '¬': '✶︎',
    '®': '✹︎',
    '¯': '✵︎',
    '°': '◻︎',
    '±': '⌖︎',
    '²': '⟡︎',
    '³': '⌑︎',
    '´': '◻︎',
    'µ': '✪︎',
    '¶': '✰︎',
    '·': _0xb7847f(0x42f),
    '¸': '🕑︎',
    '¹': '🕒︎',
    'º': '🕓︎',
    '»': _0xb7847f(0x425),
    '¼': _0xb7847f(0x13a),
    '½': '🕖︎',
    '¾': _0xb7847f(0x42b),
    '¿': _0xb7847f(0x116),
    'À': _0xb7847f(0x7c),
    'Á': _0xb7847f(0x11f),
    'Â': '🕛︎',
    'Ã': '◻︎',
    'Ä': '◻︎',
    'Å': '◻︎',
    'Æ': '◻︎',
    'Ç': '◻︎',
    'È': '◻︎',
    'É': '◻︎',
    'Ê': '◻︎',
    'Ë': '◻︎',
    'Ì': '◻︎',
    'Í': '◻︎',
    'Î': '◻︎',
    'Ï': '◻︎',
    'Ð': '◻︎',
    'Ñ': '◻︎',
    'Ò': '◻︎',
    'Ó': '◻︎',
    'Ô': '◻︎',
    'Õ': '⌫︎',
    'Ö': '⌦︎',
    '×': '◻︎',
    'Ø': '➢︎',
    'Ù': '◻︎',
    'Ú': '◻︎',
    'Û': '◻︎',
    'Ü': '➲︎',
    'Ý': '◻︎',
    'Þ': '◻︎',
    'ß': '◻︎',
    'à': '◻︎',
    'á': '◻︎',
    'â': '◻︎',
    'ã': '◻︎',
    'ä': '◻︎',
    'å': '◻︎',
    'æ': '◻︎',
    'ç': '◻︎',
    'è': '➔︎',
    'é': '◻︎',
    'ê': '◻︎',
    'ë': '◻︎',
    'ì': '◻︎',
    'í': '◻︎',
    'î': '◻︎',
    'ï': '⇦︎',
    'ð': '⇨︎',
    'ñ': '⇧︎',
    'ò': '⇩︎',
    'ó': '⬄︎',
    'ô': '⇳︎',
    'õ': '⬀︎',
    'ö': '⬁︎',
    '÷': '⬃︎',
    'ø': '⬂︎',
    'ù': '▭︎',
    'ú': '▫︎',
    'û': '✗︎',
    'ü': '✓︎',
    'ý': '☒︎',
    'þ': '☑︎',
    'ÿ': '◻︎'
};

function wingdings(_0x2b6d4a) {
    var _0x5ba447 = _0xb7847f;
    return _0x2b6d4a[_0x5ba447(0x25)]('')[_0x5ba447(0x169)](function(_0x1a16b5) {
        return wingdingsCharMap[_0x1a16b5] ? wingdingsCharMap[_0x1a16b5] : _0x1a16b5;
    })[_0x5ba447(0x32b)]('');
}
const vaporwaveCharMap = {
    '\x20': '\u3000',
    '`': '`',
    0x1: '１',
    0x2: '２',
    0x3: '３',
    0x4: '４',
    0x5: '５',
    0x6: '６',
    0x7: '７',
    0x8: '８',
    0x9: '９',
    0x0: '０',
    '-': '－',
    '=': '＝',
    '~': '~',
    '!': '！',
    '@': '＠',
    '#': '＃',
    '$': '＄',
    '%': '％',
    '^': '^',
    '&': '＆',
    '*': '＊',
    '(': '（',
    ')': '）',
    '_': '_',
    '+': '＋',
    'q': 'ｑ',
    'w': 'ｗ',
    'e': 'ｅ',
    'r': 'ｒ',
    't': 'ｔ',
    'y': 'ｙ',
    'u': 'ｕ',
    'i': 'ｉ',
    'o': 'ｏ',
    'p': 'ｐ',
    '[': '[',
    ']': ']',
    '\x5c': '\x5c',
    'Q': 'Ｑ',
    'W': 'Ｗ',
    'E': 'Ｅ',
    'R': 'Ｒ',
    'T': 'Ｔ',
    'Y': 'Ｙ',
    'U': 'Ｕ',
    'I': 'Ｉ',
    'O': 'Ｏ',
    'P': 'Ｐ',
    '{': '{',
    '}': '}',
    '|': '|',
    'a': 'ａ',
    's': 'ｓ',
    'd': 'ｄ',
    'f': 'ｆ',
    'g': 'ｇ',
    'h': 'ｈ',
    'j': 'ｊ',
    'k': 'ｋ',
    'l': 'ｌ',
    ';': '；',
    '\x27': '＇',
    'A': 'Ａ',
    'S': 'Ｓ',
    'D': 'Ｄ',
    'F': 'Ｆ',
    'G': 'Ｇ',
    'H': 'Ｈ',
    'J': 'Ｊ',
    'K': 'Ｋ',
    'L': 'Ｌ',
    ':': '：',
    '\x22': '\x22',
    'z': 'ｚ',
    'x': 'ｘ',
    'c': 'ｃ',
    'v': 'ｖ',
    'b': 'ｂ',
    'n': 'ｎ',
    'm': 'ｍ',
    ',': '，',
    '.': '．',
    '/': '／',
    'Z': 'Ｚ',
    'X': 'Ｘ',
    'C': 'Ｃ',
    'V': 'Ｖ',
    'B': 'Ｂ',
    'N': 'Ｎ',
    'M': 'Ｍ',
    '<': '<',
    '>': '>',
    '?': '？'
};

function vaporwaveText(_0x554a4) {
    var _0x427024 = _0xb7847f,
        _0x4490dc = _0x554a4[_0x427024(0x25)]('\x20')['length'];
    _0x554a4 = applyCharMap(vaporwaveCharMap, _0x554a4);
    var _0x45e12f = getAsianChars(Math[_0x427024(0x2e2)](0x3, _0x4490dc));
    if (_0x4490dc > 0x6) _0x45e12f = _0x45e12f[_0x427024(0x25)]('')[_0x427024(0x169)](_0x52fd60 => _0x52fd60 + ['', ''][Math[_0x427024(0x4eb)](Math[_0x427024(0x505)]() * 0.6)])[_0x427024(0x32b)]('');
    var _0x57536d = [];
    return _0x57536d[_0x427024(0x3f3)](_0x554a4), _0x57536d[_0x427024(0x32b)]();
}

function vaporwaveText1(_0x55e360) {
    var _0xa85a6b = _0xb7847f,
        _0x34e380 = _0x55e360[_0xa85a6b(0x25)]('\x20')[_0xa85a6b(0x1ab)];
    _0x55e360 = applyCharMap(vaporwaveCharMap, _0x55e360);
    var _0x511f90 = getAsianChars(Math[_0xa85a6b(0x2e2)](0x3, _0x34e380));
    if (_0x34e380 > 0x6) _0x511f90 = _0x511f90[_0xa85a6b(0x25)]('')['map'](_0x572326 => _0x572326 + ['', ''][Math[_0xa85a6b(0x4eb)](Math[_0xa85a6b(0x505)]() * 0.6)])[_0xa85a6b(0x32b)]('');
    var _0x5d997d = [];
    return _0x5d997d[_0xa85a6b(0x3f3)](_0x55e360[_0xa85a6b(0x31b)](/　/g, '░')[_0xa85a6b(0x31b)](/ａｅ/, 'æ')[_0xa85a6b(0x31b)](/Ａ/g, 'Λ')[_0xa85a6b(0x31b)](/Ｅ/g, function() {
        var _0x5cf52e = _0xa85a6b;
        return Math[_0x5cf52e(0x505)]() > 0.5 ? 'Ξ' : 'Σ';
    })[_0xa85a6b(0x31b)](/Ｏ/g, '♢')), _0x5d997d[_0xa85a6b(0x32b)]();
}

function vaporwaveText2(_0x39d6e8) {
    var _0x1efd76 = _0xb7847f,
        _0x340fb6 = _0x39d6e8[_0x1efd76(0x25)]('\x20')[_0x1efd76(0x1ab)];
    _0x39d6e8 = applyCharMap(vaporwaveCharMap, _0x39d6e8);
    var _0x202175 = getAsianChars(Math[_0x1efd76(0x2e2)](0x3, _0x340fb6));
    if (_0x340fb6 > 0x6) _0x202175 = _0x202175[_0x1efd76(0x25)]('')[_0x1efd76(0x169)](_0x21ba2d => _0x21ba2d + ['', ''][Math[_0x1efd76(0x4eb)](Math['random']() * 0.6)])[_0x1efd76(0x32b)]('');
    var _0x54dd00 = [];
    return _0x54dd00[_0x1efd76(0x3f3)]('【\ufeff' + _0x39d6e8 + '】'), _0x54dd00[_0x1efd76(0x32b)]();
}

function getAsianChars(_0x38d626) {
    var _0x6444bf = _0xb7847f;
    if (!_0x38d626) _0x38d626 = 0x1;
    var _0x17d98f = _0x6444bf(0x253),
        _0x48de06 = '';
    for (var _0x1bc311 = 0x0; _0x1bc311 < _0x38d626; _0x1bc311++) {
        _0x48de06 += _0x17d98f[Math[_0x6444bf(0x20)](Math[_0x6444bf(0x505)]() * _0x17d98f[_0x6444bf(0x1ab)])];
    }
    return _0x48de06;
}
const flourishArray = [_0xb7847f(0x4a9), _0xb7847f(0x4e9), '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', _0xb7847f(0xf), _0xb7847f(0x51), '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', _0xb7847f(0x83), _0xb7847f(0x4f2), 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', _0xb7847f(0x155), _0xb7847f(0x310), _0xb7847f(0x256), _0xb7847f(0x3b), _0xb7847f(0x3f0), _0xb7847f(0x34f), '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', _0xb7847f(0x4a7), _0xb7847f(0x429), _0xb7847f(0x358), _0xb7847f(0x38b), 'ıllıllı\x20[[text]]\x20ıllıllı', _0xb7847f(0x401), _0xb7847f(0x1bd), _0xb7847f(0x4c1), '•]••´º´•»\x20[[text]]\x20«•´º´••[•', _0xb7847f(0x454), _0xb7847f(0x405), _0xb7847f(0x30c), _0xb7847f(0x61), '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0xb7847f(0x29a), _0xb7847f(0x4f7), _0xb7847f(0x28b), _0xb7847f(0x1ba), _0xb7847f(0x1c4), '•°¯`••\x20[[text]]\x20••´¯°•', _0xb7847f(0x281), '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', _0xb7847f(0x138), _0xb7847f(0x134), '(¯´•._.•\x20[[text]]\x20•._.•´¯)', _0xb7847f(0x15c), _0xb7847f(0x1f0), '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', _0xb7847f(0x19a), '—(••÷[\x20[[text]]\x20]÷••)—', _0xb7847f(0x1e), _0xb7847f(0x311), ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', _0xb7847f(0x516), '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', _0xb7847f(0x198), _0xb7847f(0x1b1), _0xb7847f(0x306), _0xb7847f(0x44d), _0xb7847f(0x3ec), _0xb7847f(0x284), _0xb7847f(0x1ba), _0xb7847f(0x2f1), _0xb7847f(0xbc), _0xb7847f(0x30c), _0xb7847f(0x1ff), _0xb7847f(0x19a), '◦•●◉✿\x20[[text]]\x20✿◉●•◦', _0xb7847f(0x78), '╚»★«╝\x20[[text]]\x20╚»★«╝', _0xb7847f(0x185), _0xb7847f(0x3bc), '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', _0xb7847f(0x44e), _0xb7847f(0x4ed), _0xb7847f(0x4fc), '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', _0xb7847f(0x527), 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', _0xb7847f(0x417)];

function wrapInFlourish(_0x2f43af) {
    var _0x27c10e = _0xb7847f;
    return flourishArray[Math['floor'](Math['random']() * flourishArray['length'])][_0x27c10e(0x31b)](_0x27c10e(0xb1), _0x2f43af);
}

function Flourishlist(_0x5deca9, _0x5bd32d) {
    var _0x9f7141 = _0xb7847f;
    return flourishArray[_0x5deca9][_0x9f7141(0x31b)](_0x9f7141(0xb1), _0x5bd32d);
}

function wrapInSymbols(_0x22fc74, _0x4f8ea0) {
    return randomSymbols(_0x4f8ea0) + '\x20\x20' + _0x22fc74 + '\x20\x20' + randomSymbols(_0x4f8ea0);
}

function firework(_0x266b75) {
    var _0x3e72f6 = _0xb7847f;
    return _0x266b75[_0x3e72f6(0x25)]('')['join']('҉') + '҉';
}

function weirdBox(_0x4c5ccc) {
    var _0x377587 = _0xb7847f;
    return _0x4c5ccc[_0x377587(0x31b)](/([^\s])/g, _0x377587(0x395));
}

function curlybrackets(_0x135c50) {
    var _0x555f4b = _0xb7847f;
    return _0x135c50['replace'](/([^\s])/g, _0x555f4b(0x58));
}

function singlewavyJoiner(_0x480eaa) {
    var _0x710f2b = _0xb7847f;
    return '〜' + _0x480eaa[_0x710f2b(0x25)]('')['join']('∿') + '〜';
}

function thickBox(_0x5f2381) {
    var _0x55abc2 = _0xb7847f;
    return _0x5f2381[_0x55abc2(0x31b)](/([^\s])/g, _0x55abc2(0x41b));
}

function zigzagJoiner(_0x4e731a) {
    var _0x57bdc2 = _0xb7847f;
    return _0x4e731a[_0x57bdc2(0x31b)](/([^\s])/g, '⦚$1⦚');
}

function hashJoiner(_0x2decc1) {
    var _0x51f73c = _0xb7847f;
    return _0x2decc1[_0x51f73c(0x25)]('')['join']('⨳');
}

function starJoiner(_0x29fdbd) {
    var _0x3dc22d = _0xb7847f;
    return _0x29fdbd[_0x3dc22d(0x31b)](/([^\s])/g, '⦚$1⦚');
}

function connectedJoiner(_0x474ffb) {
    var _0x23b09b = _0xb7847f;
    return _0x474ffb[_0x23b09b(0x25)]('')[_0x23b09b(0x32b)]('⊶');
}

function arrowjoin(_0x33d8d5) {
    var _0x3f75cc = _0xb7847f;
    return _0x33d8d5[_0x3f75cc(0x31b)](/([^\s])/g, _0x3f75cc(0x463));
}

function dotBoxtwo(_0x1eaabc) {
    var _0x314599 = _0xb7847f;
    return _0x1eaabc[_0x314599(0x25)]('')[_0x314599(0x32b)]('&#778;\x20⫶');
}

function dotBox(_0x5252d4) {
    var _0x2d5399 = _0xb7847f;
    return _0x5252d4[_0x2d5399(0x31b)](/([^\s])/g, _0x2d5399(0x4a5));
}

function diametricBox(_0x1a85d9) {
    var _0x387f4e = _0xb7847f;
    return _0x1a85d9[_0x387f4e(0x31b)](/([^\s])/g, _0x387f4e(0x114));
}

function arrowBox(_0x1f98c9) {
    var _0x37096f = _0xb7847f;
    return _0x1f98c9[_0x37096f(0x31b)](/([^\s])/g, '⦏$1⦎');
}

function littleSparkles(_0x7cc215) {
    var _0x4fa98b = _0xb7847f;
    return '˜”*°•.˜”*°•\x20' + _0x7cc215 + _0x4fa98b(0x4a8);
}

function kirbyHug(_0x380c8e) {
    var _0x58af27 = _0xb7847f;
    return _0x58af27(0x4a1) + _0x380c8e + '\x20♥';
}

function dottyJoiner(_0x2053bf) {
    var _0x350697 = _0xb7847f;
    return '░' + _0x2053bf[_0x350697(0x25)]('')[_0x350697(0x32b)]('░') + '░';
}

function wavyJoiner(_0x43bd28) {
    var _0x2add76 = _0xb7847f;
    return '≋' + _0x43bd28[_0x2add76(0x25)]('')[_0x2add76(0x32b)]('≋') + '≋';
}

function diametricAngleFrame(_0x5ad6f7) {
    var _0x387e3a = _0xb7847f;
    return _0x5ad6f7[_0x387e3a(0x31b)](/([^\s])/g, _0x387e3a(0xa4));
}

function thickBlockFramed(_0x1bd2b3) {
    var _0x170019 = _0xb7847f;
    return _0x1bd2b3[_0x170019(0x31b)](/([^\s])/g, _0x170019(0x4f1));
}

function star0(_0x2aad43) {
    return applyCharMap(italicCharMap, 'ミ★\x20' + _0x2aad43 + '★彡');
}

function star1(_0x2bc112) {
    var _0xa42d64 = _0xb7847f;
    return applyCharMap(monospaceCharMap, '꧁•⊹٭' + _0x2bc112 + _0xa42d64(0x25b));
}

function star2(_0x5eee7a) {
    var _0x22c364 = _0xb7847f;
    return applyCharMap(currencyCharMap, _0x22c364(0x2f9) + _0x5eee7a + '🌟⭐ıllıllı');
}

function star3(_0x2b7d2f) {
    var _0x5dbb5d = _0xb7847f;
    return applyCharMap(monospaceCharMap, _0x5dbb5d(0x151) + _0x2b7d2f + '★★•╯');
}

function star4(_0x5f3567) {
    var _0x355064 = _0xb7847f;
    return applyCharMap(squaresCharMap, _0x355064(0x37) + _0x5f3567 + _0x355064(0x390));
}

function star5(_0x2edbd0) {
    var _0x13c811 = _0xb7847f;
    return applyCharMap(doubleStruckCharMap, _0x13c811(0x502) + _0x2edbd0 + _0x13c811(0x4b5));
}

function star6(_0x2704b2) {
    var _0x24d232 = _0xb7847f;
    return applyCharMap(invertedSquaresCharMap, _0x24d232(0x41) + _0x2704b2 + _0x24d232(0x1d3));
}

function star7(_0x2d9e6c) {
    var _0x28891c = _0xb7847f;
    return applyCharMap(asianStyleCharMap, _0x28891c(0x1d3) + _0x2d9e6c + _0x28891c(0x243));
}

function star8(_0x5cbd73) {
    var _0x44f6cc = _0xb7847f;
    return applyCharMap(asianStyle2CharMap, _0x44f6cc(0x3b8) + _0x5cbd73 + '★⡀.•☆•.★');
}

function star9(_0xb364e0) {
    var _0x264a73 = _0xb7847f;
    return applyCharMap(neonCharMap, _0x264a73(0x4a0) + _0xb364e0 + _0x264a73(0x42c));
}

function star10(_0x1d2a2f) {
    var _0x179332 = _0xb7847f;
    return applyCharMap(squiggle6CharMap, '٭⊹¤.•⨳•.*☆✬\x20' + _0x1d2a2f + _0x179332(0x42c));
}

function heart0(_0x2f65e3) {
    var _0x42e10c = _0xb7847f;
    return applyCharMap(squiggle5CharMap, _0x42e10c(0x48f) + _0x2f65e3 + _0x42e10c(0x51e));
}

function heart1(_0x58a4ed) {
    var _0x4d818a = _0xb7847f;
    return applyCharMap(futureAlienCharMap, _0x4d818a(0xc4) + _0x58a4ed + _0x4d818a(0x4e4));
}

function heart2(_0x1e2a10) {
    var _0x484261 = _0xb7847f;
    return applyCharMap(boldCharMap, _0x484261(0x35c) + _0x1e2a10 + _0x484261(0x20d));
}

function heart3(_0x5589c9) {
    var _0x176d16 = _0xb7847f;
    return applyCharMap(firework, _0x176d16(0x39a) + _0x5589c9 + '癶๑)ლ〜♡');
}

function heart4(_0x21f637) {
    var _0x307236 = _0xb7847f;
    return applyCharMap(symbolsCharMap, '◦•●❤♡\x20' + _0x21f637 + _0x307236(0x7));
}

function heart5(_0x14fb66) {
    var _0x169a5d = _0xb7847f;
    return applyCharMap(bentTextCharMap, _0x169a5d(0x251) + _0x14fb66 + _0x169a5d(0x378));
}

function heart6(_0x204875) {
    var _0x3c5f04 = _0xb7847f;
    return applyCharMap(upperAnglesCharMap, _0x3c5f04(0x298) + _0x204875 + _0x3c5f04(0x298));
}

function heart7(_0x724e05) {
    return applyCharMap(boldCharMap, 'ミミ◦❧◦°˚°◦.¸¸◦°´❤*•.¸♥\x20\x20' + _0x724e05 + '♥¸.•*❤´°◦¸¸.◦°˚°◦☙◦彡彡');
}

function emoticon0(_0x55682f) {
    var _0x23b1a4 = _0xb7847f;
    return applyCharMap(oldEnglishCharMap, _0x23b1a4(0x16d) + _0x55682f + _0x23b1a4(0x4b7));
}

function emoticon1(_0x44eaca) {
    var _0x5ad199 = _0xb7847f;
    return applyCharMap(squiggle6CharMap, _0x5ad199(0x24) + _0x44eaca + ')');
}

function emoticon2(_0x557812) {
    var _0x4d6117 = _0xb7847f;
    return applyCharMap(boldCharMap, _0x4d6117(0x50c) + _0x557812 + '');
}

function emoticon3(_0x258bf1) {
    var _0x5c027b = _0xb7847f;
    return applyCharMap(squiggle5CharMap, _0x5c027b(0x1ad) + _0x258bf1 + '');
}

function emoticon4(_0x259609) {
    var _0x191393 = _0xb7847f;
    return applyCharMap(cursiveCharMap, '(づ｡◕‿‿◕｡)づ\x20' + _0x259609 + _0x191393(0x450));
}

function emoticon5(_0x25770e) {
    var _0xb37bba = _0xb7847f;
    return applyCharMap(squiggle3CharMap, '🌘‿🌘\x20\x20' + _0x25770e + _0xb37bba(0x385));
}

function emoticon6(_0x5e7a96) {
    var _0x23e3b3 = _0xb7847f;
    return applyCharMap(wideTextCharMap, _0x23e3b3(0x393) + _0x5e7a96 + _0x23e3b3(0x1bc));
}

function emoticon7(_0x429361) {
    var _0x2024ba = _0xb7847f;
    return applyCharMap(squiggle2CharMap, _0x2024ba(0x38c) + _0x429361 + _0x2024ba(0x117));
}

function thankyou0(_0x2fe90c) {
    var _0x3cb2dd = _0xb7847f;
    return applyCharMap(doubleStruckCharMap, _0x3cb2dd(0x3e4) + _0x2fe90c + _0x3cb2dd(0x3cc));
}

function thankyou1(_0x46e40b) {
    var _0x2b90b9 = _0xb7847f;
    return applyCharMap(cursiveCharMap, _0x2b90b9(0x40b) + _0x46e40b + '(*ˊᗜˋ*)');
}

function thankyou2(_0x4bf3a) {
    var _0x1e26d1 = _0xb7847f;
    return applyCharMap(doubleStruckCharMap, _0x1e26d1(0x509) + _0x4bf3a + '(ω・*ゝ)');
}

function thankyou3(_0x49d4fc) {
    var _0x1a1407 = _0xb7847f;
    return applyCharMap(upperAnglesCharMap, _0x1a1407(0x129) + _0x49d4fc + '');
}

function thankyou4(_0x3c8c59) {
    var _0x273621 = _0xb7847f;
    return applyCharMap(squiggle2CharMap, _0x273621(0x3c4) + _0x3c8c59 + '');
}

function thankyou5(_0x220a44) {
    var _0xecea0d = _0xb7847f;
    return applyCharMap(asianStyleCharMap, _0xecea0d(0xf4) + _0x220a44 + _0xecea0d(0x164));
}

function thankyou6(_0x525fd8) {
    var _0x3e73ad = _0xb7847f;
    return applyCharMap(medievalCharMap, _0x3e73ad(0x339) + _0x525fd8 + _0x3e73ad(0x1db));
}

function thankyou7(_0x5d79ca) {
    var _0x5eca06 = _0xb7847f;
    return applyCharMap(neonCharMap, _0x5eca06(0x509) + _0x5d79ca + _0x5eca06(0x509));
}

function sad0(_0x32dbd1) {
    return applyCharMap(squiggle5CharMap, '(◕︿◕✿)\x20' + _0x32dbd1 + '\x20(๑′°︿°๑)');
}

function sad1(_0x4819d2) {
    return applyCharMap(monospaceCharMap, '┏༼\x20◉\x20╭╮\x20◉༽┓\x20' + _0x4819d2 + '\x20(︶︹︺)');
}

function sad2(_0x24a79f) {
    var _0x381ff5 = _0xb7847f;
    return applyCharMap(squiggleCharMap, _0x381ff5(0x39c) + _0x24a79f + _0x381ff5(0x1d7));
}

function sad3(_0xdfd1d) {
    var _0x5bfaee = _0xb7847f;
    return applyCharMap(italicCharMap, _0x5bfaee(0x523) + _0xdfd1d + _0x5bfaee(0x24b));
}

function sad4(_0x59181b) {
    var _0x471cb4 = _0xb7847f;
    return applyCharMap(squiggle3CharMap, '(ಥ\x20͜ʖಥ)\x20' + _0x59181b + _0x471cb4(0x3c8));
}

function sad5(_0x22b5dd) {
    var _0x35a4df = _0xb7847f;
    return applyCharMap(bentTextCharMap, _0x35a4df(0x41a) + _0x22b5dd + _0x35a4df(0x23d));
}

function sad6(_0x2f8285) {
    return applyCharMap(medievalCharMap, '(′︿‵｡)' + _0x2f8285 + '(|||❛︵❛.)');
}

function sad7(_0x5acc06) {
    var _0x33e915 = _0xb7847f;
    return applyCharMap(symbolsCharMap, _0x33e915(0x37a) + _0x5acc06 + _0x33e915(0x10f));
}

function cuteText1(_0x22b66c) {
    var _0x3d6d54 = _0xb7847f;
    return applyCharMap(italicCharMap, _0x3d6d54(0x1e9) + _0x22b66c + _0x3d6d54(0x1e9));
}

function cuteText2(_0x575c28) {
    var _0x3bea0c = _0xb7847f;
    return applyCharMap(squiggle5CharMap, _0x3bea0c(0x195) + _0x575c28 + _0x3bea0c(0x3d0));
}

function cuteText3(_0x4c3959) {
    var _0x440f6f = _0xb7847f;
    return applyCharMap(oldEnglishCharMap, _0x440f6f(0x26a) + _0x4c3959 + '\x20🎀\x20🍒');
}

function cuteText4(_0x4cd07a) {
    var _0x13ec1b = _0xb7847f;
    return applyCharMap(squiggleCharMap, _0x13ec1b(0x474) + _0x4cd07a + '★｡\x20🎀');
}

function cuteText5(_0x394ade) {
    var _0x19f3a0 = _0xb7847f;
    return applyCharMap(cursiveCharMap, _0x19f3a0(0x2b4) + _0x394ade + _0x19f3a0(0x348));
}

function fullCrazy1(_0x183f1e) {
    return applyCharMap(boldCharMap, '◥꧁ད\x20ॐ卐' + _0x183f1e + '\x20卐ॐ\x20ཌ꧂◤');
}

function fullCrazy2(_0x17a19d) {
    var _0x1b36e9 = _0xb7847f;
    return applyCharMap(squiggleCharMap, _0x1b36e9(0x25a) + _0x17a19d + _0x1b36e9(0x242));
}

function fullCrazy3(_0x5c1bc1) {
    var _0x5b49f2 = _0xb7847f;
    return applyCharMap(doubleStruckCharMap, _0x5b49f2(0x455) + _0x5c1bc1 + '\x20]÷••)—\x20');
}

function fullCrazy4(_0x242e32) {
    var _0x2548cb = _0xb7847f;
    return applyCharMap(currencyCharMap, _0x2548cb(0xe9) + _0x242e32 + _0x2548cb(0x8f));
}

function fullCrazy5(_0x197ffa) {
    var _0x3299b3 = _0xb7847f;
    return applyCharMap(wideTextCharMap, _0x3299b3(0x515) + _0x197ffa + '\x20✿◉●•◦');
}

function crazyWithFlourishOrSymbols3(_0x176d1c) {
    var _0x2a3448 = _0xb7847f;
    return applyCharMap(italicCharMap, _0x2a3448(0x115) + _0x176d1c + '\x20⎝⎝✧GͥOͣDͫ✧⎠⎠');
}

function crazyWithFlourishOrSymbols4(_0x5251ca) {
    var _0x1dd558 = _0xb7847f;
    return applyCharMap(asianStyle2CharMap, _0x1dd558(0x4c5) + _0x5251ca + _0x1dd558(0x123));
}

function crazyWithFlourishOrSymbols1(_0x589e4) {
    var _0x432b2f = _0xb7847f;
    return applyCharMap(italicCharMap, _0x432b2f(0x8) + _0x589e4 + '\x20⫸');
}

function crazyWithFlourishOrSymbols2(_0x2b1978) {
    var _0x25a1fb = _0xb7847f;
    return applyCharMap(boldItalicCharMap, _0x25a1fb(0x1e6) + _0x2b1978 + _0x25a1fb(0x16c));
}

function crazyWithFlourishOrSymbols5(_0x4e9d5f) {
    var _0x50a2be = _0xb7847f;
    return applyCharMap(squaresCharMap, _0x50a2be(0x2cd) + _0x4e9d5f + _0x50a2be(0x229));
}

function wrap1(_0x2d6af6) {
    var _0x5333fc = _0xb7847f;
    return applyCharMap(boldCharMap, _0x5333fc(0x245) + [_0x2d6af6] + _0x5333fc(0x142));
}

function wrap2(_0x354409) {
    var _0x1ef979 = _0xb7847f;
    return applyCharMap(cursiveCharMap, _0x1ef979(0xa6) + [_0x354409] + _0x1ef979(0x3));
}

function wrap3(_0x14b08b) {
    var _0x32cc59 = _0xb7847f;
    return applyCharMap(boldItalicCharMap, '▌│█║▌║▌║\x20' + [_0x14b08b] + _0x32cc59(0x1ce));
}

function wrap4(_0x1e5d87) {
    var _0x44c837 = _0xb7847f;
    return applyCharMap(neonCharMap, _0x44c837(0x258) + [_0x1e5d87] + _0x44c837(0x86));
}

function wrap5(_0x5a5598) {
    var _0x187479 = _0xb7847f;
    return applyCharMap(boldItalicCharMap, '╚»★«╝\x20' + [_0x5a5598] + _0x187479(0x5f));
}
var newtext = {
    's1': {
        0x1: '&alpha;',
        0x2: _0xb7847f(0x25e),
        0x3: _0xb7847f(0x92),
        0x4: '&#1283;',
        0x5: _0xb7847f(0x1f9),
        0x6: _0xb7847f(0x206),
        0x7: _0xb7847f(0x4b8),
        0x8: _0xb7847f(0x2ef),
        0x9: _0xb7847f(0x529),
        0xa: '&#669;',
        0xb: '&#409;',
        0xc: _0xb7847f(0x295),
        0xd: _0xb7847f(0x46c),
        0xe: _0xb7847f(0x491),
        0xf: _0xb7847f(0x43f),
        0x10: _0xb7847f(0x2ae),
        0x11: _0xb7847f(0x119),
        0x12: '&#638;',
        0x13: '&#642;',
        0x14: _0xb7847f(0x349),
        0x15: '&upsilon;',
        0x16: _0xb7847f(0x477),
        0x17: _0xb7847f(0x424),
        0x18: 'x',
        0x19: '&#4327;',
        0x1a: _0xb7847f(0x2d3),
        0x1b: 'A',
        0x1c: 'B',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: 'E',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: 'K',
        0x26: 'L',
        0x27: 'M',
        0x28: 'N',
        0x29: 'O',
        0x2a: 'P',
        0x2b: 'Q',
        0x2c: 'R',
        0x2d: 'S',
        0x2e: 'T',
        0x2f: 'U',
        0x30: 'V',
        0x31: 'W',
        0x32: 'X',
        0x33: 'Y',
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's2': {
        0x1: _0xb7847f(0x85),
        0x2: '&#9837;',
        0x3: _0xb7847f(0x79),
        0x4: _0xb7847f(0x212),
        0x5: _0xb7847f(0x2ad),
        0x6: _0xb7847f(0x37d),
        0x7: '&#10081;',
        0x8: _0xb7847f(0x2b3),
        0x9: '&#9815;',
        0xa: _0xb7847f(0x1e5),
        0xb: _0xb7847f(0x340),
        0xc: _0xb7847f(0x59),
        0xd: _0xb7847f(0x388),
        0xe: _0xb7847f(0x84),
        0xf: _0xb7847f(0x2a1),
        0x10: _0xb7847f(0x2ae),
        0x11: '&#9773;',
        0x12: '&#9736;',
        0x13: _0xb7847f(0x341),
        0x14: _0xb7847f(0x260),
        0x15: _0xb7847f(0x317),
        0x16: _0xb7847f(0x1d9),
        0x17: _0xb7847f(0x3b2),
        0x18: '&#8984;',
        0x19: _0xb7847f(0x2fb),
        0x1a: _0xb7847f(0x4d8),
        0x1b: _0xb7847f(0x85),
        0x1c: '&#9837;',
        0x1d: _0xb7847f(0x79),
        0x1e: _0xb7847f(0x212),
        0x1f: _0xb7847f(0x2ad),
        0x20: _0xb7847f(0x37d),
        0x21: _0xb7847f(0x2f4),
        0x22: _0xb7847f(0x2b3),
        0x23: _0xb7847f(0x4cb),
        0x24: _0xb7847f(0x1e5),
        0x25: '&#1008;',
        0x26: '&#8627;',
        0x27: _0xb7847f(0x388),
        0x28: _0xb7847f(0x84),
        0x29: _0xb7847f(0x2a1),
        0x2a: '&rho;',
        0x2b: _0xb7847f(0x188),
        0x2c: _0xb7847f(0x2b9),
        0x2d: _0xb7847f(0x341),
        0x2e: _0xb7847f(0x260),
        0x2f: _0xb7847f(0x317),
        0x30: _0xb7847f(0x1d9),
        0x31: _0xb7847f(0x3b2),
        0x32: '&#8984;',
        0x33: '&#9791;',
        0x34: '&#9761;',
        0x35: _0xb7847f(0x3ed),
        0x36: _0xb7847f(0x451),
        0x37: '&#10124;',
        0x38: '&#10125;',
        0x39: _0xb7847f(0x33d),
        0x3a: _0xb7847f(0x96),
        0x3b: _0xb7847f(0x22a),
        0x3c: _0xb7847f(0x221),
        0x3d: _0xb7847f(0x334),
        0x3e: _0xb7847f(0x232)
    },
    's3': {
        0x1: _0xb7847f(0x160),
        0x2: _0xb7847f(0x394),
        0x3: _0xb7847f(0x15b),
        0x4: _0xb7847f(0xad),
        0x5: _0xb7847f(0x5b),
        0x6: '&#358;',
        0x7: _0xb7847f(0xfc),
        0x8: _0xb7847f(0x233),
        0x9: _0xb7847f(0x3a2),
        0xa: _0xb7847f(0x7b),
        0xb: _0xb7847f(0x309),
        0xc: _0xb7847f(0x222),
        0xd: _0xb7847f(0xab),
        0xe: _0xb7847f(0x36f),
        0xf: _0xb7847f(0x3eb),
        0x10: _0xb7847f(0x150),
        0x11: 'Q',
        0x12: _0xb7847f(0x182),
        0x13: _0xb7847f(0x1b4),
        0x14: '&#356;',
        0x15: _0xb7847f(0x4d3),
        0x16: 'V',
        0x17: _0xb7847f(0x11c),
        0x18: '&#1046;',
        0x19: '&#374;',
        0x1a: '&#377;',
        0x1b: '&#258;',
        0x1c: _0xb7847f(0x394),
        0x1d: _0xb7847f(0x15b),
        0x1e: _0xb7847f(0xad),
        0x1f: _0xb7847f(0x5b),
        0x20: _0xb7847f(0x20e),
        0x21: _0xb7847f(0xfc),
        0x22: '&#292;',
        0x23: _0xb7847f(0x3a2),
        0x24: _0xb7847f(0x7b),
        0x25: _0xb7847f(0x309),
        0x26: '&#313;',
        0x27: _0xb7847f(0xab),
        0x28: _0xb7847f(0x36f),
        0x29: _0xb7847f(0x3eb),
        0x2a: _0xb7847f(0x150),
        0x2b: 'Q',
        0x2c: '&#340;',
        0x2d: _0xb7847f(0x1b4),
        0x2e: _0xb7847f(0x484),
        0x2f: _0xb7847f(0x4d3),
        0x30: 'V',
        0x31: _0xb7847f(0x11c),
        0x32: _0xb7847f(0x72),
        0x33: _0xb7847f(0x1f3),
        0x34: _0xb7847f(0x508),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's4': {
        0x1: _0xb7847f(0x2db),
        0x2: 'q',
        0x3: _0xb7847f(0x521),
        0x4: 'p',
        0x5: '&#477;',
        0x6: _0xb7847f(0x1cc),
        0x7: '&#387;',
        0x8: _0xb7847f(0xe3),
        0x9: _0xb7847f(0x1d4),
        0xa: _0xb7847f(0x461),
        0xb: _0xb7847f(0x121),
        0xc: 'l',
        0xd: _0xb7847f(0x424),
        0xe: 'u',
        0xf: 'o',
        0x10: 'd',
        0x11: 'b',
        0x12: _0xb7847f(0xe2),
        0x13: 's',
        0x14: _0xb7847f(0x202),
        0x15: 'n',
        0x16: _0xb7847f(0x27d),
        0x17: _0xb7847f(0x9f),
        0x18: 'x',
        0x19: _0xb7847f(0x1da),
        0x1a: 'z',
        0x1b: _0xb7847f(0x2db),
        0x1c: 'q',
        0x1d: _0xb7847f(0x521),
        0x1e: 'p',
        0x1f: _0xb7847f(0x15a),
        0x20: '&#607;',
        0x21: _0xb7847f(0x2d),
        0x22: _0xb7847f(0xe3),
        0x23: '&#7433;',
        0x24: _0xb7847f(0x461),
        0x25: _0xb7847f(0x121),
        0x26: 'l',
        0x27: '&#623;',
        0x28: 'u',
        0x29: 'o',
        0x2a: 'd',
        0x2b: 'b',
        0x2c: _0xb7847f(0xe2),
        0x2d: 's',
        0x2e: '&#647;',
        0x2f: 'n',
        0x30: _0xb7847f(0x27d),
        0x31: '&#653;',
        0x32: 'x',
        0x33: _0xb7847f(0x1da),
        0x34: 'z',
        0x35: _0xb7847f(0x125),
        0x36: _0xb7847f(0x2f8),
        0x37: '&#400;',
        0x38: _0xb7847f(0x4cd),
        0x39: '&#987;',
        0x3a: '9',
        0x3b: _0xb7847f(0x2ee),
        0x3c: '8',
        0x3d: '6',
        0x3e: '0'
    },
    's5': {
        0x1: '&Delta;',
        0x2: '&beta;',
        0x3: _0xb7847f(0x361),
        0x4: _0xb7847f(0x126),
        0x5: _0xb7847f(0x2ad),
        0x6: '&#8355;',
        0x7: _0xb7847f(0x4e3),
        0x8: _0xb7847f(0x16f),
        0x9: '&#407;',
        0xa: _0xb7847f(0x7b),
        0xb: '&#1180;',
        0xc: '&#321;',
        0xd: _0xb7847f(0x51b),
        0xe: _0xb7847f(0x511),
        0xf: _0xb7847f(0x20a),
        0x10: _0xb7847f(0x6d),
        0x11: _0xb7847f(0x444),
        0x12: _0xb7847f(0x4b9),
        0x13: _0xb7847f(0x427),
        0x14: _0xb7847f(0x20e),
        0x15: '&#7918;',
        0x16: 'V',
        0x17: '&#372;',
        0x18: _0xb7847f(0x72),
        0x19: _0xb7847f(0x2d4),
        0x1a: '&#381;',
        0x1b: _0xb7847f(0x3c),
        0x1c: '&beta;',
        0x1d: '&#262;',
        0x1e: _0xb7847f(0x126),
        0x1f: _0xb7847f(0x2ad),
        0x20: '&#8355;',
        0x21: _0xb7847f(0x4e3),
        0x22: _0xb7847f(0x16f),
        0x23: _0xb7847f(0xb7),
        0x24: '&#308;',
        0x25: _0xb7847f(0xc),
        0x26: _0xb7847f(0x34d),
        0x27: _0xb7847f(0x51b),
        0x28: '&#327;',
        0x29: _0xb7847f(0x20a),
        0x2a: '&#420;',
        0x2b: _0xb7847f(0x444),
        0x2c: _0xb7847f(0x4b9),
        0x2d: _0xb7847f(0x427),
        0x2e: _0xb7847f(0x20e),
        0x2f: '&#7918;',
        0x30: 'V',
        0x31: '&#372;',
        0x32: _0xb7847f(0x72),
        0x33: _0xb7847f(0x2d4),
        0x34: _0xb7847f(0x39),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's6': {
        0x1: _0xb7847f(0x485),
        0x2: _0xb7847f(0x8a),
        0x3: '&#2798;',
        0x4: _0xb7847f(0x46),
        0x5: _0xb7847f(0x1fc),
        0x6: _0xb7847f(0xc6),
        0x7: '&#608;',
        0x8: '&#614;',
        0x9: _0xb7847f(0x319),
        0xa: _0xb7847f(0x3f1),
        0xb: _0xb7847f(0x3e7),
        0xc: _0xb7847f(0x2d0),
        0xd: _0xb7847f(0x46c),
        0xe: _0xb7847f(0x491),
        0xf: _0xb7847f(0x43f),
        0x10: _0xb7847f(0x2ae),
        0x11: '&phi;',
        0x12: _0xb7847f(0x488),
        0x13: _0xb7847f(0x1f4),
        0x14: '&#429;',
        0x15: _0xb7847f(0x3b7),
        0x16: _0xb7847f(0x1c8),
        0x17: '&omega;',
        0x18: _0xb7847f(0x12a),
        0x19: '&#4327;',
        0x1a: _0xb7847f(0x13e),
        0x1b: _0xb7847f(0x485),
        0x1c: _0xb7847f(0x8a),
        0x1d: _0xb7847f(0x3d1),
        0x1e: _0xb7847f(0x46),
        0x1f: _0xb7847f(0x1fc),
        0x20: _0xb7847f(0xc6),
        0x21: _0xb7847f(0x4b8),
        0x22: '&#614;',
        0x23: _0xb7847f(0x319),
        0x24: _0xb7847f(0x3f1),
        0x25: _0xb7847f(0x3e7),
        0x26: _0xb7847f(0x2d0),
        0x27: _0xb7847f(0x46c),
        0x28: '&#627;',
        0x29: _0xb7847f(0x43f),
        0x2a: '&rho;',
        0x2b: _0xb7847f(0x1f2),
        0x2c: _0xb7847f(0x488),
        0x2d: _0xb7847f(0x1f4),
        0x2e: _0xb7847f(0x13f),
        0x2f: _0xb7847f(0x3b7),
        0x30: _0xb7847f(0x1c8),
        0x31: _0xb7847f(0x3b2),
        0x32: _0xb7847f(0x12a),
        0x33: _0xb7847f(0x211),
        0x34: '&#438;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's7': {
        0x1: _0xb7847f(0xd6),
        0x2: _0xb7847f(0x41d),
        0x3: _0xb7847f(0x262),
        0x4: _0xb7847f(0x1b5),
        0x5: '&#5620;',
        0x6: _0xb7847f(0x1c0),
        0x7: '&#484;',
        0x8: _0xb7847f(0x172),
        0x9: _0xb7847f(0x1c),
        0xa: _0xb7847f(0x494),
        0xb: '&#5845;',
        0xc: '&#5290;',
        0xd: _0xb7847f(0x3ea),
        0xe: _0xb7847f(0x325),
        0xf: _0xb7847f(0x3d5),
        0x10: _0xb7847f(0x220),
        0x11: _0xb7847f(0x434),
        0x12: _0xb7847f(0x27f),
        0x13: _0xb7847f(0x27c),
        0x14: _0xb7847f(0x39f),
        0x15: _0xb7847f(0x2eb),
        0x16: _0xb7847f(0x140),
        0x17: _0xb7847f(0x24c),
        0x18: '&#5741;',
        0x19: _0xb7847f(0x209),
        0x1a: _0xb7847f(0x1a9),
        0x1b: '&#5609;',
        0x1c: _0xb7847f(0x41d),
        0x1d: _0xb7847f(0x262),
        0x1e: _0xb7847f(0x1b5),
        0x1f: _0xb7847f(0x6f),
        0x20: _0xb7847f(0x1c0),
        0x21: _0xb7847f(0x4e3),
        0x22: _0xb7847f(0x172),
        0x23: _0xb7847f(0x1c),
        0x24: _0xb7847f(0x494),
        0x25: _0xb7847f(0x4b),
        0x26: _0xb7847f(0x2ab),
        0x27: _0xb7847f(0x3ea),
        0x28: '&#5198;',
        0x29: '&#5597;',
        0x2a: _0xb7847f(0x220),
        0x2b: _0xb7847f(0x434),
        0x2c: '&#5511;',
        0x2d: _0xb7847f(0x27c),
        0x2e: _0xb7847f(0x39f),
        0x2f: _0xb7847f(0x2eb),
        0x30: _0xb7847f(0x140),
        0x31: '&#5615;',
        0x32: _0xb7847f(0x33f),
        0x33: '&#435;',
        0x34: _0xb7847f(0x1a9),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's8': {
        0x1: _0xb7847f(0x24f),
        0x2: _0xb7847f(0x38e),
        0x3: _0xb7847f(0x3a0),
        0x4: _0xb7847f(0x2be),
        0x5: _0xb7847f(0x318),
        0x6: 'f',
        0x7: _0xb7847f(0x21a),
        0x8: 'h',
        0x9: '&#7990;',
        0xa: _0xb7847f(0x448),
        0xb: _0xb7847f(0x130),
        0xc: 'l',
        0xd: _0xb7847f(0x302),
        0xe: _0xb7847f(0x473),
        0xf: _0xb7847f(0x289),
        0x10: _0xb7847f(0x2ae),
        0x11: _0xb7847f(0x50),
        0x12: _0xb7847f(0x47b),
        0x13: _0xb7847f(0xfa),
        0x14: _0xb7847f(0x28),
        0x15: _0xb7847f(0x36),
        0x16: _0xb7847f(0xf0),
        0x17: 'w',
        0x18: _0xb7847f(0x39d),
        0x19: '&#4327;',
        0x1a: '&#576;',
        0x1b: _0xb7847f(0x24f),
        0x1c: '&#4329;',
        0x1d: _0xb7847f(0x3a0),
        0x1e: _0xb7847f(0x2be),
        0x1f: _0xb7847f(0x318),
        0x20: 'f',
        0x21: _0xb7847f(0x21a),
        0x22: 'h',
        0x23: _0xb7847f(0x2a9),
        0x24: _0xb7847f(0x448),
        0x25: '&kappa;',
        0x26: 'l',
        0x27: '&#4317;',
        0x28: _0xb7847f(0x473),
        0x29: '&otilde;',
        0x2a: _0xb7847f(0x2ae),
        0x2b: '&#4306;',
        0x2c: '&Gamma;',
        0x2d: _0xb7847f(0xfa),
        0x2e: '&#3923;',
        0x2f: '&upsilon;',
        0x30: _0xb7847f(0xf0),
        0x31: 'w',
        0x32: _0xb7847f(0x39d),
        0x33: _0xb7847f(0x211),
        0x34: _0xb7847f(0x4a6),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's9': {
        0x1: _0xb7847f(0x28c),
        0x2: _0xb7847f(0x183),
        0x3: _0xb7847f(0x300),
        0x4: '&#545;',
        0x5: _0xb7847f(0x449),
        0x6: _0xb7847f(0x4ae),
        0x7: _0xb7847f(0x2f0),
        0x8: _0xb7847f(0x1af),
        0x9: _0xb7847f(0x4ec),
        0xa: '&#1112;',
        0xb: _0xb7847f(0x4f6),
        0xc: _0xb7847f(0x278),
        0xd: _0xb7847f(0x426),
        0xe: _0xb7847f(0x205),
        0xf: _0xb7847f(0x2fc),
        0x10: '&rho;',
        0x11: 'q',
        0x12: '&#341;',
        0x13: _0xb7847f(0x2ca),
        0x14: '&#355;',
        0x15: _0xb7847f(0x163),
        0x16: _0xb7847f(0x20b),
        0x17: _0xb7847f(0x9e),
        0x18: 'x',
        0x19: _0xb7847f(0x326),
        0x1a: _0xb7847f(0xec),
        0x1b: _0xb7847f(0x28c),
        0x1c: _0xb7847f(0x183),
        0x1d: _0xb7847f(0x300),
        0x1e: _0xb7847f(0x124),
        0x1f: _0xb7847f(0x449),
        0x20: '&#1171;',
        0x21: _0xb7847f(0x2f0),
        0x22: _0xb7847f(0x1af),
        0x23: _0xb7847f(0x4ec),
        0x24: _0xb7847f(0x418),
        0x25: '&#311;',
        0x26: _0xb7847f(0x278),
        0x27: _0xb7847f(0x426),
        0x28: _0xb7847f(0x205),
        0x29: _0xb7847f(0x2fc),
        0x2a: '&rho;',
        0x2b: 'q',
        0x2c: _0xb7847f(0x199),
        0x2d: _0xb7847f(0x2ca),
        0x2e: _0xb7847f(0x3a),
        0x2f: _0xb7847f(0x163),
        0x30: _0xb7847f(0x20b),
        0x31: _0xb7847f(0x9e),
        0x32: 'x',
        0x33: _0xb7847f(0x326),
        0x34: _0xb7847f(0xec),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's10': {
        0x1: _0xb7847f(0x4a2),
        0x2: _0xb7847f(0x514),
        0x3: _0xb7847f(0x471),
        0x4: _0xb7847f(0x144),
        0x5: _0xb7847f(0x33a),
        0x6: _0xb7847f(0x2cf),
        0x7: '&#41037;',
        0x8: _0xb7847f(0x283),
        0x9: _0xb7847f(0xed),
        0xa: _0xb7847f(0x21b),
        0xb: _0xb7847f(0x2e9),
        0xc: '&#42130;',
        0xd: _0xb7847f(0x1b3),
        0xe: _0xb7847f(0x272),
        0xf: _0xb7847f(0x204),
        0x10: _0xb7847f(0xdb),
        0x11: _0xb7847f(0x17c),
        0x12: _0xb7847f(0x3ee),
        0x13: '&#41754;',
        0x14: '&#42181;',
        0x15: _0xb7847f(0x2c3),
        0x16: _0xb7847f(0x66),
        0x17: _0xb7847f(0x34c),
        0x18: _0xb7847f(0x274),
        0x19: '&#42015;',
        0x1a: _0xb7847f(0x1d8),
        0x1b: _0xb7847f(0x4a2),
        0x1c: _0xb7847f(0x514),
        0x1d: _0xb7847f(0x471),
        0x1e: _0xb7847f(0x144),
        0x1f: '&#41823;',
        0x20: _0xb7847f(0x2cf),
        0x21: '&#41037;',
        0x22: _0xb7847f(0x283),
        0x23: _0xb7847f(0xed),
        0x24: '&#41005;',
        0x25: _0xb7847f(0x2e9),
        0x26: _0xb7847f(0x48c),
        0x27: '&#41042;',
        0x28: _0xb7847f(0x272),
        0x29: _0xb7847f(0x204),
        0x2a: _0xb7847f(0xdb),
        0x2b: '&#41080;',
        0x2c: _0xb7847f(0x3ee),
        0x2d: '&#41754;',
        0x2e: _0xb7847f(0x408),
        0x2f: _0xb7847f(0x2c3),
        0x30: _0xb7847f(0x66),
        0x31: _0xb7847f(0x34c),
        0x32: '&#41427;',
        0x33: _0xb7847f(0x4b6),
        0x34: _0xb7847f(0x1d8),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's11': {
        0x1: _0xb7847f(0x419),
        0x2: _0xb7847f(0x3b1),
        0x3: 'C',
        0x4: 'D',
        0x5: _0xb7847f(0xd7),
        0x6: 'F',
        0x7: 'G',
        0x8: 'H',
        0x9: 'I',
        0xa: 'J',
        0xb: '&#1180;',
        0xc: 'L',
        0xd: 'M',
        0xe: _0xb7847f(0x94),
        0xf: '&#1060;',
        0x10: 'P',
        0x11: _0xb7847f(0x1ec),
        0x12: _0xb7847f(0x462),
        0x13: 'S',
        0x14: _0xb7847f(0x47b),
        0x15: '&#1062;',
        0x16: 'V',
        0x17: _0xb7847f(0x4ad),
        0x18: '&#1046;',
        0x19: _0xb7847f(0x12),
        0x1a: 'Z',
        0x1b: '&#1044;',
        0x1c: _0xb7847f(0x3b1),
        0x1d: 'C',
        0x1e: 'D',
        0x1f: _0xb7847f(0xd7),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: _0xb7847f(0xc),
        0x26: 'L',
        0x27: 'M',
        0x28: '&#1048;',
        0x29: _0xb7847f(0x301),
        0x2a: 'P',
        0x2b: _0xb7847f(0x1ec),
        0x2c: _0xb7847f(0x462),
        0x2d: 'S',
        0x2e: _0xb7847f(0x47b),
        0x2f: _0xb7847f(0x267),
        0x30: 'V',
        0x31: _0xb7847f(0x4ad),
        0x32: '&#1046;',
        0x33: _0xb7847f(0x12),
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's12': {
        0x1: _0xb7847f(0x85),
        0x2: _0xb7847f(0x33e),
        0x3: '&#41555;',
        0x4: _0xb7847f(0x413),
        0x5: _0xb7847f(0x33a),
        0x6: '&#41863;',
        0x7: _0xb7847f(0x21f),
        0x8: '&#41157;',
        0x9: _0xb7847f(0x3f4),
        0xa: _0xb7847f(0x21b),
        0xb: _0xb7847f(0x246),
        0xc: _0xb7847f(0x48c),
        0xd: _0xb7847f(0x4de),
        0xe: _0xb7847f(0x3d3),
        0xf: _0xb7847f(0x2ce),
        0x10: _0xb7847f(0xdb),
        0x11: _0xb7847f(0x31),
        0x12: _0xb7847f(0xba),
        0x13: _0xb7847f(0x44c),
        0x14: _0xb7847f(0x2c6),
        0x15: _0xb7847f(0x50a),
        0x16: _0xb7847f(0x103),
        0x17: _0xb7847f(0x213),
        0x18: _0xb7847f(0x46b),
        0x19: _0xb7847f(0x4e0),
        0x1a: _0xb7847f(0x1d8),
        0x1b: '&#41807;',
        0x1c: _0xb7847f(0x33e),
        0x1d: _0xb7847f(0x1e8),
        0x1e: '&#41016;',
        0x1f: _0xb7847f(0x33a),
        0x20: _0xb7847f(0x285),
        0x21: _0xb7847f(0x21f),
        0x22: _0xb7847f(0x4ac),
        0x23: '&#40996;',
        0x24: _0xb7847f(0x21b),
        0x25: _0xb7847f(0x246),
        0x26: _0xb7847f(0x48c),
        0x27: _0xb7847f(0x4de),
        0x28: _0xb7847f(0x3d3),
        0x29: _0xb7847f(0x2ce),
        0x2a: _0xb7847f(0xdb),
        0x2b: _0xb7847f(0x31),
        0x2c: '&#41706;',
        0x2d: _0xb7847f(0x44c),
        0x2e: _0xb7847f(0x2c6),
        0x2f: '&#40974;',
        0x30: _0xb7847f(0x103),
        0x31: _0xb7847f(0x213),
        0x32: _0xb7847f(0x46b),
        0x33: _0xb7847f(0x4e0),
        0x34: _0xb7847f(0x1d8),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's13': {
        0x1: '&#41708;',
        0x2: '&#41203;',
        0x3: _0xb7847f(0x3a1),
        0x4: '&#42159;',
        0x5: _0xb7847f(0x30),
        0x6: _0xb7847f(0x4a3),
        0x7: _0xb7847f(0x366),
        0x8: _0xb7847f(0x187),
        0x9: _0xb7847f(0x312),
        0xa: '&#42171;',
        0xb: _0xb7847f(0x246),
        0xc: _0xb7847f(0x48c),
        0xd: _0xb7847f(0x4de),
        0xe: _0xb7847f(0x414),
        0xf: _0xb7847f(0x1dd),
        0x10: _0xb7847f(0xdb),
        0x11: '&#41392;',
        0x12: _0xb7847f(0xba),
        0x13: _0xb7847f(0x24e),
        0x14: _0xb7847f(0x2c6),
        0x15: _0xb7847f(0x18c),
        0x16: '&#42150;',
        0x17: _0xb7847f(0x34c),
        0x18: _0xb7847f(0x6),
        0x19: _0xb7847f(0x4ba),
        0x1a: '&#41076;',
        0x1b: '&#41708;',
        0x1c: _0xb7847f(0x70),
        0x1d: _0xb7847f(0x3a1),
        0x1e: _0xb7847f(0x374),
        0x1f: _0xb7847f(0x30),
        0x20: '&#41648;',
        0x21: _0xb7847f(0x366),
        0x22: _0xb7847f(0x187),
        0x23: _0xb7847f(0x312),
        0x24: _0xb7847f(0x286),
        0x25: _0xb7847f(0x246),
        0x26: _0xb7847f(0x48c),
        0x27: _0xb7847f(0x4de),
        0x28: _0xb7847f(0x414),
        0x29: '&#41266;',
        0x2a: _0xb7847f(0xdb),
        0x2b: _0xb7847f(0x31),
        0x2c: _0xb7847f(0xba),
        0x2d: _0xb7847f(0x24e),
        0x2e: '&#42180;',
        0x2f: _0xb7847f(0x18c),
        0x30: _0xb7847f(0x3d2),
        0x31: _0xb7847f(0x34c),
        0x32: '&#41575;',
        0x33: _0xb7847f(0x4ba),
        0x34: _0xb7847f(0x1d8),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's14': {
        0x1: _0xb7847f(0x42e),
        0x2: '&#998;',
        0x3: _0xb7847f(0xd8),
        0x4: _0xb7847f(0x2e4),
        0x5: _0xb7847f(0x12b),
        0x6: 'F',
        0x7: '&#403;',
        0x8: _0xb7847f(0xe7),
        0x9: '&#618;',
        0xa: '&#65420;',
        0xb: _0xb7847f(0x392),
        0xc: _0xb7847f(0x34d),
        0xd: _0xb7847f(0x2bc),
        0xe: _0xb7847f(0x447),
        0xf: _0xb7847f(0x20a),
        0x10: _0xb7847f(0x29c),
        0x11: _0xb7847f(0x3bf),
        0x12: _0xb7847f(0xa5),
        0x13: _0xb7847f(0x270),
        0x14: '&#356;',
        0x15: _0xb7847f(0x267),
        0x16: _0xb7847f(0xfd),
        0x17: _0xb7847f(0x507),
        0x18: _0xb7847f(0x12f),
        0x19: _0xb7847f(0x25c),
        0x1a: _0xb7847f(0x3ef),
        0x1b: _0xb7847f(0x42e),
        0x1c: '&#998;',
        0x1d: _0xb7847f(0xd8),
        0x1e: '&ETH;',
        0x1f: '&#400;',
        0x20: 'F',
        0x21: _0xb7847f(0x158),
        0x22: _0xb7847f(0xe7),
        0x23: _0xb7847f(0x35d),
        0x24: _0xb7847f(0x381),
        0x25: '&#1178;',
        0x26: _0xb7847f(0x34d),
        0x27: _0xb7847f(0x2bc),
        0x28: _0xb7847f(0x447),
        0x29: '&Oslash;',
        0x2a: _0xb7847f(0x29c),
        0x2b: _0xb7847f(0x3bf),
        0x2c: '&#23610;',
        0x2d: _0xb7847f(0x270),
        0x2e: _0xb7847f(0x484),
        0x2f: '&#1062;',
        0x30: _0xb7847f(0xfd),
        0x31: '&#412;',
        0x32: _0xb7847f(0x12f),
        0x33: _0xb7847f(0x25c),
        0x34: _0xb7847f(0x3ef),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's15': {
        0x1: _0xb7847f(0x3e5),
        0x2: _0xb7847f(0x42d),
        0x3: '&#391;',
        0x4: _0xb7847f(0xee),
        0x5: _0xb7847f(0x62),
        0x6: _0xb7847f(0x45a),
        0x7: _0xb7847f(0x158),
        0x8: _0xb7847f(0x4e5),
        0x9: _0xb7847f(0x125),
        0xa: _0xb7847f(0x3d8),
        0xb: _0xb7847f(0x14b),
        0xc: _0xb7847f(0x152),
        0xd: 'M',
        0xe: _0xb7847f(0x16a),
        0xf: _0xb7847f(0x1c2),
        0x10: _0xb7847f(0x6d),
        0x11: '&#418;',
        0x12: _0xb7847f(0x3dc),
        0x13: '&#423;',
        0x14: _0xb7847f(0x294),
        0x15: _0xb7847f(0x4bd),
        0x16: _0xb7847f(0xfd),
        0x17: _0xb7847f(0x507),
        0x18: _0xb7847f(0x4b0),
        0x19: _0xb7847f(0x209),
        0x1a: '&#548;',
        0x1b: '&#411;',
        0x1c: '&#385;',
        0x1d: _0xb7847f(0x446),
        0x1e: '&#394;',
        0x1f: _0xb7847f(0x62),
        0x20: _0xb7847f(0x45a),
        0x21: '&#403;',
        0x22: _0xb7847f(0x4e5),
        0x23: '&#406;',
        0x24: _0xb7847f(0x3d8),
        0x25: _0xb7847f(0x14b),
        0x26: '&#1340;',
        0x27: 'M',
        0x28: _0xb7847f(0x16a),
        0x29: _0xb7847f(0x1c2),
        0x2a: '&#420;',
        0x2b: _0xb7847f(0x1c3),
        0x2c: _0xb7847f(0x3dc),
        0x2d: _0xb7847f(0x1f1),
        0x2e: '&#428;',
        0x2f: _0xb7847f(0x4bd),
        0x30: '&#404;',
        0x31: _0xb7847f(0x507),
        0x32: _0xb7847f(0x4b0),
        0x33: _0xb7847f(0x209),
        0x34: _0xb7847f(0x135),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's16': {
        0x1: _0xb7847f(0x13d),
        0x2: _0xb7847f(0x409),
        0x3: _0xb7847f(0x2e5),
        0x4: _0xb7847f(0x145),
        0x5: _0xb7847f(0x2d9),
        0x6: _0xb7847f(0x4cf),
        0x7: _0xb7847f(0x21f),
        0x8: _0xb7847f(0x3d6),
        0x9: _0xb7847f(0xed),
        0xa: _0xb7847f(0x286),
        0xb: '&#40983;',
        0xc: '&#42130;',
        0xd: '&#41141;',
        0xe: _0xb7847f(0x414),
        0xf: '&#41126;',
        0x10: _0xb7847f(0xdb),
        0x11: _0xb7847f(0x19d),
        0x12: '&#41733;',
        0x13: _0xb7847f(0x26d),
        0x14: '&#41686;',
        0x15: _0xb7847f(0x2c3),
        0x16: _0xb7847f(0x132),
        0x17: _0xb7847f(0x213),
        0x18: _0xb7847f(0x191),
        0x19: _0xb7847f(0x3cd),
        0x1a: _0xb7847f(0x1d8),
        0x1b: '&#41074;',
        0x1c: _0xb7847f(0x409),
        0x1d: _0xb7847f(0x2e5),
        0x1e: _0xb7847f(0x145),
        0x1f: _0xb7847f(0x2d9),
        0x20: _0xb7847f(0x4cf),
        0x21: '&#41029;',
        0x22: _0xb7847f(0x3d6),
        0x23: '&#41105;',
        0x24: _0xb7847f(0x286),
        0x25: _0xb7847f(0x2e9),
        0x26: '&#42130;',
        0x27: _0xb7847f(0x4de),
        0x28: _0xb7847f(0x414),
        0x29: _0xb7847f(0x2ce),
        0x2a: _0xb7847f(0xdb),
        0x2b: _0xb7847f(0x19d),
        0x2c: _0xb7847f(0x2fe),
        0x2d: _0xb7847f(0x26d),
        0x2e: '&#41686;',
        0x2f: _0xb7847f(0x2c3),
        0x30: _0xb7847f(0x132),
        0x31: _0xb7847f(0x213),
        0x32: _0xb7847f(0x191),
        0x33: _0xb7847f(0x3cd),
        0x34: _0xb7847f(0x1d8),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's17': {
        0x1: _0xb7847f(0x228),
        0x2: '&#1349;',
        0x3: _0xb7847f(0x4d6),
        0x4: _0xb7847f(0x4ce),
        0x5: _0xb7847f(0x259),
        0x6: _0xb7847f(0x1ea),
        0x7: _0xb7847f(0x141),
        0x8: _0xb7847f(0x18e),
        0x9: '&#639;',
        0xa: _0xb7847f(0x3f1),
        0xb: _0xb7847f(0x4ab),
        0xc: _0xb7847f(0x295),
        0xd: '&#653;',
        0xe: _0xb7847f(0xdc),
        0xf: _0xb7847f(0x1ca),
        0x10: _0xb7847f(0x2ae),
        0x11: _0xb7847f(0x1f2),
        0x12: _0xb7847f(0xa),
        0x13: '&#1359;',
        0x14: _0xb7847f(0x46e),
        0x15: _0xb7847f(0x4f8),
        0x16: _0xb7847f(0x3d7),
        0x17: _0xb7847f(0x50e),
        0x18: _0xb7847f(0xbe),
        0x19: '&#1358;',
        0x1a: _0xb7847f(0x288),
        0x1b: _0xb7847f(0x228),
        0x1c: _0xb7847f(0xaf),
        0x1d: _0xb7847f(0x4d6),
        0x1e: _0xb7847f(0x4ce),
        0x1f: _0xb7847f(0x259),
        0x20: _0xb7847f(0x1ea),
        0x21: _0xb7847f(0x141),
        0x22: _0xb7847f(0x18e),
        0x23: _0xb7847f(0x3aa),
        0x24: _0xb7847f(0x3f1),
        0x25: '&#409;',
        0x26: _0xb7847f(0x295),
        0x27: '&#653;',
        0x28: '&#1356;',
        0x29: _0xb7847f(0x1ca),
        0x2a: _0xb7847f(0x2ae),
        0x2b: _0xb7847f(0x1f2),
        0x2c: _0xb7847f(0xa),
        0x2d: _0xb7847f(0x2cc),
        0x2e: _0xb7847f(0x46e),
        0x2f: _0xb7847f(0x4f8),
        0x30: _0xb7847f(0x3d7),
        0x31: _0xb7847f(0x50e),
        0x32: _0xb7847f(0xbe),
        0x33: _0xb7847f(0x296),
        0x34: _0xb7847f(0x288),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's18': {
        0x1: _0xb7847f(0x485),
        0x2: '&szlig;',
        0x3: '&sigmaf;',
        0x4: 'd',
        0x5: _0xb7847f(0x1fc),
        0x6: '&fnof;',
        0x7: 'g',
        0x8: 'h',
        0x9: _0xb7847f(0xbd),
        0xa: '&#1397;',
        0xb: _0xb7847f(0x130),
        0xc: _0xb7847f(0x44f),
        0xd: 'm',
        0xe: _0xb7847f(0xb8),
        0xf: _0xb7847f(0x26c),
        0x10: 'p',
        0x11: _0xb7847f(0x444),
        0x12: 'r',
        0x13: _0xb7847f(0x1b7),
        0x14: _0xb7847f(0x239),
        0x15: 'u',
        0x16: _0xb7847f(0x1a2),
        0x17: '&omega;',
        0x18: 'x',
        0x19: _0xb7847f(0x1bf),
        0x1a: 'z',
        0x1b: _0xb7847f(0x485),
        0x1c: _0xb7847f(0x168),
        0x1d: _0xb7847f(0x300),
        0x1e: 'd',
        0x1f: '&epsilon;',
        0x20: '&fnof;',
        0x21: 'g',
        0x22: 'h',
        0x23: _0xb7847f(0xbd),
        0x24: '&#1397;',
        0x25: '&kappa;',
        0x26: _0xb7847f(0x44f),
        0x27: 'm',
        0x28: '&eta;',
        0x29: _0xb7847f(0x26c),
        0x2a: 'p',
        0x2b: _0xb7847f(0x444),
        0x2c: 'r',
        0x2d: _0xb7847f(0x1b7),
        0x2e: _0xb7847f(0x239),
        0x2f: 'u',
        0x30: _0xb7847f(0x1a2),
        0x31: '&omega;',
        0x32: 'x',
        0x33: _0xb7847f(0x1bf),
        0x34: 'z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's19': {
        0x1: '&#3588;',
        0x2: _0xb7847f(0x21a),
        0x3: _0xb7847f(0xb6),
        0x4: _0xb7847f(0x2be),
        0x5: '&#2799;',
        0x6: '&#1330;',
        0x7: _0xb7847f(0x420),
        0x8: _0xb7847f(0x1e0),
        0x9: _0xb7847f(0x3aa),
        0xa: '&#646;',
        0xb: _0xb7847f(0x49a),
        0xc: _0xb7847f(0x3f5),
        0xd: _0xb7847f(0x46c),
        0xe: _0xb7847f(0x13b),
        0xf: _0xb7847f(0x1d1),
        0x10: '&#447;',
        0x11: _0xb7847f(0x247),
        0x12: _0xb7847f(0xa),
        0x13: _0xb7847f(0x300),
        0x14: _0xb7847f(0x2ba),
        0x15: '&upsilon;',
        0x16: _0xb7847f(0x1a),
        0x17: '&omega;',
        0x18: _0xb7847f(0x26f),
        0x19: _0xb7847f(0x3d7),
        0x1a: '&#2749;',
        0x1b: _0xb7847f(0x1dc),
        0x1c: '&#4330;',
        0x1d: _0xb7847f(0xb6),
        0x1e: '&#4331;',
        0x1f: _0xb7847f(0x237),
        0x20: _0xb7847f(0x1ea),
        0x21: _0xb7847f(0x420),
        0x22: _0xb7847f(0x1e0),
        0x23: _0xb7847f(0x3aa),
        0x24: '&#646;',
        0x25: _0xb7847f(0x49a),
        0x26: _0xb7847f(0x3f5),
        0x27: _0xb7847f(0x46c),
        0x28: _0xb7847f(0x13b),
        0x29: _0xb7847f(0x1d1),
        0x2a: _0xb7847f(0x2e),
        0x2b: _0xb7847f(0x247),
        0x2c: '&#1360;',
        0x2d: _0xb7847f(0x300),
        0x2e: _0xb7847f(0x2ba),
        0x2f: _0xb7847f(0x36),
        0x30: _0xb7847f(0x1a),
        0x31: '&omega;',
        0x32: _0xb7847f(0x26f),
        0x33: _0xb7847f(0x3d7),
        0x34: _0xb7847f(0x342),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's20': {
        0x1: _0xb7847f(0xa9),
        0x2: '&#1073;',
        0x3: 'c',
        0x4: _0xb7847f(0x1b9),
        0x5: _0xb7847f(0x3db),
        0x6: 'f',
        0x7: 'g',
        0x8: _0xb7847f(0xe7),
        0x9: _0xb7847f(0x335),
        0xa: 'j',
        0xb: _0xb7847f(0x3fb),
        0xc: _0xb7847f(0xe1),
        0xd: _0xb7847f(0x2ed),
        0xe: '&#1087;',
        0xf: _0xb7847f(0x299),
        0x10: 'p',
        0x11: '&#1092;',
        0x12: '&#1103;',
        0x13: '$',
        0x14: _0xb7847f(0x43e),
        0x15: '&#1094;',
        0x16: _0xb7847f(0x1c8),
        0x17: _0xb7847f(0x5e),
        0x18: _0xb7847f(0x3a4),
        0x19: _0xb7847f(0x326),
        0x1a: _0xb7847f(0x4c6),
        0x1b: _0xb7847f(0x3ae),
        0x1c: '&#1041;',
        0x1d: 'C',
        0x1e: _0xb7847f(0x419),
        0x1f: _0xb7847f(0x62),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: _0xb7847f(0x2a4),
        0x24: 'J',
        0x25: _0xb7847f(0x48a),
        0x26: _0xb7847f(0x28a),
        0x27: _0xb7847f(0x157),
        0x28: _0xb7847f(0x2b6),
        0x29: _0xb7847f(0x3c2),
        0x2a: 'P',
        0x2b: _0xb7847f(0x301),
        0x2c: _0xb7847f(0x462),
        0x2d: '$',
        0x2e: 'T',
        0x2f: _0xb7847f(0x267),
        0x30: _0xb7847f(0x2f5),
        0x31: _0xb7847f(0x2da),
        0x32: _0xb7847f(0x72),
        0x33: '&#1063;',
        0x34: '&#1047;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's21': {
        0x1: 'a&#830;',
        0x2: _0xb7847f(0x4f4),
        0x3: _0xb7847f(0x4e6),
        0x4: _0xb7847f(0x387),
        0x5: _0xb7847f(0x2af),
        0x6: _0xb7847f(0x1c1),
        0x7: _0xb7847f(0x313),
        0x8: _0xb7847f(0x333),
        0x9: _0xb7847f(0x452),
        0xa: 'j&#830;',
        0xb: _0xb7847f(0x320),
        0xc: 'l&#830;',
        0xd: _0xb7847f(0x483),
        0xe: _0xb7847f(0x372),
        0xf: _0xb7847f(0x4b4),
        0x10: _0xb7847f(0x22b),
        0x11: _0xb7847f(0x143),
        0x12: _0xb7847f(0x51d),
        0x13: _0xb7847f(0x3c1),
        0x14: 't&#830;',
        0x15: _0xb7847f(0x5c),
        0x16: 'v&#830;',
        0x17: _0xb7847f(0x18f),
        0x18: _0xb7847f(0x24a),
        0x19: _0xb7847f(0x76),
        0x1a: _0xb7847f(0x10a),
        0x1b: _0xb7847f(0x482),
        0x1c: _0xb7847f(0x254),
        0x1d: _0xb7847f(0x2df),
        0x1e: 'D&#830;',
        0x1f: 'E&#830;',
        0x20: 'F&#830;',
        0x21: _0xb7847f(0x25d),
        0x22: 'H&#830;',
        0x23: _0xb7847f(0x36d),
        0x24: _0xb7847f(0x428),
        0x25: _0xb7847f(0xa3),
        0x26: _0xb7847f(0x6c),
        0x27: 'M&#830;',
        0x28: _0xb7847f(0x2a),
        0x29: _0xb7847f(0x445),
        0x2a: _0xb7847f(0x23a),
        0x2b: _0xb7847f(0x460),
        0x2c: _0xb7847f(0x275),
        0x2d: 'S&#830;',
        0x2e: _0xb7847f(0x2c4),
        0x2f: _0xb7847f(0x422),
        0x30: _0xb7847f(0x35),
        0x31: _0xb7847f(0x3dd),
        0x32: _0xb7847f(0x375),
        0x33: _0xb7847f(0x329),
        0x34: _0xb7847f(0x9c),
        0x35: _0xb7847f(0x29),
        0x36: _0xb7847f(0x105),
        0x37: _0xb7847f(0x10b),
        0x38: '4&#830;',
        0x39: _0xb7847f(0x292),
        0x3a: _0xb7847f(0x1d),
        0x3b: '7&#830;',
        0x3c: _0xb7847f(0x1cd),
        0x3d: _0xb7847f(0xdf),
        0x3e: '0&#830;'
    },
    's22': {
        0x1: _0xb7847f(0x67),
        0x2: 'b&#838;',
        0x3: 'c&#838;',
        0x4: _0xb7847f(0x6a),
        0x5: _0xb7847f(0x308),
        0x6: _0xb7847f(0x35a),
        0x7: _0xb7847f(0x2b0),
        0x8: _0xb7847f(0x23b),
        0x9: _0xb7847f(0x25f),
        0xa: _0xb7847f(0x1c6),
        0xb: _0xb7847f(0x398),
        0xc: _0xb7847f(0x120),
        0xd: _0xb7847f(0xac),
        0xe: _0xb7847f(0x1e4),
        0xf: _0xb7847f(0x4b1),
        0x10: _0xb7847f(0x293),
        0x11: _0xb7847f(0x2ea),
        0x12: _0xb7847f(0x216),
        0x13: _0xb7847f(0x40c),
        0x14: 't&#838;',
        0x15: _0xb7847f(0x2b1),
        0x16: _0xb7847f(0x360),
        0x17: 'w&#838;',
        0x18: 'x&#838;',
        0x19: _0xb7847f(0x3e0),
        0x1a: _0xb7847f(0xbf),
        0x1b: _0xb7847f(0x8b),
        0x1c: _0xb7847f(0x517),
        0x1d: _0xb7847f(0x1a7),
        0x1e: _0xb7847f(0x15e),
        0x1f: _0xb7847f(0x166),
        0x20: _0xb7847f(0x351),
        0x21: 'G&#838;',
        0x22: 'H&#838;',
        0x23: _0xb7847f(0x159),
        0x24: _0xb7847f(0x481),
        0x25: 'K&#838;',
        0x26: _0xb7847f(0x69),
        0x27: _0xb7847f(0x1fd),
        0x28: _0xb7847f(0x4d4),
        0x29: _0xb7847f(0x4bb),
        0x2a: _0xb7847f(0x2ac),
        0x2b: _0xb7847f(0x1d2),
        0x2c: _0xb7847f(0x7e),
        0x2d: _0xb7847f(0xcd),
        0x2e: _0xb7847f(0x137),
        0x2f: _0xb7847f(0x22e),
        0x30: _0xb7847f(0x113),
        0x31: _0xb7847f(0x4f9),
        0x32: _0xb7847f(0x1aa),
        0x33: _0xb7847f(0x3e),
        0x34: _0xb7847f(0x4c3),
        0x35: _0xb7847f(0x104),
        0x36: _0xb7847f(0x231),
        0x37: _0xb7847f(0x41c),
        0x38: _0xb7847f(0x456),
        0x39: _0xb7847f(0x82),
        0x3a: _0xb7847f(0x4b2),
        0x3b: _0xb7847f(0x3c6),
        0x3c: '8&#838;',
        0x3d: _0xb7847f(0x472),
        0x3e: '0&#838;'
    },
    's23': {
        0x1: _0xb7847f(0x354),
        0x2: _0xb7847f(0x257),
        0x3: _0xb7847f(0x3fe),
        0x4: _0xb7847f(0x1b0),
        0x5: _0xb7847f(0x33c),
        0x6: _0xb7847f(0x181),
        0x7: _0xb7847f(0x24d),
        0x8: _0xb7847f(0x2d2),
        0x9: _0xb7847f(0x51a),
        0xa: _0xb7847f(0xf5),
        0xb: _0xb7847f(0xd5),
        0xc: 'l&#826;',
        0xd: _0xb7847f(0xf8),
        0xe: _0xb7847f(0x21),
        0xf: _0xb7847f(0x45e),
        0x10: _0xb7847f(0x29b),
        0x11: _0xb7847f(0x3d),
        0x12: _0xb7847f(0x28f),
        0x13: _0xb7847f(0x291),
        0x14: _0xb7847f(0x478),
        0x15: _0xb7847f(0x1b6),
        0x16: _0xb7847f(0x11d),
        0x17: _0xb7847f(0xe),
        0x18: 'x&#826;',
        0x19: _0xb7847f(0x3c0),
        0x1a: _0xb7847f(0x271),
        0x1b: _0xb7847f(0x49c),
        0x1c: _0xb7847f(0x5a),
        0x1d: _0xb7847f(0x519),
        0x1e: _0xb7847f(0x1d0),
        0x1f: _0xb7847f(0x3b0),
        0x20: _0xb7847f(0x4f5),
        0x21: _0xb7847f(0x1e7),
        0x22: _0xb7847f(0x3a3),
        0x23: 'I&#826;',
        0x24: _0xb7847f(0x345),
        0x25: _0xb7847f(0x173),
        0x26: _0xb7847f(0x3e9),
        0x27: _0xb7847f(0x234),
        0x28: 'N&#826;',
        0x29: _0xb7847f(0x41e),
        0x2a: _0xb7847f(0x215),
        0x2b: 'Q&#826;',
        0x2c: _0xb7847f(0x201),
        0x2d: _0xb7847f(0x297),
        0x2e: 'T&#826;',
        0x2f: _0xb7847f(0x4b3),
        0x30: _0xb7847f(0x503),
        0x31: _0xb7847f(0xef),
        0x32: 'X&#826;',
        0x33: _0xb7847f(0xf6),
        0x34: _0xb7847f(0x102),
        0x35: '1&#826;',
        0x36: _0xb7847f(0x2bb),
        0x37: _0xb7847f(0x1a6),
        0x38: _0xb7847f(0x47),
        0x39: _0xb7847f(0x19f),
        0x3a: _0xb7847f(0x81),
        0x3b: _0xb7847f(0x147),
        0x3c: _0xb7847f(0x154),
        0x3d: _0xb7847f(0x14d),
        0x3e: _0xb7847f(0x165)
    },
    's24': {
        0x1: _0xb7847f(0x0),
        0x2: _0xb7847f(0x476),
        0x3: _0xb7847f(0x423),
        0x4: _0xb7847f(0x22c),
        0x5: 'e&#857;',
        0x6: _0xb7847f(0x27),
        0x7: _0xb7847f(0xa8),
        0x8: 'h&#857;',
        0x9: _0xb7847f(0x263),
        0xa: _0xb7847f(0x458),
        0xb: 'k&#857;',
        0xc: 'l&#857;',
        0xd: 'm&#857;',
        0xe: _0xb7847f(0xc2),
        0xf: _0xb7847f(0x2a8),
        0x10: 'p&#857;',
        0x11: 'q&#857;',
        0x12: _0xb7847f(0x2ff),
        0x13: _0xb7847f(0x36b),
        0x14: _0xb7847f(0x42a),
        0x15: _0xb7847f(0x110),
        0x16: _0xb7847f(0x504),
        0x17: 'w&#857;',
        0x18: _0xb7847f(0x218),
        0x19: _0xb7847f(0x224),
        0x1a: _0xb7847f(0x2b7),
        0x1b: _0xb7847f(0x3f8),
        0x1c: _0xb7847f(0x8c),
        0x1d: 'C&#857;',
        0x1e: _0xb7847f(0x2e3),
        0x1f: _0xb7847f(0x90),
        0x20: _0xb7847f(0x4e8),
        0x21: _0xb7847f(0x106),
        0x22: _0xb7847f(0x518),
        0x23: _0xb7847f(0x2fd),
        0x24: _0xb7847f(0x304),
        0x25: _0xb7847f(0xc9),
        0x26: 'L&#857;',
        0x27: _0xb7847f(0x47a),
        0x28: _0xb7847f(0x100),
        0x29: _0xb7847f(0x510),
        0x2a: 'P&#857;',
        0x2b: _0xb7847f(0x3f9),
        0x2c: _0xb7847f(0x189),
        0x2d: _0xb7847f(0x379),
        0x2e: 'T&#857;',
        0x2f: 'U&#857;',
        0x30: _0xb7847f(0x38),
        0x31: _0xb7847f(0x4be),
        0x32: _0xb7847f(0x196),
        0x33: _0xb7847f(0x45f),
        0x34: _0xb7847f(0x2c0),
        0x35: '1&#857;',
        0x36: '2&#857;',
        0x37: _0xb7847f(0x167),
        0x38: _0xb7847f(0x175),
        0x39: _0xb7847f(0x19b),
        0x3a: '6&#857;',
        0x3b: _0xb7847f(0x4ef),
        0x3c: '8&#857;',
        0x3d: _0xb7847f(0x177),
        0x3e: _0xb7847f(0x12e)
    },
    's25': {
        0x1: _0xb7847f(0x433),
        0x2: _0xb7847f(0x2c7),
        0x3: _0xb7847f(0x11a),
        0x4: _0xb7847f(0x266),
        0x5: _0xb7847f(0x14a),
        0x6: _0xb7847f(0x21c),
        0x7: 'g&#799;',
        0x8: _0xb7847f(0x46a),
        0x9: _0xb7847f(0x4db),
        0xa: _0xb7847f(0x17b),
        0xb: _0xb7847f(0xd),
        0xc: _0xb7847f(0x279),
        0xd: _0xb7847f(0x4f),
        0xe: _0xb7847f(0x149),
        0xf: _0xb7847f(0x269),
        0x10: _0xb7847f(0x337),
        0x11: _0xb7847f(0x4fb),
        0x12: _0xb7847f(0xcc),
        0x13: _0xb7847f(0x109),
        0x14: _0xb7847f(0x2d6),
        0x15: _0xb7847f(0x47f),
        0x16: 'v&#799;',
        0x17: 'w&#799;',
        0x18: _0xb7847f(0x33b),
        0x19: _0xb7847f(0x415),
        0x1a: 'z&#799;',
        0x1b: 'A&#799;',
        0x1c: _0xb7847f(0xca),
        0x1d: _0xb7847f(0x3b4),
        0x1e: _0xb7847f(0x4c7),
        0x1f: _0xb7847f(0x95),
        0x20: _0xb7847f(0x32f),
        0x21: _0xb7847f(0x305),
        0x22: 'H&#799;',
        0x23: _0xb7847f(0x499),
        0x24: _0xb7847f(0x2dc),
        0x25: _0xb7847f(0x338),
        0x26: _0xb7847f(0x528),
        0x27: _0xb7847f(0x344),
        0x28: _0xb7847f(0x210),
        0x29: 'O&#799;',
        0x2a: 'P&#799;',
        0x2b: _0xb7847f(0x1ed),
        0x2c: _0xb7847f(0x412),
        0x2d: 'S&#799;',
        0x2e: _0xb7847f(0x290),
        0x2f: 'U&#799;',
        0x30: _0xb7847f(0x3a5),
        0x31: 'W&#799;',
        0x32: _0xb7847f(0xc7),
        0x33: _0xb7847f(0x30e),
        0x34: _0xb7847f(0xe5),
        0x35: _0xb7847f(0x47c),
        0x36: _0xb7847f(0x4d2),
        0x37: _0xb7847f(0x1c5),
        0x38: _0xb7847f(0x2e0),
        0x39: '5&#799;',
        0x3a: _0xb7847f(0x495),
        0x3b: _0xb7847f(0xfe),
        0x3c: _0xb7847f(0x1a4),
        0x3d: _0xb7847f(0x26e),
        0x3e: _0xb7847f(0xda)
    },
    's26': {
        0x1: _0xb7847f(0xe0),
        0x2: _0xb7847f(0x32),
        0x3: 'c&#846;',
        0x4: _0xb7847f(0x176),
        0x5: _0xb7847f(0x4e2),
        0x6: 'f&#846;',
        0x7: _0xb7847f(0x38d),
        0x8: _0xb7847f(0x6b),
        0x9: _0xb7847f(0x486),
        0xa: 'j&#846;',
        0xb: _0xb7847f(0x11),
        0xc: _0xb7847f(0x18d),
        0xd: _0xb7847f(0x10),
        0xe: _0xb7847f(0x4d7),
        0xf: _0xb7847f(0x16b),
        0x10: _0xb7847f(0x49b),
        0x11: _0xb7847f(0x34a),
        0x12: _0xb7847f(0x37e),
        0x13: _0xb7847f(0x45c),
        0x14: _0xb7847f(0x439),
        0x15: 'u&#846;',
        0x16: _0xb7847f(0x3ce),
        0x17: _0xb7847f(0x4bc),
        0x18: _0xb7847f(0x122),
        0x19: _0xb7847f(0x1be),
        0x1a: _0xb7847f(0x4ea),
        0x1b: _0xb7847f(0x2a2),
        0x1c: _0xb7847f(0x4ca),
        0x1d: _0xb7847f(0x208),
        0x1e: _0xb7847f(0x190),
        0x1f: 'E&#846;',
        0x20: 'F&#846;',
        0x21: _0xb7847f(0x314),
        0x22: 'H&#846;',
        0x23: 'I&#846;',
        0x24: 'J&#846;',
        0x25: _0xb7847f(0xdd),
        0x26: _0xb7847f(0x19c),
        0x27: _0xb7847f(0x391),
        0x28: _0xb7847f(0xe8),
        0x29: 'O&#846;',
        0x2a: 'P&#846;',
        0x2b: 'Q&#846;',
        0x2c: _0xb7847f(0x3fd),
        0x2d: 'S&#846;',
        0x2e: 'T&#846;',
        0x2f: _0xb7847f(0x4bf),
        0x30: _0xb7847f(0x65),
        0x31: _0xb7847f(0x2d7),
        0x32: _0xb7847f(0x12d),
        0x33: _0xb7847f(0x14),
        0x34: 'Z&#846;',
        0x35: _0xb7847f(0x64),
        0x36: _0xb7847f(0x459),
        0x37: _0xb7847f(0x3a8),
        0x38: _0xb7847f(0x4e7),
        0x39: '5&#846;',
        0x3a: '6&#846;',
        0x3b: '7&#846;',
        0x3c: _0xb7847f(0x435),
        0x3d: _0xb7847f(0x170),
        0x3e: _0xb7847f(0x32c)
    },
    's27': {
        0x1: _0xb7847f(0x525),
        0x2: _0xb7847f(0x45d),
        0x3: 'c&#829;&#851;',
        0x4: _0xb7847f(0x2a5),
        0x5: _0xb7847f(0x492),
        0x6: _0xb7847f(0x45),
        0x7: _0xb7847f(0x273),
        0x8: _0xb7847f(0x63),
        0x9: _0xb7847f(0x4dd),
        0xa: 'j&#829;&#851;',
        0xb: 'k&#829;&#851;',
        0xc: 'l&#829;&#851;',
        0xd: _0xb7847f(0x3f),
        0xe: 'n&#829;&#851;',
        0xf: _0xb7847f(0x365),
        0x10: _0xb7847f(0xb0),
        0x11: _0xb7847f(0x248),
        0x12: _0xb7847f(0x4dc),
        0x13: _0xb7847f(0x73),
        0x14: _0xb7847f(0x1b8),
        0x15: _0xb7847f(0x37b),
        0x16: _0xb7847f(0x235),
        0x17: _0xb7847f(0x466),
        0x18: _0xb7847f(0x178),
        0x19: _0xb7847f(0x432),
        0x1a: _0xb7847f(0x1d6),
        0x1b: _0xb7847f(0x443),
        0x1c: _0xb7847f(0x480),
        0x1d: 'C&#829;&#851;',
        0x1e: _0xb7847f(0x2f2),
        0x1f: 'E&#829;&#851;',
        0x20: _0xb7847f(0x282),
        0x21: _0xb7847f(0x244),
        0x22: _0xb7847f(0x2bf),
        0x23: _0xb7847f(0x1ac),
        0x24: 'J&#829;&#851;',
        0x25: _0xb7847f(0x1a0),
        0x26: _0xb7847f(0x371),
        0x27: _0xb7847f(0x1a5),
        0x28: _0xb7847f(0x3af),
        0x29: _0xb7847f(0x1bb),
        0x2a: _0xb7847f(0xb5),
        0x2b: _0xb7847f(0x1ef),
        0x2c: _0xb7847f(0x28d),
        0x2d: _0xb7847f(0x35e),
        0x2e: _0xb7847f(0x118),
        0x2f: _0xb7847f(0x4c2),
        0x30: _0xb7847f(0xc3),
        0x31: 'W&#829;&#851;',
        0x32: _0xb7847f(0x48),
        0x33: _0xb7847f(0x10d),
        0x34: 'Z&#829;&#851;',
        0x35: _0xb7847f(0x3ad),
        0x36: _0xb7847f(0x227),
        0x37: _0xb7847f(0x277),
        0x38: _0xb7847f(0x2a3),
        0x39: _0xb7847f(0x23c),
        0x3a: '6&#829;&#851;',
        0x3b: '7&#829;&#851;',
        0x3c: '8&#829;&#851;',
        0x3d: _0xb7847f(0x21d),
        0x3e: '0&#829;&#851;'
    },
    's29': {
        0x1: '&#120458;&#823;',
        0x2: _0xb7847f(0x39e),
        0x3: _0xb7847f(0x7d),
        0x4: _0xb7847f(0x3b3),
        0x5: _0xb7847f(0x3b5),
        0x6: _0xb7847f(0x3e8),
        0x7: _0xb7847f(0x1eb),
        0x8: _0xb7847f(0x1a8),
        0x9: _0xb7847f(0x3f6),
        0xa: '&#120467;&#823;',
        0xb: _0xb7847f(0x240),
        0xc: _0xb7847f(0x1ee),
        0xd: '&#120470;&#823;',
        0xe: _0xb7847f(0xa7),
        0xf: '&#120472;&#823;',
        0x10: '&#120473;&#823;',
        0x11: '&#120474;&#823;',
        0x12: '&#120475;&#823;',
        0x13: _0xb7847f(0x1f8),
        0x14: _0xb7847f(0x1f5),
        0x15: '&#120478;&#823;',
        0x16: _0xb7847f(0xf1),
        0x17: '&#120480;&#823;',
        0x18: _0xb7847f(0x346),
        0x19: _0xb7847f(0x36c),
        0x1a: _0xb7847f(0x268),
        0x1b: _0xb7847f(0x2c2),
        0x1c: _0xb7847f(0x328),
        0x1d: _0xb7847f(0x32e),
        0x1e: _0xb7847f(0x75),
        0x1f: _0xb7847f(0x136),
        0x20: _0xb7847f(0xb3),
        0x21: '&#120438;&#823;',
        0x22: _0xb7847f(0xf3),
        0x23: _0xb7847f(0x11e),
        0x24: _0xb7847f(0xc0),
        0x25: '&#120442;&#823;',
        0x26: _0xb7847f(0x249),
        0x27: '&#120444;&#823;',
        0x28: _0xb7847f(0xa0),
        0x29: _0xb7847f(0xb2),
        0x2a: '&#120447;&#823;',
        0x2b: _0xb7847f(0x265),
        0x2c: _0xb7847f(0x197),
        0x2d: '&#120450;&#823;',
        0x2e: _0xb7847f(0x2bd),
        0x2f: _0xb7847f(0x3bd),
        0x30: '&#120453;&#823;',
        0x31: _0xb7847f(0x1b2),
        0x32: _0xb7847f(0x4f0),
        0x33: _0xb7847f(0x47e),
        0x34: _0xb7847f(0x51f),
        0x35: _0xb7847f(0x225),
        0x36: '&#120824;&#823;',
        0x37: _0xb7847f(0x99),
        0x38: _0xb7847f(0x2a6),
        0x39: '&#120827;&#823;',
        0x3a: _0xb7847f(0x13c),
        0x3b: '&#120829;&#823;',
        0x3c: _0xb7847f(0x441),
        0x3d: _0xb7847f(0x8d),
        0x3e: _0xb7847f(0x324)
    },
    's30': {
        0x1: _0xb7847f(0x3ac),
        0x2: _0xb7847f(0xc5),
        0x3: _0xb7847f(0x376),
        0x4: 'd&#866;',
        0x5: _0xb7847f(0x327),
        0x6: _0xb7847f(0x490),
        0x7: 'g&#866;',
        0x8: 'h&#866;',
        0x9: 'i&#866;',
        0xa: _0xb7847f(0x513),
        0xb: _0xb7847f(0x3e6),
        0xc: _0xb7847f(0x23f),
        0xd: _0xb7847f(0x373),
        0xe: _0xb7847f(0x23),
        0xf: _0xb7847f(0x436),
        0x10: _0xb7847f(0x336),
        0x11: 'q&#866;',
        0x12: _0xb7847f(0x146),
        0x13: _0xb7847f(0x4fd),
        0x14: _0xb7847f(0x396),
        0x15: _0xb7847f(0x4c9),
        0x16: _0xb7847f(0x193),
        0x17: 'w&#866;',
        0x18: 'x&#866;',
        0x19: _0xb7847f(0x39b),
        0x1a: 'z&#866;',
        0x1b: 'A&#866;',
        0x1c: _0xb7847f(0x14f),
        0x1d: _0xb7847f(0x464),
        0x1e: _0xb7847f(0x180),
        0x1f: 'E&#866;',
        0x20: _0xb7847f(0x1fa),
        0x21: 'G&#866;',
        0x22: _0xb7847f(0x4ff),
        0x23: _0xb7847f(0x89),
        0x24: _0xb7847f(0x261),
        0x25: 'K&#866;',
        0x26: _0xb7847f(0x322),
        0x27: _0xb7847f(0x217),
        0x28: _0xb7847f(0x97),
        0x29: _0xb7847f(0x44a),
        0x2a: 'P&#866;',
        0x2b: _0xb7847f(0x343),
        0x2c: 'R&#866;',
        0x2d: _0xb7847f(0x48e),
        0x2e: _0xb7847f(0xc1),
        0x2f: _0xb7847f(0x49e),
        0x30: _0xb7847f(0x347),
        0x31: _0xb7847f(0x15f),
        0x32: _0xb7847f(0xae),
        0x33: 'Y&#866;',
        0x34: _0xb7847f(0x34e),
        0x35: _0xb7847f(0x57),
        0x36: _0xb7847f(0x2aa),
        0x37: _0xb7847f(0x101),
        0x38: _0xb7847f(0x4e1),
        0x39: '5&#866;',
        0x3a: _0xb7847f(0x46d),
        0x3b: '7&#866;',
        0x3c: _0xb7847f(0x42),
        0x3d: _0xb7847f(0x2b),
        0x3e: _0xb7847f(0x91)
    },
    's31': {
        0x1: 'a&#828;',
        0x2: _0xb7847f(0x112),
        0x3: _0xb7847f(0xd2),
        0x4: _0xb7847f(0x321),
        0x5: 'e&#828;',
        0x6: _0xb7847f(0x1c7),
        0x7: _0xb7847f(0x2b8),
        0x8: _0xb7847f(0x3ab),
        0x9: _0xb7847f(0x438),
        0xa: _0xb7847f(0x2cb),
        0xb: _0xb7847f(0x17d),
        0xc: _0xb7847f(0x469),
        0xd: 'm&#828;',
        0xe: _0xb7847f(0x489),
        0xf: 'o&#828;',
        0x10: _0xb7847f(0x3c5),
        0x11: _0xb7847f(0x431),
        0x12: _0xb7847f(0x49d),
        0x13: _0xb7847f(0x1c9),
        0x14: _0xb7847f(0x13),
        0x15: _0xb7847f(0xf9),
        0x16: 'v&#828;',
        0x17: _0xb7847f(0x30a),
        0x18: 'x&#828;',
        0x19: 'y&#828;',
        0x1a: _0xb7847f(0x2f),
        0x1b: 'A&#828;',
        0x1c: _0xb7847f(0xaa),
        0x1d: _0xb7847f(0xe4),
        0x1e: 'D&#828;',
        0x1f: _0xb7847f(0xde),
        0x20: 'F&#828;',
        0x21: 'G&#828;',
        0x22: _0xb7847f(0x49f),
        0x23: 'I&#828;',
        0x24: 'J&#828;',
        0x25: _0xb7847f(0x20f),
        0x26: _0xb7847f(0x4c8),
        0x27: _0xb7847f(0x4),
        0x28: _0xb7847f(0x241),
        0x29: 'O&#828;',
        0x2a: _0xb7847f(0x19),
        0x2b: _0xb7847f(0x356),
        0x2c: _0xb7847f(0x3a7),
        0x2d: _0xb7847f(0x38a),
        0x2e: _0xb7847f(0xd4),
        0x2f: _0xb7847f(0x32a),
        0x30: _0xb7847f(0x402),
        0x31: _0xb7847f(0x3b9),
        0x32: _0xb7847f(0x37f),
        0x33: _0xb7847f(0x1fb),
        0x34: 'Z&#828;',
        0x35: _0xb7847f(0x512),
        0x36: _0xb7847f(0x2d1),
        0x37: _0xb7847f(0x411),
        0x38: _0xb7847f(0xd3),
        0x39: _0xb7847f(0x12c),
        0x3a: _0xb7847f(0x133),
        0x3b: '7&#828;',
        0x3c: _0xb7847f(0x32d),
        0x3d: _0xb7847f(0x33),
        0x3e: _0xb7847f(0x31e)
    }
};

function Change(_0x19c16c, _0x1688be) {
    var _0x5829ba = _0xb7847f,
        _0x4317a2 = '',
        _0x19c16c = _0x19c16c;
    if (_0x19c16c[_0x5829ba(0x1ab)] == 0x0) return;
    for (i = 0x0; i < _0x19c16c[_0x5829ba(0x1ab)]; i++) {
        var _0x41aacb = _0x19c16c[_0x5829ba(0x38f)](i),
            _0x544ec1 = normal['indexOf'](_0x41aacb) + 0x1;
        if (_0x41aacb == '\x20') _0x4317a2 += '\x20';
        else !_0x544ec1 ? _0x4317a2 += _0x41aacb : _0x4317a2 += newtext[_0x1688be][_0x544ec1];
    }
    return _0x4317a2;
}
const futureAlienCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑢ',
        'd': 'ᕲ',
        'e': 'ᘿ',
        'f': 'ᖴ',
        'g': 'ᘜ',
        'h': 'ᕼ',
        'i': 'ᓰ',
        'j': 'ᒚ',
        'k': 'ᖽᐸ',
        'l': 'ᒪ',
        'm': 'ᘻ',
        'n': 'ᘉ',
        'o': 'ᓍ',
        'p': 'ᕵ',
        'q': 'ᕴ',
        'r': 'ᖇ',
        's': 'S',
        't': 'ᖶ',
        'u': 'ᑘ',
        'v': 'ᐺ',
        'w': 'ᘺ',
        'x': '᙭',
        'y': 'ᖻ',
        'z': 'ᗱ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑢ',
        'D': 'ᕲ',
        'E': 'ᘿ',
        'F': 'ᖴ',
        'G': 'ᘜ',
        'H': 'ᕼ',
        'I': 'ᓰ',
        'J': 'ᒚ',
        'K': 'ᖽᐸ',
        'L': 'ᒪ',
        'M': 'ᘻ',
        'N': 'ᘉ',
        'O': 'ᓍ',
        'P': 'ᕵ',
        'Q': 'ᕴ',
        'R': 'ᖇ',
        'S': 'S',
        'T': 'ᖶ',
        'U': 'ᑘ',
        'V': 'ᐺ',
        'W': 'ᘺ',
        'X': '᙭',
        'Y': 'ᖻ',
        'Z': 'ᗱ'
    },
    squiggle6CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๖',
        'c': '¢',
        'd': '໓',
        'e': 'ē',
        'f': 'f',
        'g': 'ງ',
        'h': 'h',
        'i': 'i',
        'j': 'ว',
        'k': 'k',
        'l': 'l',
        'm': '๓',
        'n': 'ຖ',
        'o': '໐',
        'p': 'p',
        'q': '๑',
        'r': 'r',
        's': 'Ş',
        't': 't',
        'u': 'น',
        'v': 'ง',
        'w': 'ຟ',
        'x': 'x',
        'y': 'ฯ',
        'z': 'ຊ',
        'A': 'ค',
        'B': '๖',
        'C': '¢',
        'D': '໓',
        'E': 'ē',
        'F': 'f',
        'G': 'ງ',
        'H': 'h',
        'I': 'i',
        'J': 'ว',
        'K': 'k',
        'L': 'l',
        'M': '๓',
        'N': 'ຖ',
        'O': '໐',
        'P': 'p',
        'Q': '๑',
        'R': 'r',
        'S': 'Ş',
        'T': 't',
        'U': 'น',
        'V': 'ง',
        'W': 'ຟ',
        'X': 'x',
        'Y': 'ฯ',
        'Z': 'ຊ'
    },
    squiggle5CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ą',
        'b': 'ც',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɠ',
        'h': 'ɧ',
        'i': 'ı',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'Ɩ',
        'm': 'ɱ',
        'n': 'ŋ',
        'o': 'ơ',
        'p': '℘',
        'q': 'զ',
        'r': 'ཞ',
        's': 'ʂ',
        't': 'ɬ',
        'u': 'ų',
        'v': '۷',
        'w': 'ῳ',
        'x': 'ҳ',
        'y': 'ყ',
        'z': 'ʑ',
        'A': 'ą',
        'B': 'ც',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɠ',
        'H': 'ɧ',
        'I': 'ı',
        'J': 'ʝ',
        'K': 'ƙ',
        'L': 'Ɩ',
        'M': 'ɱ',
        'N': 'ŋ',
        'O': 'ơ',
        'P': '℘',
        'Q': 'զ',
        'R': 'ཞ',
        'S': 'ʂ',
        'T': 'ɬ',
        'U': 'ų',
        'V': '۷',
        'W': 'ῳ',
        'X': 'ҳ',
        'Y': 'ყ',
        'Z': 'ʑ'
    },
    asianStyle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ﾑ',
        'b': '乃',
        'c': 'ᄃ',
        'd': 'り',
        'e': '乇',
        'f': 'ｷ',
        'g': 'ム',
        'h': 'ん',
        'i': 'ﾉ',
        'j': 'ﾌ',
        'k': 'ズ',
        'l': 'ﾚ',
        'm': 'ﾶ',
        'n': '刀',
        'o': 'の',
        'p': 'ｱ',
        'q': 'ゐ',
        'r': '尺',
        's': '丂',
        't': 'ｲ',
        'u': 'ひ',
        'v': '√',
        'w': 'W',
        'x': 'ﾒ',
        'y': 'ﾘ',
        'z': '乙',
        'A': 'ﾑ',
        'B': '乃',
        'C': 'ᄃ',
        'D': 'り',
        'E': '乇',
        'F': 'ｷ',
        'G': 'ム',
        'H': 'ん',
        'I': 'ﾉ',
        'J': 'ﾌ',
        'K': 'ズ',
        'L': 'ﾚ',
        'M': 'ﾶ',
        'N': '刀',
        'O': 'の',
        'P': 'ｱ',
        'Q': 'ゐ',
        'R': '尺',
        'S': '丂',
        'T': 'ｲ',
        'U': 'ひ',
        'V': '√',
        'W': 'W',
        'X': 'ﾒ',
        'Y': 'ﾘ',
        'Z': '乙'
    },
    asianStyleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '卂',
        'b': '乃',
        'c': '匚',
        'd': 'ᗪ',
        'e': '乇',
        'f': '千',
        'g': 'Ꮆ',
        'h': '卄',
        'i': '丨',
        'j': 'ﾌ',
        'k': 'Ҝ',
        'l': 'ㄥ',
        'm': '爪',
        'n': '几',
        'o': 'ㄖ',
        'p': '卩',
        'q': 'Ɋ',
        'r': '尺',
        's': '丂',
        't': 'ㄒ',
        'u': 'ㄩ',
        'v': 'ᐯ',
        'w': '山',
        'x': '乂',
        'y': 'ㄚ',
        'z': '乙',
        'A': '卂',
        'B': '乃',
        'C': '匚',
        'D': 'ᗪ',
        'E': '乇',
        'F': '千',
        'G': 'Ꮆ',
        'H': '卄',
        'I': '丨',
        'J': 'ﾌ',
        'K': 'Ҝ',
        'L': 'ㄥ',
        'M': '爪',
        'N': '几',
        'O': 'ㄖ',
        'P': '卩',
        'Q': 'Ɋ',
        'R': '尺',
        'S': '丂',
        'T': 'ㄒ',
        'U': 'ㄩ',
        'V': 'ᐯ',
        'W': '山',
        'X': '乂',
        'Y': 'ㄚ',
        'Z': '乙'
    },
    squaresCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '🄰',
        'b': '🄱',
        'c': '🄲',
        'd': '🄳',
        'e': '🄴',
        'f': '🄵',
        'g': '🄶',
        'h': '🄷',
        'i': '🄸',
        'j': '🄹',
        'k': '🄺',
        'l': '🄻',
        'm': '🄼',
        'n': '🄽',
        'o': '🄾',
        'p': '🄿',
        'q': '🅀',
        'r': '🅁',
        's': '🅂',
        't': '🅃',
        'u': '🅄',
        'v': '🅅',
        'w': '🅆',
        'x': '🅇',
        'y': '🅈',
        'z': '🅉',
        'A': '🄰',
        'B': '🄱',
        'C': '🄲',
        'D': '🄳',
        'E': '🄴',
        'F': '🄵',
        'G': '🄶',
        'H': '🄷',
        'I': '🄸',
        'J': '🄹',
        'K': '🄺',
        'L': '🄻',
        'M': '🄼',
        'N': '🄽',
        'O': '🄾',
        'P': '🄿',
        'Q': '🅀',
        'R': '🅁',
        'S': '🅂',
        'T': '🅃',
        'U': '🅄',
        'V': '🅅',
        'W': '🅆',
        'X': '🅇',
        'Y': '🅈',
        'Z': '🅉'
    },
    squiggle4CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Ꮧ',
        'b': 'Ᏸ',
        'c': 'ፈ',
        'd': 'Ꮄ',
        'e': 'Ꮛ',
        'f': 'Ꭶ',
        'g': 'Ꮆ',
        'h': 'Ꮒ',
        'i': 'Ꭵ',
        'j': 'Ꮰ',
        'k': 'Ꮶ',
        'l': 'Ꮭ',
        'm': 'Ꮇ',
        'n': 'Ꮑ',
        'o': 'Ꭷ',
        'p': 'Ꭾ',
        'q': 'Ꭴ',
        'r': 'Ꮢ',
        's': 'Ꮥ',
        't': 'Ꮦ',
        'u': 'Ꮼ',
        'v': 'Ꮙ',
        'w': 'Ꮗ',
        'x': 'ጀ',
        'y': 'Ꭹ',
        'z': 'ፚ',
        'A': 'Ꮧ',
        'B': 'Ᏸ',
        'C': 'ፈ',
        'D': 'Ꮄ',
        'E': 'Ꮛ',
        'F': 'Ꭶ',
        'G': 'Ꮆ',
        'H': 'Ꮒ',
        'I': 'Ꭵ',
        'J': 'Ꮰ',
        'K': 'Ꮶ',
        'L': 'Ꮭ',
        'M': 'Ꮇ',
        'N': 'Ꮑ',
        'O': 'Ꭷ',
        'P': 'Ꭾ',
        'Q': 'Ꭴ',
        'R': 'Ꮢ',
        'S': 'Ꮥ',
        'T': 'Ꮦ',
        'U': 'Ꮼ',
        'V': 'Ꮙ',
        'W': 'Ꮗ',
        'X': 'ጀ',
        'Y': 'Ꭹ',
        'Z': 'ፚ'
    },
    neonCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑕ',
        'd': 'ᗪ',
        'e': 'E',
        'f': 'ᖴ',
        'g': 'G',
        'h': 'ᕼ',
        'i': 'I',
        'j': 'ᒍ',
        'k': 'K',
        'l': 'ᒪ',
        'm': 'ᗰ',
        'n': 'ᑎ',
        'o': 'O',
        'p': 'ᑭ',
        'q': 'ᑫ',
        'r': 'ᖇ',
        's': 'ᔕ',
        't': 'T',
        'u': 'ᑌ',
        'v': 'ᐯ',
        'w': 'ᗯ',
        'x': '᙭',
        'y': 'Y',
        'z': 'ᘔ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑕ',
        'D': 'ᗪ',
        'E': 'E',
        'F': 'ᖴ',
        'G': 'G',
        'H': 'ᕼ',
        'I': 'I',
        'J': 'ᒍ',
        'K': 'K',
        'L': 'ᒪ',
        'M': 'ᗰ',
        'N': 'ᑎ',
        'O': 'O',
        'P': 'ᑭ',
        'Q': 'ᑫ',
        'R': 'ᖇ',
        'S': 'ᔕ',
        'T': 'T',
        'U': 'ᑌ',
        'V': 'ᐯ',
        'W': 'ᗯ',
        'X': '᙭',
        'Y': 'Y',
        'Z': 'ᘔ'
    },
    squiggle3CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ǟ',
        'b': 'ɮ',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɢ',
        'h': 'ɦ',
        'i': 'ɨ',
        'j': 'ʝ',
        'k': 'ӄ',
        'l': 'ʟ',
        'm': 'ʍ',
        'n': 'ռ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ʀ',
        's': 'ֆ',
        't': 'ȶ',
        'u': 'ʊ',
        'v': 'ʋ',
        'w': 'ա',
        'x': 'Ӽ',
        'y': 'ʏ',
        'z': 'ʐ',
        'A': 'ǟ',
        'B': 'ɮ',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɢ',
        'H': 'ɦ',
        'I': 'ɨ',
        'J': 'ʝ',
        'K': 'ӄ',
        'L': 'ʟ',
        'M': 'ʍ',
        'N': 'ռ',
        'O': 'օ',
        'P': 'ք',
        'Q': 'զ',
        'R': 'ʀ',
        'S': 'ֆ',
        'T': 'ȶ',
        'U': 'ʊ',
        'V': 'ʋ',
        'W': 'ա',
        'X': 'Ӽ',
        'Y': 'ʏ',
        'Z': 'ʐ'
    },
    monospaceCharMap = {
        0x0: '𝟶',
        0x1: '𝟷',
        0x2: '𝟸',
        0x3: '𝟹',
        0x4: '𝟺',
        0x5: '𝟻',
        0x6: '𝟼',
        0x7: '𝟽',
        0x8: '𝟾',
        0x9: '𝟿',
        'a': '𝚊',
        'b': '𝚋',
        'c': '𝚌',
        'd': '𝚍',
        'e': '𝚎',
        'f': '𝚏',
        'g': '𝚐',
        'h': '𝚑',
        'i': '𝚒',
        'j': '𝚓',
        'k': '𝚔',
        'l': '𝚕',
        'm': '𝚖',
        'n': '𝚗',
        'o': '𝚘',
        'p': '𝚙',
        'q': '𝚚',
        'r': '𝚛',
        's': '𝚜',
        't': '𝚝',
        'u': '𝚞',
        'v': '𝚟',
        'w': '𝚠',
        'x': '𝚡',
        'y': '𝚢',
        'z': '𝚣',
        'A': '𝙰',
        'B': '𝙱',
        'C': '𝙲',
        'D': '𝙳',
        'E': '𝙴',
        'F': '𝙵',
        'G': '𝙶',
        'H': '𝙷',
        'I': '𝙸',
        'J': '𝙹',
        'K': '𝙺',
        'L': '𝙻',
        'M': '𝙼',
        'N': '𝙽',
        'O': '𝙾',
        'P': '𝙿',
        'Q': '𝚀',
        'R': '𝚁',
        'S': '𝚂',
        'T': '𝚃',
        'U': '𝚄',
        'V': '𝚅',
        'W': '𝚆',
        'X': '𝚇',
        'Y': '𝚈',
        'Z': '𝚉'
    },
    boldItalicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝙖',
        'b': '𝙗',
        'c': '𝙘',
        'd': '𝙙',
        'e': '𝙚',
        'f': '𝙛',
        'g': '𝙜',
        'h': '𝙝',
        'i': '𝙞',
        'j': '𝙟',
        'k': '𝙠',
        'l': '𝙡',
        'm': '𝙢',
        'n': '𝙣',
        'o': '𝙤',
        'p': '𝙥',
        'q': '𝙦',
        'r': '𝙧',
        's': '𝙨',
        't': '𝙩',
        'u': '𝙪',
        'v': '𝙫',
        'w': '𝙬',
        'x': '𝙭',
        'y': '𝙮',
        'z': '𝙯',
        'A': '𝘼',
        'B': '𝘽',
        'C': '𝘾',
        'D': '𝘿',
        'E': '𝙀',
        'F': '𝙁',
        'G': '𝙂',
        'H': '𝙃',
        'I': '𝙄',
        'J': '𝙅',
        'K': '𝙆',
        'L': '𝙇',
        'M': '𝙈',
        'N': '𝙉',
        'O': '𝙊',
        'P': '𝙋',
        'Q': '𝙌',
        'R': '𝙍',
        'S': '𝙎',
        'T': '𝙏',
        'U': '𝙐',
        'V': '𝙑',
        'W': '𝙒',
        'X': '𝙓',
        'Y': '𝙔',
        'Z': '𝙕'
    },
    boldCharMap = {
        0x0: '𝟎',
        0x1: '𝟏',
        0x2: '𝟐',
        0x3: '𝟑',
        0x4: '𝟒',
        0x5: '𝟓',
        0x6: '𝟔',
        0x7: '𝟕',
        0x8: '𝟖',
        0x9: '𝟗',
        'a': '𝐚',
        'b': '𝐛',
        'c': '𝐜',
        'd': '𝐝',
        'e': '𝐞',
        'f': '𝐟',
        'g': '𝐠',
        'h': '𝐡',
        'i': '𝐢',
        'j': '𝐣',
        'k': '𝐤',
        'l': '𝐥',
        'm': '𝐦',
        'n': '𝐧',
        'o': '𝐨',
        'p': '𝐩',
        'q': '𝐪',
        'r': '𝐫',
        's': '𝐬',
        't': '𝐭',
        'u': '𝐮',
        'v': '𝐯',
        'w': '𝐰',
        'x': '𝐱',
        'y': '𝐲',
        'z': '𝐳',
        'A': '𝐀',
        'B': '𝐁',
        'C': '𝐂',
        'D': '𝐃',
        'E': '𝐄',
        'F': '𝐅',
        'G': '𝐆',
        'H': '𝐇',
        'I': '𝐈',
        'J': '𝐉',
        'K': '𝐊',
        'L': '𝐋',
        'M': '𝐌',
        'N': '𝐍',
        'O': '𝐎',
        'P': '𝐏',
        'Q': '𝐐',
        'R': '𝐑',
        'S': '𝐒',
        'T': '𝐓',
        'U': '𝐔',
        'V': '𝐕',
        'W': '𝐖',
        'X': '𝐗',
        'Y': '𝐘',
        'Z': '𝐙'
    },
    italicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝘢',
        'b': '𝘣',
        'c': '𝘤',
        'd': '𝘥',
        'e': '𝘦',
        'f': '𝘧',
        'g': '𝘨',
        'h': '𝘩',
        'i': '𝘪',
        'j': '𝘫',
        'k': '𝘬',
        'l': '𝘭',
        'm': '𝘮',
        'n': '𝘯',
        'o': '𝘰',
        'p': '𝘱',
        'q': '𝘲',
        'r': '𝘳',
        's': '𝘴',
        't': '𝘵',
        'u': '𝘶',
        'v': '𝘷',
        'w': '𝘸',
        'x': '𝘹',
        'y': '𝘺',
        'z': '𝘻',
        'A': '𝘈',
        'B': '𝘉',
        'C': '𝘊',
        'D': '𝘋',
        'E': '𝘌',
        'F': '𝘍',
        'G': '𝘎',
        'H': '𝘏',
        'I': '𝘐',
        'J': '𝘑',
        'K': '𝘒',
        'L': '𝘓',
        'M': '𝘔',
        'N': '𝘕',
        'O': '𝘖',
        'P': '𝘗',
        'Q': '𝘘',
        'R': '𝘙',
        'S': '𝘚',
        'T': '𝘛',
        'U': '𝘜',
        'V': '𝘝',
        'W': '𝘞',
        'X': '𝘟',
        'Y': '𝘠',
        'Z': '𝘡'
    },
    squiggle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'Ⴆ',
        'c': 'ƈ',
        'd': 'ԃ',
        'e': 'ҽ',
        'f': 'ϝ',
        'g': 'ɠ',
        'h': 'ԋ',
        'i': 'ι',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'ʅ',
        'm': 'ɱ',
        'n': 'ɳ',
        'o': 'σ',
        'p': 'ρ',
        'q': 'ϙ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'ƚ',
        'u': 'υ',
        'v': 'ʋ',
        'w': 'ɯ',
        'x': 'x',
        'y': 'ყ',
        'z': 'ȥ',
        'A': 'A',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'E',
        'F': 'F',
        'G': 'G',
        'H': 'H',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'N',
        'O': 'O',
        'P': 'P',
        'Q': 'Q',
        'R': 'R',
        'S': 'S',
        'T': 'T',
        'U': 'U',
        'V': 'V',
        'W': 'W',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    currencyCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '₳',
        'b': '฿',
        'c': '₵',
        'd': 'Đ',
        'e': 'Ɇ',
        'f': '₣',
        'g': '₲',
        'h': 'Ⱨ',
        'i': 'ł',
        'j': 'J',
        'k': '₭',
        'l': 'Ⱡ',
        'm': '₥',
        'n': '₦',
        'o': 'Ø',
        'p': '₱',
        'q': 'Q',
        'r': 'Ɽ',
        's': '₴',
        't': '₮',
        'u': 'Ʉ',
        'v': 'V',
        'w': '₩',
        'x': 'Ӿ',
        'y': 'Ɏ',
        'z': 'Ⱬ',
        'A': '₳',
        'B': '฿',
        'C': '₵',
        'D': 'Đ',
        'E': 'Ɇ',
        'F': '₣',
        'G': '₲',
        'H': 'Ⱨ',
        'I': 'ł',
        'J': 'J',
        'K': '₭',
        'L': 'Ⱡ',
        'M': '₥',
        'N': '₦',
        'O': 'Ø',
        'P': '₱',
        'Q': 'Q',
        'R': 'Ɽ',
        'S': '₴',
        'T': '₮',
        'U': 'Ʉ',
        'V': 'V',
        'W': '₩',
        'X': 'Ӿ',
        'Y': 'Ɏ',
        'Z': 'Ⱬ'
    },
    symbolsCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'å',
        'b': 'ß',
        'c': '¢',
        'd': 'Ð',
        'e': 'ê',
        'f': '£',
        'g': 'g',
        'h': 'h',
        'i': 'ï',
        'j': 'j',
        'k': 'k',
        'l': 'l',
        'm': 'm',
        'n': 'ñ',
        'o': 'ð',
        'p': 'þ',
        'q': 'q',
        'r': 'r',
        's': '§',
        't': '†',
        'u': 'µ',
        'v': 'v',
        'w': 'w',
        'x': 'x',
        'y': '¥',
        'z': 'z',
        'A': 'Ä',
        'B': 'ß',
        'C': 'Ç',
        'D': 'Ð',
        'E': 'È',
        'F': '£',
        'G': 'G',
        'H': 'H',
        'I': 'Ì',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'ñ',
        'O': 'Ö',
        'P': 'þ',
        'Q': 'Q',
        'R': 'R',
        'S': '§',
        'T': '†',
        'U': 'Ú',
        'V': 'V',
        'W': 'W',
        'X': '×',
        'Y': '¥',
        'Z': 'Z'
    },
    greekCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'в',
        'c': '¢',
        'd': '∂',
        'e': 'є',
        'f': 'ƒ',
        'g': 'g',
        'h': 'н',
        'i': 'ι',
        'j': 'נ',
        'k': 'к',
        'l': 'ℓ',
        'm': 'м',
        'n': 'η',
        'o': 'σ',
        'p': 'ρ',
        'q': 'q',
        'r': 'я',
        's': 'ѕ',
        't': 'т',
        'u': 'υ',
        'v': 'ν',
        'w': 'ω',
        'x': 'χ',
        'y': 'у',
        'z': 'z',
        'A': 'α',
        'B': 'в',
        'C': '¢',
        'D': '∂',
        'E': 'є',
        'F': 'ƒ',
        'G': 'g',
        'H': 'н',
        'I': 'ι',
        'J': 'נ',
        'K': 'к',
        'L': 'ℓ',
        'M': 'м',
        'N': 'η',
        'O': 'σ',
        'P': 'ρ',
        'Q': 'q',
        'R': 'я',
        'S': 'ѕ',
        'T': 'т',
        'U': 'υ',
        'V': 'ν',
        'W': 'ω',
        'X': 'χ',
        'Y': 'у',
        'Z': 'z'
    },
    bentTextCharMap = {
        0x0: '⊘',
        0x1: '𝟙',
        0x2: 'ϩ',
        0x3: 'Ӡ',
        0x4: '५',
        0x5: 'Ƽ',
        0x6: 'Ϭ',
        0x7: '7',
        0x8: '𝟠',
        0x9: '९',
        'a': 'ą',
        'b': 'ҍ',
        'c': 'ç',
        'd': 'ժ',
        'e': 'ҽ',
        'f': 'ƒ',
        'g': 'ց',
        'h': 'հ',
        'i': 'ì',
        'j': 'ʝ',
        'k': 'ҟ',
        'l': 'Ӏ',
        'm': 'ʍ',
        'n': 'ղ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'է',
        'u': 'մ',
        'v': 'ѵ',
        'w': 'ա',
        'x': '×',
        'y': 'վ',
        'z': 'Հ',
        'A': 'Ⱥ',
        'B': 'β',
        'C': '↻',
        'D': 'Ꭰ',
        'E': 'Ɛ',
        'F': 'Ƒ',
        'G': 'Ɠ',
        'H': 'Ƕ',
        'I': 'į',
        'J': 'ل',
        'K': 'Ҡ',
        'L': 'Ꝉ',
        'M': 'Ɱ',
        'N': 'ហ',
        'O': 'ට',
        'P': 'φ',
        'Q': 'Ҩ',
        'R': 'འ',
        'S': 'Ϛ',
        'T': 'Ͳ',
        'U': 'Ա',
        'V': 'Ỽ',
        'W': 'చ',
        'X': 'ჯ',
        'Y': 'Ӌ',
        'Z': 'ɀ'
    },
    upperAnglesCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Λ',
        'b': 'B',
        'c': 'ᄃ',
        'd': 'D',
        'e': 'Σ',
        'f': 'F',
        'g': 'G',
        'h': 'Ή',
        'i': 'I',
        'j': 'J',
        'k': 'K',
        'l': 'ᄂ',
        'm': 'M',
        'n': 'П',
        'o': 'Ө',
        'p': 'P',
        'q': 'Q',
        'r': 'Я',
        's': 'Ƨ',
        't': 'Ƭ',
        'u': 'Ц',
        'v': 'V',
        'w': 'Щ',
        'x': 'X',
        'y': 'Y',
        'z': 'Z',
        'A': 'Λ',
        'B': 'B',
        'C': 'ᄃ',
        'D': 'D',
        'E': 'Σ',
        'F': 'F',
        'G': 'G',
        'H': 'Ή',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'ᄂ',
        'M': 'M',
        'N': 'П',
        'O': 'Ө',
        'P': 'P',
        'Q': 'Q',
        'R': 'Я',
        'S': 'Ƨ',
        'T': 'Ƭ',
        'U': 'Ц',
        'V': 'V',
        'W': 'Щ',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    subscriptCharMap = {
        0x0: '₀',
        0x1: '₁',
        0x2: '₂',
        0x3: '₃',
        0x4: '₄',
        0x5: '₅',
        0x6: '₆',
        0x7: '₇',
        0x8: '₈',
        0x9: '₉',
        'a': 'ₐ',
        'b': 'b',
        'c': 'c',
        'd': 'd',
        'e': 'ₑ',
        'f': 'f',
        'g': 'g',
        'h': 'ₕ',
        'i': 'ᵢ',
        'j': 'ⱼ',
        'k': 'ₖ',
        'l': 'ₗ',
        'm': 'ₘ',
        'n': 'ₙ',
        'o': 'ₒ',
        'p': 'ₚ',
        'q': 'q',
        'r': 'ᵣ',
        's': 'ₛ',
        't': 'ₜ',
        'u': 'ᵤ',
        'v': 'ᵥ',
        'w': 'w',
        'x': 'ₓ',
        'y': 'y',
        'z': 'z',
        'A': 'ₐ',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'ₑ',
        'F': 'F',
        'G': 'G',
        'H': 'ₕ',
        'I': 'ᵢ',
        'J': 'ⱼ',
        'K': 'ₖ',
        'L': 'ₗ',
        'M': 'ₘ',
        'N': 'ₙ',
        'O': 'ₒ',
        'P': 'ₚ',
        'Q': 'Q',
        'R': 'ᵣ',
        'S': 'ₛ',
        'T': 'ₜ',
        'U': 'ᵤ',
        'V': 'ᵥ',
        'W': 'W',
        'X': 'ₓ',
        'Y': 'Y',
        'Z': 'Z',
        '+': '₊',
        '-': '₋',
        '=': '₌',
        '(': '₍',
        ')': '₎'
    },
    superscriptCharMap = {
        0x0: '⁰',
        0x1: '¹',
        0x2: '²',
        0x3: '³',
        0x4: '⁴',
        0x5: '⁵',
        0x6: '⁶',
        0x7: '⁷',
        0x8: '⁸',
        0x9: '⁹',
        'a': 'ᵃ',
        'b': 'ᵇ',
        'c': 'ᶜ',
        'd': 'ᵈ',
        'e': 'ᵉ',
        'f': 'ᶠ',
        'g': 'ᵍ',
        'h': 'ʰ',
        'i': 'ⁱ',
        'j': 'ʲ',
        'k': 'ᵏ',
        'l': 'ˡ',
        'm': 'ᵐ',
        'n': 'ⁿ',
        'o': 'ᵒ',
        'p': 'ᵖ',
        'q': 'q',
        'r': 'ʳ',
        's': 'ˢ',
        't': 'ᵗ',
        'u': 'ᵘ',
        'v': 'ᵛ',
        'w': 'ʷ',
        'x': 'ˣ',
        'y': 'ʸ',
        'z': 'ᶻ',
        'A': 'ᴬ',
        'B': 'ᴮ',
        'C': 'ᶜ',
        'D': 'ᴰ',
        'E': 'ᴱ',
        'F': 'ᶠ',
        'G': 'ᴳ',
        'H': 'ᴴ',
        'I': 'ᴵ',
        'J': 'ᴶ',
        'K': 'ᴷ',
        'L': 'ᴸ',
        'M': 'ᴹ',
        'N': 'ᴺ',
        'O': 'ᴼ',
        'P': 'ᴾ',
        'Q': 'Q',
        'R': 'ᴿ',
        'S': 'ˢ',
        'T': 'ᵀ',
        'U': 'ᵁ',
        'V': 'ⱽ',
        'W': 'ᵂ',
        'X': 'ˣ',
        'Y': 'ʸ',
        'Z': 'ᶻ',
        '+': '⁺',
        '-': '⁻',
        '=': '⁼',
        '(': '⁽',
        ')': '⁾'
    },
    squiggleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๒',
        'c': 'ς',
        'd': '๔',
        'e': 'є',
        'f': 'Ŧ',
        'g': 'ﻮ',
        'h': 'ђ',
        'i': 'เ',
        'j': 'ן',
        'k': 'к',
        'l': 'ɭ',
        'm': '๓',
        'n': 'ภ',
        'o': '๏',
        'p': 'ק',
        'q': 'ợ',
        'r': 'г',
        's': 'ร',
        't': 'Շ',
        'u': 'ย',
        'v': 'ש',
        'w': 'ฬ',
        'x': 'א',
        'y': 'ץ',
        'z': 'չ',
        'A': 'ค',
        'B': '๒',
        'C': 'ς',
        'D': '๔',
        'E': 'є',
        'F': 'Ŧ',
        'G': 'ﻮ',
        'H': 'ђ',
        'I': 'เ',
        'J': 'ן',
        'K': 'к',
        'L': 'ɭ',
        'M': '๓',
        'N': 'ภ',
        'O': '๏',
        'P': 'ק',
        'Q': 'ợ',
        'R': 'г',
        'S': 'ร',
        'T': 'Շ',
        'U': 'ย',
        'V': 'ש',
        'W': 'ฬ',
        'X': 'א',
        'Y': 'ץ',
        'Z': 'չ'
    },
    doubleStruckCharMap = {
        0x0: '𝟘',
        0x1: '𝟙',
        0x2: '𝟚',
        0x3: '𝟛',
        0x4: '𝟜',
        0x5: '𝟝',
        0x6: '𝟞',
        0x7: '𝟟',
        0x8: '𝟠',
        0x9: '𝟡',
        'a': '𝕒',
        'b': '𝕓',
        'c': '𝕔',
        'd': '𝕕',
        'e': '𝕖',
        'f': '𝕗',
        'g': '𝕘',
        'h': '𝕙',
        'i': '𝕚',
        'j': '𝕛',
        'k': '𝕜',
        'l': '𝕝',
        'm': '𝕞',
        'n': '𝕟',
        'o': '𝕠',
        'p': '𝕡',
        'q': '𝕢',
        'r': '𝕣',
        's': '𝕤',
        't': '𝕥',
        'u': '𝕦',
        'v': '𝕧',
        'w': '𝕨',
        'x': '𝕩',
        'y': '𝕪',
        'z': '𝕫',
        'A': '𝔸',
        'B': '𝔹',
        'C': 'ℂ',
        'D': '𝔻',
        'E': '𝔼',
        'F': '𝔽',
        'G': '𝔾',
        'H': 'ℍ',
        'I': '𝕀',
        'J': '𝕁',
        'K': '𝕂',
        'L': '𝕃',
        'M': '𝕄',
        'N': 'ℕ',
        'O': '𝕆',
        'P': 'ℙ',
        'Q': 'ℚ',
        'R': 'ℝ',
        'S': '𝕊',
        'T': '𝕋',
        'U': '𝕌',
        'V': '𝕍',
        'W': '𝕎',
        'X': '𝕏',
        'Y': '𝕐',
        'Z': 'ℤ'
    },
    medievalCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝖆',
        'b': '𝖇',
        'c': '𝖈',
        'd': '𝖉',
        'e': '𝖊',
        'f': '𝖋',
        'g': '𝖌',
        'h': '𝖍',
        'i': '𝖎',
        'j': '𝖏',
        'k': '𝖐',
        'l': '𝖑',
        'm': '𝖒',
        'n': '𝖓',
        'o': '𝖔',
        'p': '𝖕',
        'q': '𝖖',
        'r': '𝖗',
        's': '𝖘',
        't': '𝖙',
        'u': '𝖚',
        'v': '𝖛',
        'w': '𝖜',
        'x': '𝖝',
        'y': '𝖞',
        'z': '𝖟',
        'A': '𝕬',
        'B': '𝕭',
        'C': '𝕮',
        'D': '𝕯',
        'E': '𝕰',
        'F': '𝕱',
        'G': '𝕲',
        'H': '𝕳',
        'I': '𝕴',
        'J': '𝕵',
        'K': '𝕶',
        'L': '𝕷',
        'M': '𝕸',
        'N': '𝕹',
        'O': '𝕺',
        'P': '𝕻',
        'Q': '𝕼',
        'R': '𝕽',
        'S': '𝕾',
        'T': '𝕿',
        'U': '𝖀',
        'V': '𝖁',
        'W': '𝖂',
        'X': '𝖃',
        'Y': '𝖄',
        'Z': '𝖅'
    },
    invertedSquaresCharMap = {
        'q': '🆀',
        'w': '🆆',
        'e': '🅴',
        'r': '🆁',
        't': '🆃',
        'y': '🆈',
        'u': '🆄',
        'i': '🅸',
        'o': '🅾',
        'p': '🅿',
        'a': '🅰',
        's': '🆂',
        'd': '🅳',
        'f': '🅵',
        'g': '🅶',
        'h': '🅷',
        'j': '🅹',
        'k': '🅺',
        'l': '🅻',
        'z': '🆉',
        'x': '🆇',
        'c': '🅲',
        'v': '🆅',
        'b': '🅱',
        'n': '🅽',
        'm': '🅼'
    },
    cursiveCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝓪',
        'b': '𝓫',
        'c': '𝓬',
        'd': '𝓭',
        'e': '𝓮',
        'f': '𝓯',
        'g': '𝓰',
        'h': '𝓱',
        'i': '𝓲',
        'j': '𝓳',
        'k': '𝓴',
        'l': '𝓵',
        'm': '𝓶',
        'n': '𝓷',
        'o': '𝓸',
        'p': '𝓹',
        'q': '𝓺',
        'r': '𝓻',
        's': '𝓼',
        't': '𝓽',
        'u': '𝓾',
        'v': '𝓿',
        'w': '𝔀',
        'x': '𝔁',
        'y': '𝔂',
        'z': '𝔃',
        'A': '𝓐',
        'B': '𝓑',
        'C': '𝓒',
        'D': '𝓓',
        'E': '𝓔',
        'F': '𝓕',
        'G': '𝓖',
        'H': '𝓗',
        'I': '𝓘',
        'J': '𝓙',
        'K': '𝓚',
        'L': '𝓛',
        'M': '𝓜',
        'N': '𝓝',
        'O': '𝓞',
        'P': '𝓟',
        'Q': '𝓠',
        'R': '𝓡',
        'S': '𝓢',
        'T': '𝓣',
        'U': '𝓤',
        'V': '𝓥',
        'W': '𝓦',
        'X': '𝓧',
        'Y': '𝓨',
        'Z': '𝓩'
    },
    oldEnglishCharMap = {
        'a': '𝔞',
        'b': '𝔟',
        'c': '𝔠',
        'd': '𝔡',
        'e': '𝔢',
        'f': '𝔣',
        'g': '𝔤',
        'h': '𝔥',
        'i': '𝔦',
        'j': '𝔧',
        'k': '𝔨',
        'l': '𝔩',
        'm': '𝔪',
        'n': '𝔫',
        'o': '𝔬',
        'p': '𝔭',
        'q': '𝔮',
        'r': '𝔯',
        's': '𝔰',
        't': '𝔱',
        'u': '𝔲',
        'v': '𝔳',
        'w': '𝔴',
        'x': '𝔵',
        'y': '𝔶',
        'z': '𝔷',
        'A': '𝔄',
        'B': '𝔅',
        'C': 'ℭ',
        'D': '𝔇',
        'E': '𝔈',
        'F': '𝔉',
        'G': '𝔊',
        'H': 'ℌ',
        'I': 'ℑ',
        'J': '𝔍',
        'K': '𝔎',
        'L': '𝔏',
        'M': '𝔐',
        'N': '𝔑',
        'O': '𝔒',
        'P': '𝔓',
        'Q': '𝔔',
        'R': 'ℜ',
        'S': '𝔖',
        'T': '𝔗',
        'U': '𝔘',
        'V': '𝔙',
        'W': '𝔚',
        'X': '𝔛',
        'Y': '𝔜',
        'Z': 'ℨ'
    },
    wideTextCharMap = {
        '`': '`',
        0x1: '１',
        0x2: '２',
        0x3: '３',
        0x4: '４',
        0x5: '５',
        0x6: '６',
        0x7: '７',
        0x8: '８',
        0x9: '９',
        0x0: '０',
        '-': '－',
        '=': '＝',
        '~': '~',
        '!': '！',
        '@': '＠',
        '#': '＃',
        '$': '＄',
        '%': '％',
        '^': '^',
        '&': '＆',
        '*': '＊',
        '(': '（',
        ')': '）',
        '_': '_',
        '+': '＋',
        'q': 'ｑ',
        'w': 'ｗ',
        'e': 'ｅ',
        'r': 'ｒ',
        't': 'ｔ',
        'y': 'ｙ',
        'u': 'ｕ',
        'i': 'ｉ',
        'o': 'ｏ',
        'p': 'ｐ',
        '[': '[',
        ']': ']',
        '\x5c': '\x5c',
        'Q': 'Ｑ',
        'W': 'Ｗ',
        'E': 'Ｅ',
        'R': 'Ｒ',
        'T': 'Ｔ',
        'Y': 'Ｙ',
        'U': 'Ｕ',
        'I': 'Ｉ',
        'O': 'Ｏ',
        'P': 'Ｐ',
        '{': '{',
        '}': '}',
        '|': '|',
        'a': 'ａ',
        's': 'ｓ',
        'd': 'ｄ',
        'f': 'ｆ',
        'g': 'ｇ',
        'h': 'ｈ',
        'j': 'ｊ',
        'k': 'ｋ',
        'l': 'ｌ',
        ';': '；',
        '\x27': '＇',
        'A': 'Ａ',
        'S': 'Ｓ',
        'D': 'Ｄ',
        'F': 'Ｆ',
        'G': 'Ｇ',
        'H': 'Ｈ',
        'J': 'Ｊ',
        'K': 'Ｋ',
        'L': 'Ｌ',
        ':': '：',
        '\x22': '\x22',
        'z': 'ｚ',
        'x': 'ｘ',
        'c': 'ｃ',
        'v': 'ｖ',
        'b': 'ｂ',
        'n': 'ｎ',
        'm': 'ｍ',
        ',': '，',
        '.': '．',
        '/': '／',
        'Z': 'Ｚ',
        'X': 'Ｘ',
        'C': 'Ｃ',
        'V': 'Ｖ',
        'B': 'Ｂ',
        'N': 'Ｎ',
        'M': 'Ｍ',
        '<': '<',
        '>': '>',
        '?': '？'
    };

function Lunicode() {
    var _0x50eca3 = _0xb7847f;
    this[_0x50eca3(0x404)] = {
        'flip': {
            'init': function() {
                var _0x5c69c1 = _0x50eca3;
                for (i in this[_0x5c69c1(0x169)]) this['map'][this[_0x5c69c1(0x169)][i]] = i;
            },
            'encode': function(_0x175066) {
                var _0x1746a6 = _0x50eca3;
                for (var _0x2a7e66, _0x2a7bb7 = [], _0x3a4f11 = 0x0, _0x22bf19 = _0x175066[_0x1746a6(0x1ab)]; _0x22bf19 > _0x3a4f11; _0x3a4f11++) _0x2a7e66 = _0x175066['charAt'](_0x3a4f11), _0x3a4f11 > 0x0 && ('̤' == _0x2a7e66 || '̗' == _0x2a7e66 || '̖' == _0x2a7e66 || '̮' == _0x2a7e66) ? (_0x2a7e66 = this['map'][_0x175066[_0x1746a6(0x38f)](_0x3a4f11 - 0x1) + _0x2a7e66], _0x2a7bb7[_0x1746a6(0x3d4)]()) : (_0x2a7e66 = this[_0x1746a6(0x169)][_0x2a7e66], _0x1746a6(0x37c) == typeof _0x2a7e66 && (_0x2a7e66 = _0x175066['charAt'](_0x3a4f11))), _0x2a7bb7[_0x1746a6(0x3f3)](_0x2a7e66);
                return _0x2a7bb7[_0x1746a6(0x3be)]()[_0x1746a6(0x32b)]('');
            },
            'decode': function(_0x2e88a2) {
                var _0x3bbd76 = _0x50eca3;
                for (var _0x533a97, _0x8ec3d4 = [], _0x2b30ac = 0x0, _0x282e30 = _0x2e88a2[_0x3bbd76(0x1ab)]; _0x282e30 > _0x2b30ac; _0x2b30ac++) _0x533a97 = _0x2e88a2[_0x3bbd76(0x38f)](_0x2b30ac), _0x2b30ac > 0x0 && ('̤' == _0x533a97 || '̗' == _0x533a97 || '̖' == _0x533a97 || '̮' == _0x533a97) ? (_0x533a97 = this[_0x3bbd76(0x169)][_0x2e88a2['charAt'](_0x2b30ac - 0x1) + _0x533a97], _0x8ec3d4[_0x3bbd76(0x3d4)]()) : (_0x533a97 = this[_0x3bbd76(0x169)][_0x533a97], _0x3bbd76(0x37c) == typeof _0x533a97 && (_0x533a97 = _0x2e88a2['charAt'](_0x2b30ac))), _0x8ec3d4[_0x3bbd76(0x3f3)](_0x533a97);
                return _0x8ec3d4[_0x3bbd76(0x3be)]()[_0x3bbd76(0x32b)]('');
            },
            'map': {
                'a': 'ɐ',
                'b': 'q',
                'c': 'ɔ',
                'd': 'p',
                'e': 'ǝ',
                'f': 'ɟ',
                'g': 'ɓ',
                'h': 'ɥ',
                'i': 'ı',
                'j': 'ɾ',
                'k': 'ʞ',
                'l': 'l',
                'm': 'ɯ',
                'n': 'u',
                'r': 'ɹ',
                't': 'ʇ',
                'v': 'ʌ',
                'w': 'ʍ',
                'y': 'ʎ',
                'A': '∀',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'Ⅎ',
                'G': '⅁',
                'J': 'ſ',
                'K': '⋊',
                'L': '˥',
                'M': 'W',
                'P': 'Ԁ',
                'Q': 'Ό',
                'R': 'ᴚ',
                'T': '⊥',
                'U': '∩',
                'V': 'Λ',
                'Y': '⅄',
                0x1: '⇂',
                0x2: 'ᄅ',
                0x3: 'Ɛ',
                0x4: 'ㄣ',
                0x5: 'ގ',
                0x6: '9',
                0x7: 'ㄥ',
                '&': '⅋',
                '.': '˙',
                '\x22': '„',
                ';': '؛',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '¿',
                '!': '¡',
                '\x27': ',',
                '<': '>',
                '‾': '_',
                '¯': '_',
                '‿': '⁀',
                '⁅': '⁆',
                '∴': '∵',
                '\x0d': '\x0a',
                'ß': 'ᙠ',
                '̈': '̤',
                'ä': 'ɐ̤',
                'ö': 'o̤',
                'ü': 'n̤',
                'Ä': '∀̤',
                'Ö': 'O̤',
                'Ü': '∩̤',
                '´': '\x20̗',
                'é': 'ǝ̗',
                'á': 'ɐ̗',
                'ó': 'o̗',
                'ú': 'n̗',
                'É': 'Ǝ̗',
                'Á': '∀̗',
                'Ó': 'O̗',
                'Ú': '∩̗',
                '`': '\x20̖',
                'è': 'ǝ̖',
                'à': 'ɐ̖',
                'ò': 'o̖',
                'ù': 'n̖',
                'È': 'Ǝ̖',
                'À': '∀̖',
                'Ò': 'O̖',
                'Ù': '∩̖',
                '^': '\x20̮',
                'ê': 'ǝ̮',
                'â': 'ɐ̮',
                'ô': 'o̮',
                'û': 'n̮',
                'Ê': 'Ǝ̮',
                'Â': '∀̮',
                'Ô': 'O̮',
                'Û': '∩̮'
            }
        },
        'mirror': {
            'init': function() {
                var _0x3c54d6 = _0x50eca3;
                for (i in this[_0x3c54d6(0x169)]) this['map'][this[_0x3c54d6(0x169)][i]] = i;
            },
            'encode': function(_0x2a298f) {
                var _0x1bfeca = _0x50eca3;
                for (var _0x369f1c, _0x42c972 = [], _0x5ae341 = [], _0x2ea868 = 0x0, _0x5033fb = _0x2a298f[_0x1bfeca(0x1ab)]; _0x5033fb > _0x2ea868; _0x2ea868++) _0x369f1c = _0x2a298f[_0x1bfeca(0x38f)](_0x2ea868), _0x2ea868 > 0x0 && ('̈' == _0x369f1c || '̀' == _0x369f1c || '́' == _0x369f1c || '̂' == _0x369f1c) ? (_0x369f1c = this['map'][_0x2a298f[_0x1bfeca(0x38f)](_0x2ea868 - 0x1) + _0x369f1c], _0x42c972[_0x1bfeca(0x3d4)]()) : (_0x369f1c = this[_0x1bfeca(0x169)][_0x369f1c], _0x1bfeca(0x37c) == typeof _0x369f1c && (_0x369f1c = _0x2a298f[_0x1bfeca(0x38f)](_0x2ea868))), '\x0a' == _0x369f1c ? (_0x5ae341[_0x1bfeca(0x3f3)](_0x42c972[_0x1bfeca(0x3be)]()[_0x1bfeca(0x32b)]('')), _0x42c972 = []) : _0x42c972['push'](_0x369f1c);
                return _0x5ae341['push'](_0x42c972[_0x1bfeca(0x3be)]()[_0x1bfeca(0x32b)]('')), _0x5ae341[_0x1bfeca(0x32b)]('\x0a');
            },
            'decode': function(_0xab94c8) {
                var _0x4c6cc7 = _0x50eca3;
                for (var _0x2cc70d, _0x224e63 = [], _0x1e3096 = [], _0x21f00d = 0x0, _0xaa52c = _0xab94c8[_0x4c6cc7(0x1ab)]; _0xaa52c > _0x21f00d; _0x21f00d++) _0x2cc70d = _0xab94c8[_0x4c6cc7(0x38f)](_0x21f00d), _0x21f00d > 0x0 && ('̈' == _0x2cc70d || '̀' == _0x2cc70d || '́' == _0x2cc70d || '̂' == _0x2cc70d) ? (_0x2cc70d = this[_0x4c6cc7(0x169)][_0xab94c8[_0x4c6cc7(0x38f)](_0x21f00d - 0x1) + _0x2cc70d], _0x224e63[_0x4c6cc7(0x3d4)]()) : (_0x2cc70d = this[_0x4c6cc7(0x169)][_0x2cc70d], _0x4c6cc7(0x37c) == typeof _0x2cc70d && (_0x2cc70d = _0xab94c8[_0x4c6cc7(0x38f)](_0x21f00d))), '\x0a' == _0x2cc70d ? (_0x1e3096[_0x4c6cc7(0x3f3)](_0x224e63['reverse']()[_0x4c6cc7(0x32b)]('')), _0x224e63 = []) : _0x224e63[_0x4c6cc7(0x3f3)](_0x2cc70d);
                return _0x1e3096['push'](_0x224e63[_0x4c6cc7(0x3be)]()[_0x4c6cc7(0x32b)]('')), _0x1e3096[_0x4c6cc7(0x32b)]('\x0a');
            },
            'map': {
                'a': 'ɒ',
                'b': 'd',
                'c': 'ɔ',
                'e': 'ɘ',
                'f': 'Ꮈ',
                'g': 'ǫ',
                'h': 'ʜ',
                'j': 'ꞁ',
                'k': 'ʞ',
                'l': '|',
                'n': 'ᴎ',
                'p': 'q',
                'r': 'ɿ',
                's': 'ꙅ',
                't': 'ƚ',
                'y': 'ʏ',
                'z': 'ƹ',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'ꟻ',
                'G': 'Ꭾ',
                'J': 'Ⴑ',
                'K': '⋊',
                'L': '⅃',
                'N': 'Ͷ',
                'P': 'ꟼ',
                'Q': 'Ọ',
                'R': 'Я',
                'S': 'Ꙅ',
                'Z': 'Ƹ',
                0x1: '',
                0x2: '',
                0x3: '',
                0x4: '',
                0x5: '',
                0x6: '',
                0x7: '',
                '&': '',
                ';': '',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '⸮',
                '<': '>',
                'ä': 'ɒ̈',
                'ß': 'ᙠ',
                '´': '`',
                'é': 'ɘ̀',
                'á': 'ɒ̀',
                'ó': 'ò',
                'ú': 'ù',
                'É': 'Ǝ̀',
                'Á': 'À',
                'Ó': 'Ò',
                'Ú': 'Ù',
                '`': '´',
                'è': 'ɘ́',
                'à': 'ɒ́',
                'È': 'Ǝ́',
                'ê': 'ɘ̂',
                'â': 'ɒ̂',
                'Ê': 'Ǝ̂',
                'Ø': 'ᴓ',
                'ø': 'ᴓ'
            }
        },
        'creepify': {
            'init': function() {
                var _0x4ae922 = _0x50eca3;
                for (var _0x5d6ce3 = 0x300; 0x315 >= _0x5d6ce3; _0x5d6ce3++) this[_0x4ae922(0x14c)]['push'](String[_0x4ae922(0x479)](_0x5d6ce3));
                for (var _0x5d6ce3 = 0x316; 0x333 >= _0x5d6ce3; _0x5d6ce3++) 0x31a != _0x5d6ce3 && 0x31b != _0x5d6ce3 && this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](_0x5d6ce3));
                this['diacriticsTop'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x31a)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x31b));
                for (var _0x5d6ce3 = 0x334; 0x338 >= _0x5d6ce3; _0x5d6ce3++) this[_0x4ae922(0x3a9)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](_0x5d6ce3));
                for (var _0x5d6ce3 = 0x339; 0x33c >= _0x5d6ce3; _0x5d6ce3++) this['diacriticsBottom'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](_0x5d6ce3));
                for (var _0x5d6ce3 = 0x33d; 0x344 >= _0x5d6ce3; _0x5d6ce3++) this['diacriticsTop'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](_0x5d6ce3));
                this['diacriticsTop']['push'](String[_0x4ae922(0x479)](0x344)), this[_0x4ae922(0x194)]['push'](String[_0x4ae922(0x479)](0x345)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x346)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x347)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String['fromCharCode'](0x348)), this['diacriticsBottom'][_0x4ae922(0x3f3)](String['fromCharCode'](0x349)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x34a)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x34b)), this[_0x4ae922(0x14c)]['push'](String[_0x4ae922(0x479)](0x34c)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x34d)), this[_0x4ae922(0x194)]['push'](String['fromCharCode'](0x34e)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x350)), this['diacriticsTop'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x351)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x352)), this['diacriticsBottom'][_0x4ae922(0x3f3)](String['fromCharCode'](0x353)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x354)), this['diacriticsBottom']['push'](String[_0x4ae922(0x479)](0x355)), this[_0x4ae922(0x194)]['push'](String[_0x4ae922(0x479)](0x356)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x357)), this['diacriticsTop'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x358)), this['diacriticsBottom'][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x359)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x35a)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x35b)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x35c)), this[_0x4ae922(0x14c)]['push'](String[_0x4ae922(0x479)](0x35d)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x35d)), this[_0x4ae922(0x194)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x35f)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String[_0x4ae922(0x479)](0x360)), this[_0x4ae922(0x14c)][_0x4ae922(0x3f3)](String['fromCharCode'](0x361));
            },
            'encode': function(_0x3a96f9) {
                var _0x31d482 = _0x50eca3,
                    _0xaaceac, _0x4986b4 = '';
                for (i in _0x3a96f9) {
                    if (_0xaaceac = _0x3a96f9[i], this[_0x31d482(0x18)][_0x31d482(0x368)] && (_0xaaceac += this[_0x31d482(0x3a9)][Math[_0x31d482(0x20)](Math[_0x31d482(0x505)]() * this['diacriticsMiddle'][_0x31d482(0x1ab)])]), this[_0x31d482(0x18)]['top']) {
                        for (var _0x12536 = this['diacriticsTop'][_0x31d482(0x1ab)] - 0x1, _0x146ba1 = 0x0, _0x36757d = this[_0x31d482(0x18)]['maxHeight'] - Math[_0x31d482(0x505)]() * (this['options'][_0x31d482(0x1df)] / 0x64 * this[_0x31d482(0x18)][_0x31d482(0x3cf)]); _0x36757d > _0x146ba1; _0x146ba1++) _0xaaceac += this[_0x31d482(0x14c)][Math[_0x31d482(0x20)](Math[_0x31d482(0x505)]() * _0x12536)];
                    }
                    if (this[_0x31d482(0x18)][_0x31d482(0x10c)]) {
                        for (var _0x33ab48 = this[_0x31d482(0x194)][_0x31d482(0x1ab)] - 0x1, _0x146ba1 = 0x0, _0x36757d = this[_0x31d482(0x18)][_0x31d482(0x3cf)] - Math[_0x31d482(0x505)]() * (this[_0x31d482(0x18)][_0x31d482(0x1df)] / 0x64 * this[_0x31d482(0x18)][_0x31d482(0x3cf)]); _0x36757d > _0x146ba1; _0x146ba1++) _0xaaceac += this[_0x31d482(0x194)][Math['floor'](Math['random']() * _0x33ab48)];
                    }
                    _0x4986b4 += _0xaaceac;
                }
                return _0x4986b4;
            },
            'decode': function(_0x434fd3) {
                var _0x13cb55 = _0x50eca3,
                    _0x550a32, _0x4df528 = '';
                for (i in _0x434fd3) _0x550a32 = _0x434fd3[i][_0x13cb55(0x1)](0x0), (0x300 > _0x550a32 || _0x550a32 > 0x361) && (_0x4df528 += _0x434fd3[i]);
                return _0x4df528;
            },
            'diacriticsTop': [],
            'diacriticsMiddle': [],
            'diacriticsBottom': [],
            'options': {
                'top': !0x0,
                'middle': !0x0,
                'bottom': !0x0,
                'maxHeight': 0xf,
                'randomization': 0x64
            }
        },
        'bubbles': {
            'init': function() {
                var _0xbe923b = _0x50eca3;
                for (var _0x2f1a93 = 0x31; 0x39 >= _0x2f1a93; _0x2f1a93++) this[_0xbe923b(0x169)][String[_0xbe923b(0x479)](_0x2f1a93)] = String[_0xbe923b(0x479)](_0x2f1a93 + 0x242f);
                this[_0xbe923b(0x169)][0x0] = '⓪';
                for (var _0x2f1a93 = 0x41; 0x5a >= _0x2f1a93; _0x2f1a93++) this[_0xbe923b(0x169)][String[_0xbe923b(0x479)](_0x2f1a93)] = String[_0xbe923b(0x479)](_0x2f1a93 + 0x2475);
                for (var _0x2f1a93 = 0x61; 0x7a >= _0x2f1a93; _0x2f1a93++) this[_0xbe923b(0x169)][String['fromCharCode'](_0x2f1a93)] = String[_0xbe923b(0x479)](_0x2f1a93 + 0x246f);
                for (_0x2f1a93 in this[_0xbe923b(0x169)]) this['mapInverse'][this[_0xbe923b(0x169)][_0x2f1a93]] = _0x2f1a93;
            },
            'encode': function(_0x513bbe) {
                var _0x2c7b12 = _0x50eca3,
                    _0x59c693, _0x268c14 = '',
                    _0x3414c0 = !0x0;
                for (i in _0x513bbe) _0x59c693 = this[_0x2c7b12(0x169)][_0x513bbe[i]], 'undefined' == typeof _0x59c693 && (_0x513bbe[i][_0x2c7b12(0x1)](0x0) >= 0x21 ? (_0x59c693 = _0x513bbe[i] + String['fromCharCode'](0x20dd), _0x3414c0 || (_0x59c693 = String['fromCharCode'](0x202f) + String[_0x2c7b12(0x479)](0xa0) + String['fromCharCode'](0xa0) + String['fromCharCode'](0x202f) + _0x59c693)) : _0x59c693 = _0x513bbe[i]), _0x268c14 += _0x59c693, _0x3414c0 = '\x0a' == _0x59c693;
                return _0x268c14;
            },
            'decode': function(_0x30a4c0) {
                var _0x213696 = _0x50eca3,
                    _0x4aec11, _0x41e9c2 = '',
                    _0x3bb8eb = '';
                for (i in _0x30a4c0) _0x4aec11 = this['mapInverse'][_0x30a4c0[i]], _0x41e9c2 += _0x213696(0x37c) == typeof _0x4aec11 ? _0x30a4c0[i] : _0x4aec11;
                for (i in _0x41e9c2) _0x4aec11 = _0x41e9c2[i]['charCodeAt'](0x0), 0xa0 != _0x4aec11 && 0x202f != _0x4aec11 && 0x20dd != _0x4aec11 && (_0x3bb8eb += _0x41e9c2[i]);
                return _0x3bb8eb;
            },
            'map': {},
            'mapInverse': {}
        },
        'squares': {
            'init': function() {},
            'encode': function(_0x385d25) {
                var _0xc31823 = _0x50eca3,
                    _0x1aaf47, _0x1ab188 = '',
                    _0x3f5920 = !0x0;
                for (i in _0x385d25) _0x385d25[i]['charCodeAt'](0x0) >= 0x21 ? (_0x1aaf47 = _0x385d25[i] + String['fromCharCode'](0x20de), _0x3f5920 || (_0x1aaf47 = String['fromCharCode'](0x202f) + String[_0xc31823(0x479)](0xa0) + String['fromCharCode'](0xa0) + String['fromCharCode'](0x202f) + _0x1aaf47)) : _0x1aaf47 = _0x385d25[i], _0x1ab188 += _0x1aaf47, _0x3f5920 = '\x0a' == _0x1aaf47;
                return _0x1ab188;
            },
            'decode': function(_0x2a530b) {
                var _0x20f61f = _0x50eca3,
                    _0x3a9ca2, _0x4739ed = '';
                for (i in _0x2a530b) _0x3a9ca2 = _0x2a530b[i][_0x20f61f(0x1)](0x0), 0xa0 != _0x3a9ca2 && 0x202f != _0x3a9ca2 && 0x20de != _0x3a9ca2 && (_0x4739ed += _0x2a530b[i]);
                return _0x4739ed;
            }
        },
        'roundsquares': {
            'init': function() {},
            'encode': function(_0x13323c) {
                var _0x1d4d64 = _0x50eca3,
                    _0x26d45d, _0xb55242 = '',
                    _0x394f44 = !0x0;
                for (i in _0x13323c) _0x13323c[i][_0x1d4d64(0x1)](0x0) >= 0x21 ? (_0x26d45d = _0x13323c[i] + String[_0x1d4d64(0x479)](0x20e3), _0x394f44 || (_0x26d45d = String[_0x1d4d64(0x479)](0xa0) + String[_0x1d4d64(0x479)](0xa0) + String[_0x1d4d64(0x479)](0xa0) + _0x26d45d)) : _0x26d45d = _0x13323c[i], _0xb55242 += _0x26d45d, _0x394f44 = '\x0a' == _0x26d45d;
                return _0xb55242;
            },
            'decode': function(_0x335038) {
                var _0x3e37a5 = _0x50eca3,
                    _0x483862, _0xf338ce = '';
                for (i in _0x335038) _0x483862 = _0x335038[i][_0x3e37a5(0x1)](0x0), 0xa0 != _0x483862 && 0x202f != _0x483862 && 0x20e3 != _0x483862 && (_0xf338ce += _0x335038[i]);
                return _0xf338ce;
            }
        },
        'bent': {
            'init': function() {
                var _0x4ebb29 = _0x50eca3;
                for (i in this[_0x4ebb29(0x169)]) this[_0x4ebb29(0x169)][this[_0x4ebb29(0x169)][i]] = i;
            },
            'encode': function(_0x3f4a39) {
                var _0x264039 = _0x50eca3;
                for (var _0x34baec, _0x3441ee = '', _0x45ef4d = 0x0, _0x56cb55 = _0x3f4a39['length']; _0x56cb55 > _0x45ef4d; _0x45ef4d++) _0x34baec = this[_0x264039(0x169)][_0x3f4a39['charAt'](_0x45ef4d)], _0x264039(0x37c) == typeof _0x34baec && (_0x34baec = _0x3f4a39[_0x264039(0x38f)](_0x45ef4d)), _0x3441ee += _0x34baec;
                return _0x3441ee;
            },
            'decode': function(_0x4d7e4e) {
                var _0xb0a01d = _0x50eca3;
                for (var _0x201463, _0x48c048 = '', _0x32974d = 0x0, _0x730f2a = _0x4d7e4e[_0xb0a01d(0x1ab)]; _0x730f2a > _0x32974d; _0x32974d++) _0x201463 = this[_0xb0a01d(0x169)][_0x4d7e4e['charAt'](_0x32974d)], 'undefined' == typeof _0x201463 && (_0x201463 = _0x4d7e4e[_0xb0a01d(0x38f)](_0x32974d)), _0x48c048 += _0x201463;
                return _0x48c048;
            },
            'map': {
                'a': 'ą',
                'b': 'ҍ',
                'c': 'ç',
                'd': 'ժ',
                'e': 'ҽ',
                'f': 'ƒ',
                'g': 'ց',
                'h': 'հ',
                'i': 'ì',
                'j': 'ʝ',
                'k': 'ҟ',
                'l': 'Ӏ',
                'm': 'ʍ',
                'n': 'ղ',
                'o': 'օ',
                'p': 'ք',
                'q': 'զ',
                'r': 'ɾ',
                's': 'ʂ',
                't': 'է',
                'u': 'մ',
                'v': 'ѵ',
                'w': 'ա',
                'x': '×',
                'y': 'վ',
                'z': 'Հ',
                'A': 'Ⱥ',
                'B': 'β',
                'C': '↻',
                'D': 'Ꭰ',
                'E': 'Ɛ',
                'F': 'Ƒ',
                'G': 'Ɠ',
                'H': 'Ƕ',
                'I': 'į',
                'J': 'ل',
                'K': 'Ҡ',
                'L': 'Ꝉ',
                'M': 'Ɱ',
                'N': 'ហ',
                'O': 'ට',
                'P': 'φ',
                'Q': 'Ҩ',
                'R': 'འ',
                'S': 'Ϛ',
                'T': 'Ͳ',
                'U': 'Ա',
                'V': 'Ỽ',
                'W': 'చ',
                'X': 'ჯ',
                'Y': 'Ӌ',
                'Z': 'ɀ',
                0x0: '⊘',
                0x1: _0x50eca3(0x161),
                0x2: 'ϩ',
                0x3: 'Ӡ',
                0x4: '५',
                0x5: 'Ƽ',
                0x6: 'Ϭ',
                0x7: '7',
                0x8: _0x50eca3(0x161),
                0x9: '९',
                '&': '⅋',
                '(': '{',
                ')': '}',
                '{': '(',
                '}': ')',
                'ä': 'ą̈',
                'ö': 'օ̈',
                'ü': 'մ̈',
                'Ä': 'Ⱥ̈',
                'Ö': 'ට̈',
                'Ü': 'Ա̈',
                'é': 'ҽ́',
                'á': 'ą́',
                'ó': 'օ́',
                'ú': 'մ́',
                'É': 'Ɛ́',
                'Á': 'Ⱥ́',
                'Ó': 'ට́',
                'Ú': 'Ա́',
                'è': 'ҽ̀',
                'à': 'ą̀',
                'ò': 'օ̀',
                'ù': 'մ̀',
                'È': 'Ɛ̀',
                'À': 'Ⱥ̀',
                'Ò': 'ට̀',
                'Ù': 'Ա̀',
                'ê': 'ҽ̂',
                'â': 'ą̂',
                'ô': 'օ̂',
                'û': 'մ̂',
                'Ê': 'Ɛ̂',
                'Â': 'Ⱥ̂',
                'Ô': 'ට̂',
                'Û': 'Ա̂'
            }
        },
        'tiny': {
            'init': function() {
                var _0xe6ac0e = _0x50eca3;
                for (i in this[_0xe6ac0e(0x169)]) this[_0xe6ac0e(0x169)][this[_0xe6ac0e(0x169)][i]] = i;
            },
            'encode': function(_0x382b70) {
                var _0x2b75e7 = _0x50eca3,
                    _0x3b0d5b, _0x376700 = '';
                _0x382b70 = _0x382b70['toUpperCase']();
                for (var _0x28fbdc = 0x0, _0xba3b9d = _0x382b70[_0x2b75e7(0x1ab)]; _0xba3b9d > _0x28fbdc; _0x28fbdc++) _0x3b0d5b = this[_0x2b75e7(0x169)][_0x382b70[_0x2b75e7(0x38f)](_0x28fbdc)], _0x2b75e7(0x37c) == typeof _0x3b0d5b && (_0x3b0d5b = _0x382b70[_0x2b75e7(0x38f)](_0x28fbdc)), _0x376700 += _0x3b0d5b;
                return _0x376700;
            },
            'decode': function(_0x594886) {
                var _0xd2ac76 = _0x50eca3;
                for (var _0x51a8a7, _0x46f31e = '', _0xfe8bc1 = 0x0, _0x35a097 = _0x594886[_0xd2ac76(0x1ab)]; _0x35a097 > _0xfe8bc1; _0xfe8bc1++) _0x51a8a7 = this[_0xd2ac76(0x169)][_0x594886[_0xd2ac76(0x38f)](_0xfe8bc1)], _0xd2ac76(0x37c) == typeof _0x51a8a7 && (_0x51a8a7 = _0x594886[_0xd2ac76(0x38f)](_0xfe8bc1)), _0x46f31e += _0x51a8a7;
                return _0x46f31e;
            },
            'map': {
                'A': 'ᴀ',
                'B': 'ʙ',
                'C': 'ᴄ',
                'D': 'ᴅ',
                'E': 'ᴇ',
                'F': 'ꜰ',
                'G': 'ɢ',
                'H': 'ʜ',
                'I': 'ɪ',
                'J': 'ᴊ',
                'K': 'ᴋ',
                'L': 'ʟ',
                'M': 'ᴍ',
                'N': 'ɴ',
                'O': 'ᴏ',
                'P': 'ᴘ',
                'Q': 'Q',
                'R': 'ʀ',
                'S': 'ꜱ',
                'T': 'ᴛ',
                'U': 'ᴜ',
                'V': 'ᴠ',
                'W': 'ᴡ',
                'X': 'x',
                'Y': 'ʏ',
                'Z': 'ᴢ'
            }
        }
    };
    for (i in this['tools']) this[_0x50eca3(0x404)][i][_0x50eca3(0x416)]();
    this[_0x50eca3(0x35b)] = function(_0x5a8ae2) {
        var _0x3ed2a7 = _0x50eca3;
        for (var _0x5f0a61, _0x17c4cb = '', _0x1905cc = !0x0, _0x5c3620 = 0x0, _0x536580 = 0x0, _0x485b18 = 0x0, _0x4b3883 = _0x5a8ae2[_0x3ed2a7(0x1ab)]; _0x4b3883 > _0x485b18; _0x485b18++) _0x5f0a61 = _0x5a8ae2[_0x3ed2a7(0x1)](_0x485b18), 0xa == _0x5f0a61 || 0xd == _0x5f0a61 ? (_0x17c4cb += '<br>\x0a', _0x1905cc = !0x0) : 0x20 == _0x5f0a61 ? _0x1905cc ? (_0x17c4cb += '\x20', _0x1905cc = !0x1) : (_0x17c4cb += '\x20', _0x1905cc = !0x0) : (_0x5f0a61 >= 0xd800 && 0xdbff >= _0x5f0a61 ? (_0x5c3620 = _0x5f0a61, _0x536580 = 0x0) : _0x5c3620 > 0x0 ? (_0x5f0a61 >= 0xdc00 && 0xdfff >= _0x5f0a61 && (_0x536580 = 0x400 * (_0x5c3620 - 0xd800) + (_0x5f0a61 - 0xdc00) + 0x10000), _0x5c3620 = 0x0) : _0x536580 = _0x5f0a61, 0x0 != _0x536580 && (_0x17c4cb += _0x3ed2a7(0x3de) + _0x536580[_0x3ed2a7(0x382)](0x10) + ';', _0x1905cc = !0x0));
        return _0x17c4cb;
    };
}

function cuteText(_0x54a586) {
    var _0xe44d4a = _0xb7847f;
    if (_0x54a586[_0xe44d4a(0x3a6)]() === '') return '';
    qi = -0x1;
    var _0x3eaed5 = boundingString(Math[_0xe44d4a(0x20)](Math[_0xe44d4a(0x505)]() * 0x2) + 0x1);
    return _0x3eaed5 + _0xe44d4a(0x3ba) + _0x54a586[_0xe44d4a(0x25)](/([!?.]+)/gi)[_0xe44d4a(0x169)](cuteSentence)[_0xe44d4a(0x32b)]('') + '\x20\x20🎀\x20\x20' + esrever[_0xe44d4a(0x3be)](_0x3eaed5);
}

function cuteSentence(_0xb511ab) {
    var _0x3b81fa = _0xb7847f;
    return _0xb511ab['split'](/([\s,]+)/gi)[_0x3b81fa(0x169)](cuteWord)['join']('');
}

function cuteWord(_0x28d56c) {
    var _0x48b6f7 = _0xb7847f;
    if (_0x28d56c === '' || /[[!?.\s,]+]/gi [_0x48b6f7(0x31d)](_0x28d56c)) return _0x28d56c;
    return _0x28d56c = roundReplace(_0x28d56c), _0x28d56c = punctReplace(_0x28d56c), _0x28d56c = emojiReplace(_0x28d56c), scriptify(_0x28d56c);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x1c3607) {
    var _0xa1ca2c = _0xb7847f;
    return _0x1c3607['split']('')[_0xa1ca2c(0x169)](function(_0x2078cb) {
        if (_0x2078cb === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x2078cb === '?') return randomElement(['¿', '?']);
            else {
                if (_0x2078cb === '\x22') return quotes();
                else return _0x2078cb;
            }
        }
    })['join']('');
}

function emojiReplace(_0x13acf9) {
    var _0x5c916f = _0xb7847f;
    return _0x13acf9[_0x5c916f(0x31b)](':)', randomElement(emoji[':)']))[_0x5c916f(0x31b)]('(:', randomElement(emoji[':)']))[_0x5c916f(0x31b)]('^^', randomElement(emoji['^^']))[_0x5c916f(0x31b)](':P', randomElement(emoji[':p']))['replace'](':p', randomElement(emoji[':p']))[_0x5c916f(0x31b)](':D', randomElement(emoji[':D']))['replace']('<3', randomElement(emoji['<3']))[_0x5c916f(0x31b)]('(y)', randomElement(emoji[_0x5c916f(0x54)]))[_0x5c916f(0x31b)]('(Y)', randomElement(emoji[_0x5c916f(0x54)]));
}

function roundReplace(_0x67cc6b) {
    var _0x97bc24 = _0xb7847f;
    return _0x67cc6b[_0x97bc24(0x25)]('')['map'](function(_0x75c74c) {
        return _0x75c74c['toLowerCase']() === 'o' || _0x75c74c === '0' ? randomElement(round) : _0x75c74c;
    })[_0x97bc24(0x32b)]('');
}
var emoji = {
        ':)': ['٩(˘◡˘)۶', '(•◡•)', _0xb7847f(0x2e1), _0xb7847f(0x40e), '(｡◕‿◕｡)', _0xb7847f(0x487), _0xb7847f(0x156), '😍', 'ツ', _0xb7847f(0x385), _0xb7847f(0x465), _0xb7847f(0x17), _0xb7847f(0x179), _0xb7847f(0x386), _0xb7847f(0x38c), '(✿╹◡╹)', _0xb7847f(0x2e7)],
        '^^': [_0xb7847f(0x501), _0xb7847f(0x1bc), _0xb7847f(0x384), _0xb7847f(0x389), '(≧◡≦)', _0xb7847f(0x280), '^ㅂ^', _0xb7847f(0x4d5), _0xb7847f(0x43d), '⁀‿⁀', ''],
        ':p': [':Þ', ''],
        ':D': [_0xb7847f(0x43a), '(✿◕ᗜ◕)━♫.*･｡ﾟ', 'ᕕ(ᐛ)ᕗ'],
        '<3': ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'],
        '(y)': ['👍', '👌']
    },
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = ['•?((¯°·._.•\x20', _0xb7847f(0x43c), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', _0xb7847f(0x49), _0xb7847f(0x17f), _0xb7847f(0x1fe), '•]••´º´•»\x20', ']|I{•------»\x20', _0xb7847f(0x53), _0xb7847f(0x496), '(¯`·.¸¸.·´¯`·.¸¸.->\x20', _0xb7847f(0x171), _0xb7847f(0x1a3), _0xb7847f(0x127), _0xb7847f(0x18a), '¸„.-•~¹°”ˆ˜¨\x20', '(¯´•._.•\x20', _0xb7847f(0x192), _0xb7847f(0x4aa), _0xb7847f(0x2d8), _0xb7847f(0x207), _0xb7847f(0xe9), ',-*\x27^\x27~*-.,_,.-*~\x20', _0xb7847f(0x1f7), _0xb7847f(0x520), '¤¸¸.•´¯`•¸¸.•..>>\x20', _0xb7847f(0x1f6), _0xb7847f(0x9b), '๑۞๑,¸¸,ø¤º°`°๑۩\x20', _0xb7847f(0x255), _0xb7847f(0x131), _0xb7847f(0x51c), _0xb7847f(0x1cb), _0xb7847f(0xc8)];

function boundingString(_0x485e9d) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x485e9d);
}

function foodString(_0x4cd108) {
    var _0xeedd84 = _0xb7847f;
    return new Array(_0x4cd108 + 0x1)[_0xeedd84(0x32b)]('0')[_0xeedd84(0x25)]('')[_0xeedd84(0x169)](function(_0x45ad50) {
        return randomElement(food);
    })[_0xeedd84(0x32b)](_0xeedd84(0x4da));
}

function twinkleString(_0x253dc1) {
    var _0x56c128 = _0xb7847f;
    return new Array(_0x253dc1 + 0x1)['join']('0')['split']('')[_0x56c128(0x169)](function() {
        return randomElement(twinkles);
    })[_0x56c128(0x32b)]('');
}

function animalString(_0x38dfab) {
    var _0xec4b57 = _0xb7847f;
    return new Array(_0x38dfab + 0x1)[_0xec4b57(0x32b)]('0')[_0xec4b57(0x25)]('')['map'](function(_0x209010) {
        return randomElement(animals);
    })[_0xec4b57(0x32b)](_0xec4b57(0x4da));
}

function flourishString(_0x3bdca9) {
    return randomElement(flourish);
}

function scriptify(_0x19c44f) {
    var _0x28213c = _0xb7847f,
        _0x5b9dbb = {
            0x0: '𝟢',
            0x1: '𝟣',
            0x2: '𝟤',
            0x3: '𝟥',
            0x4: '𝟦',
            0x5: '𝟧',
            0x6: '𝟨',
            0x7: '𝟩',
            0x8: '𝟪',
            0x9: '𝟫',
            'a': '𝒶',
            'b': '𝒷',
            'c': '𝒸',
            'd': '𝒹',
            'e': '𝑒',
            'f': '𝒻',
            'g': '𝑔',
            'h': '𝒽',
            'i': '𝒾',
            'j': '𝒿',
            'k': '𝓀',
            'l': '𝓁',
            'm': '𝓂',
            'n': '𝓃',
            'o': '𝑜',
            'p': '𝓅',
            'q': '𝓆',
            'r': '𝓇',
            's': '𝓈',
            't': '𝓉',
            'u': '𝓊',
            'v': '𝓋',
            'w': '𝓌',
            'x': '𝓍',
            'y': '𝓎',
            'z': '𝓏',
            'A': '𝒜',
            'B': '𝐵',
            'C': '𝒞',
            'D': '𝒟',
            'E': '𝐸',
            'F': '𝐹',
            'G': '𝒢',
            'H': '𝐻',
            'J': '𝒥',
            'K': '𝒦',
            'I': '𝐼',
            'L': '𝐿',
            'M': '𝑀',
            'N': '𝒩',
            'O': '𝒪',
            'P': '𝒫',
            'Q': '𝒬',
            'R': '𝑅',
            'S': '𝒮',
            'T': '𝒯',
            'U': '𝒰',
            'V': '𝒱',
            'W': '𝒲',
            'X': '𝒳',
            'Y': '𝒴',
            'Z': '𝒵'
        },
        _0x8e0a98 = _0x19c44f[_0x28213c(0x25)]('');
    for (var _0x50bc18 = 0x0; _0x50bc18 < _0x8e0a98[_0x28213c(0x1ab)]; _0x50bc18++) {
        _0x5b9dbb[_0x8e0a98[_0x50bc18]['toLowerCase']()] && (_0x8e0a98[_0x50bc18] = _0x5b9dbb[_0x8e0a98[_0x50bc18]]);
    }
    return _0x19c44f = _0x8e0a98[_0x28213c(0x32b)](''), _0x19c44f;
}

function shuffleArray(_0x39b582) {
    var _0x303db8 = _0xb7847f,
        _0x1d1f22 = _0x39b582[_0x303db8(0x1ab)],
        _0xca0db8, _0x167298;
    while (0x0 !== _0x1d1f22) {
        _0x167298 = Math[_0x303db8(0x20)](Math[_0x303db8(0x505)]() * _0x1d1f22), _0x1d1f22 -= 0x1, _0xca0db8 = _0x39b582[_0x1d1f22], _0x39b582[_0x1d1f22] = _0x39b582[_0x167298], _0x39b582[_0x167298] = _0xca0db8;
    }
    return _0x39b582;
}

function randomElement(_0x451813) {
    var _0x3d17d9 = _0xb7847f;
    return _0x451813[Math[_0x3d17d9(0x20)](Math[_0x3d17d9(0x505)]() * _0x451813[_0x3d17d9(0x1ab)])];
}! function(_0x4d380a) {
    var _0x2743bf = _0xb7847f,
        _0x14ebef = _0x2743bf(0x14e) == typeof exports && exports,
        _0x57722c = _0x2743bf(0x14e) == typeof module && module && module[_0x2743bf(0x493)] == _0x14ebef && module,
        _0x1f1e74 = _0x2743bf(0x14e) == typeof global && global;
    (_0x1f1e74['global'] === _0x1f1e74 || _0x1f1e74[_0x2743bf(0x21e)] === _0x1f1e74) && (_0x4d380a = _0x1f1e74);
    var _0x54f92b = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x3a9961 = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x2bc85d = function(_0x38dbbe) {
            var _0x292882 = _0x2743bf;
            _0x38dbbe = _0x38dbbe[_0x292882(0x31b)](_0x54f92b, function(_0x275a5, _0x1a015f, _0x488d36) {
                return _0x2bc85d(_0x488d36) + _0x1a015f;
            })[_0x292882(0x31b)](_0x3a9961, _0x292882(0x186));
            for (var _0x20f212 = '', _0x51b47b = _0x38dbbe[_0x292882(0x1ab)]; _0x51b47b--;) _0x20f212 += _0x38dbbe[_0x292882(0x38f)](_0x51b47b);
            return _0x20f212;
        },
        _0x5eed33 = {
            'version': _0x2743bf(0x3bb),
            'reverse': _0x2bc85d
        };
    if (_0x2743bf(0xcb) == typeof define && _0x2743bf(0x14e) == typeof define[_0x2743bf(0xb9)] && define['amd']) define(function() {
        return _0x5eed33;
    });
    else {
        if (_0x14ebef && !_0x14ebef[_0x2743bf(0x184)]) {
            if (_0x57722c) _0x57722c['exports'] = _0x5eed33;
            else {
                for (var _0x51a06a in _0x5eed33) _0x5eed33[_0x2743bf(0x4c)](_0x51a06a) && (_0x14ebef[_0x51a06a] = _0x5eed33[_0x51a06a]);
            }
        } else _0x4d380a[_0x2743bf(0x4d)] = _0x5eed33;
    }
}(this);

function fullCrazy(_0x294afe) {
    var _0x11635e = _0xb7847f;
    if (_0x294afe[_0x11635e(0x3a6)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x294afe) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x37906d) {
    var _0x1dcdef = _0xb7847f;
    _0x37906d = _0x37906d[_0x1dcdef(0x25)]('');
    for (var _0x6c29c = 0x0; _0x6c29c < _0x37906d[_0x1dcdef(0x1ab)]; _0x6c29c++) {
        _0x37906d[_0x6c29c] = crazifyCharacter(_0x37906d[_0x6c29c]);
    }
    return _0x37906d[_0x1dcdef(0x32b)]('');
}

function crazifyCharacter(_0x42e223) {
    var _0x3e99fa = _0xb7847f;
    _0x42e223 = _0x42e223[_0x3e99fa(0x2b2)]();
    var _0x47c965 = {
        '&': '⅋',
        '%': ['⅍', '℀', '℁', '℆', '℅'],
        0x0: ['０', 'Ѳ', 'ʘ'],
        0x1: ['➀', '❶', '１'],
        0x2: ['２', '❷', '➁'],
        0x3: ['３', '❸', '➂'],
        0x4: ['４', '❹', '➃'],
        0x5: ['❺', '➄', '５'],
        0x6: ['６', '❻', '➅'],
        0x7: ['７', '❼', '➆'],
        0x8: ['８', '➇', '❽'],
        0x9: ['➈', '❾', '９'],
        '<': ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'],
        '>': '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱',
        '[': _0x3e99fa(0x421),
        ']': _0x3e99fa(0x430),
        '*': _0x3e99fa(0x26),
        'a': ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'],
        'b': ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'],
        'c': ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'],
        'd': ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'],
        'e': ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'],
        'f': ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'],
        'g': ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'],
        'h': ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'],
        'i': ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'],
        'j': ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'],
        'k': ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'],
        'l': ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'],
        'm': ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'],
        'n': ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'],
        'o': ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'],
        'p': ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'],
        'q': ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'],
        'r': ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'],
        's': ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'],
        't': ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'],
        'u': ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'],
        'v': ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'],
        'w': ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'],
        'x': ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'],
        'y': ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'],
        'z': ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ']
    };
    return _0x47c965[_0x42e223] ? randomElement(_0x47c965[_0x42e223]) : _0x42e223;
}

function randomElement(_0x3a2768) {
    var _0x551095 = _0xb7847f;
    return _0x3a2768[Math[_0x551095(0x20)](Math[_0x551095(0x505)]() * _0x3a2768['length'])];
}

function randomSymbols(_0x4a6daf) {
    var _0x8ab1dd = _0xb7847f,
        _0x3598fd = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x1baad9 = [];
    for (var _0x4e3e7b = 0x0; _0x4e3e7b < _0x4a6daf; _0x4e3e7b++) _0x1baad9[_0x8ab1dd(0x3f3)](randomElement(_0x3598fd));
    return _0x1baad9['join']('');
}

function randInt(_0x2f95c0, _0x1efb32) {
    var _0x9fda9b = _0xb7847f;
    return _0x2f95c0 + Math[_0x9fda9b(0x20)](Math[_0x9fda9b(0x505)]() * (_0x1efb32 - _0x2f95c0 + 0x1));
}
$(document)['ready'](function() {
    var _0x536874 = _0xb7847f;
    $(_0x536874(0x470))[_0x536874(0x45b)](_0x536874(0xeb)), $(_0x536874(0x4a4))['on'](_0x536874(0x380), function() {
        var _0xf9f55c = _0x536874;
        $(_0xf9f55c(0x1a1) + $(this)[_0xf9f55c(0x3e2)]() + _0xf9f55c(0x9a))['insertBefore'](_0xf9f55c(0xeb));
    }), _0x4d1e53(default_text), $(_0x536874(0x19e))['on'](_0x536874(0x98), function(_0x3a1fe4) {
        var _0x11afbf = _0x536874;
        if ($('#Sk-text')[_0x11afbf(0x3e2)]() < 0x1) _0x4d1e53(default_text);
        else {
            var _0x1d64a8 = $(_0x11afbf(0x2a7))[_0x11afbf(0x3e2)]();
            _0x4d1e53(_0x1d64a8);
        }
    });
    var _0x1eefc4 = window[_0x536874(0x3da)][_0x536874(0x2e8)],
        _0x2c3b66 = _0x1eefc4[_0x536874(0x25)](_0x536874(0x2dd));
    urltext = _0x2c3b66[0x1];
    urltext && (urltext = decodeURIComponent(urltext), $(_0x536874(0x2a7))[_0x536874(0x3e2)](urltext), _0x4d1e53(urltext));

    function _0x4d1e53(_0x3b266c) {
        var _0x1d8252 = _0x536874;
        _0x3b266c = _0x3b266c[_0x1d8252(0x3a6)](), $('.result-s1')[_0x1d8252(0x457)](Change(_0x3b266c, 's1')), $(_0x1d8252(0x437))[_0x1d8252(0x457)](Change(_0x3b266c, 's2')), $(_0x1d8252(0x48b))[_0x1d8252(0x457)](Change(_0x3b266c, 's3')), $(_0x1d8252(0x11b))[_0x1d8252(0x457)](Change(_0x3b266c, 's4')), $(_0x1d8252(0x27b))[_0x1d8252(0x457)](Change(_0x3b266c, 's5')), $(_0x1d8252(0xa1))[_0x1d8252(0x457)](Change(_0x3b266c, 's6')), $(_0x1d8252(0x29e))['html'](Change(_0x3b266c, 's7')), $(_0x1d8252(0x332))[_0x1d8252(0x457)](Change(_0x3b266c, 's8')), $(_0x1d8252(0x4f3))['html'](Change(_0x3b266c, 's9')), $(_0x1d8252(0x506))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x16e))), $('.result-s11')[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x350))), $(_0x1d8252(0x1d5))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x2a0))), $(_0x1d8252(0x355))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x2c8))), $(_0x1d8252(0x498))[_0x1d8252(0x457)](Change(_0x3b266c, 's14')), $('.result-s15')[_0x1d8252(0x457)](Change(_0x3b266c, 's15')), $(_0x1d8252(0x200))[_0x1d8252(0x457)](Change(_0x3b266c, 's16')), $(_0x1d8252(0x1f))['html'](Change(_0x3b266c, _0x1d8252(0x71))), $(_0x1d8252(0xf7))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x4df))), $(_0x1d8252(0x3fc))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x2b5))), $('.result-s20')[_0x1d8252(0x457)](Change(_0x3b266c, 's20')), $(_0x1d8252(0x15d))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x5d))), $(_0x1d8252(0x4d9))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x3fa))), $(_0x1d8252(0x1cf))['html'](Change(_0x3b266c, 's23')), $(_0x1d8252(0x2de))[_0x1d8252(0x457)](Change(_0x3b266c, _0x1d8252(0x17e))), $('.result-s25')['html'](Change(_0x3b266c, _0x1d8252(0x468))), $('.result-s26')['html'](Change(_0x3b266c, _0x1d8252(0x3e1))), $('.result-s27')[_0x1d8252(0x457)](Change(_0x3b266c, 's27')), $(_0x1d8252(0x252))['html'](Change(_0x3b266c, _0x1d8252(0x128))), $(_0x1d8252(0x1de))['html'](Change(_0x3b266c, _0x1d8252(0x41f))), $(_0x1d8252(0xd0))['html'](Change(_0x3b266c, _0x1d8252(0x4af))), $(_0x1d8252(0x162))[_0x1d8252(0x457)](luni[_0x1d8252(0x404)][_0x1d8252(0x400)]['encode'](_0x3b266c)), $(_0x1d8252(0x46f))['html'](applyCharMap(invertedSquaresCharMap, _0x3b266c)), $('.illuminati')[_0x1d8252(0x457)](illuminati(_0x3b266c)), $(_0x1d8252(0x30d))[_0x1d8252(0x457)](textgun(_0x3b266c)), $('.minigame')['html'](minigame(_0x3b266c)), $(_0x1d8252(0x226))[_0x1d8252(0x457)](pubggame1(_0x3b266c)), $(_0x1d8252(0x3c9))[_0x1d8252(0x457)](pubggame2(_0x3b266c)), $(_0x1d8252(0x276))[_0x1d8252(0x457)](pubggame3(_0x3b266c)), $(_0x1d8252(0x250))['html'](bricks(_0x3b266c)), $(_0x1d8252(0x4d1))[_0x1d8252(0x457)](bigrus(_0x3b266c)), $(_0x1d8252(0x44))[_0x1d8252(0x457)](applyCharMap(wideTextCharMap, _0x3b266c)), $(_0x1d8252(0x8e))['html'](luni[_0x1d8252(0x404)][_0x1d8252(0x3f2)][_0x1d8252(0x2e6)](_0x3b266c)), $(_0x1d8252(0x410))['html'](luni['tools'][_0x1d8252(0x367)][_0x1d8252(0x2e6)](_0x3b266c)), $(_0x1d8252(0x52))[_0x1d8252(0x457)](applyCharMap(squaresCharMap, _0x3b266c)), $('.lunitoolsmirrorencode')['html'](luni['tools'][_0x1d8252(0x56)][_0x1d8252(0x2e6)](_0x3b266c)), $(_0x1d8252(0x22f))['html'](applyCharMap(subscriptCharMap, _0x3b266c)), $(_0x1d8252(0x370))[_0x1d8252(0x457)](applyCharMap(superscriptCharMap, _0x3b266c)), $('.bentTextCharMap')[_0x1d8252(0x457)](applyCharMap(bentTextCharMap, _0x3b266c)), $('.neonCharMap')['html'](applyCharMap(neonCharMap, _0x3b266c)), $(_0x1d8252(0x35f))[_0x1d8252(0x457)](applyCharMap(futureAlienCharMap, _0x3b266c)), $(_0x1d8252(0x383))[_0x1d8252(0x457)](strikeThrough(_0x3b266c)), $(_0x1d8252(0x43b))['html'](tildeStrikeThrough(_0x3b266c)), $('.slashThrough')[_0x1d8252(0x457)](slashThrough(_0x3b266c)), $(_0x1d8252(0xe6))[_0x1d8252(0x457)](underline(_0x3b266c)), $(_0x1d8252(0xce))[_0x1d8252(0x457)](doubleUnderline(_0x3b266c)), $(_0x1d8252(0x264))[_0x1d8252(0x457)](luni[_0x1d8252(0x404)][_0x1d8252(0x31c)][_0x1d8252(0x2e6)](_0x3b266c)), $(_0x1d8252(0x316))['html'](applyCharMap(squiggleCharMap, _0x3b266c)), $('.squiggle2CharMap')[_0x1d8252(0x457)](applyCharMap(squiggle2CharMap, _0x3b266c)), $(_0x1d8252(0x4c0))[_0x1d8252(0x457)](applyCharMap(squiggle3CharMap, _0x3b266c)), $(_0x1d8252(0x22))[_0x1d8252(0x457)](applyCharMap(squiggle4CharMap, _0x3b266c)), $('.squiggle5CharMap')[_0x1d8252(0x457)](applyCharMap(squiggle5CharMap, _0x3b266c)), $(_0x1d8252(0x4d0))[_0x1d8252(0x457)](applyCharMap(squiggle6CharMap, _0x3b266c)), $(_0x1d8252(0x50b))['html'](applyCharMap(boldCharMap, _0x3b266c)), $('.luniroundsquares')[_0x1d8252(0x457)](luni['tools'][_0x1d8252(0x3ff)]['encode'](_0x3b266c)), $(_0x1d8252(0x1e1))[_0x1d8252(0x457)](luni[_0x1d8252(0x404)]['squares']['encode'](_0x3b266c[_0x1d8252(0x3b6)]())), $(_0x1d8252(0x27e))[_0x1d8252(0x457)](applyCharMap(oldEnglishCharMap, _0x3b266c)), $(_0x1d8252(0xb4))[_0x1d8252(0x457)](applyCharMap(medievalCharMap, _0x3b266c)), $(_0x1d8252(0x4a))['html'](applyCharMap(cursiveCharMap, _0x3b266c)), $('.scriptify')[_0x1d8252(0x457)](scriptify(_0x3b266c)), $('.doubleStruckCharMap')['html'](applyCharMap(doubleStruckCharMap, _0x3b266c)), $(_0x1d8252(0x40))['html'](applyCharMap(italicCharMap, _0x3b266c)), $(_0x1d8252(0x34))[_0x1d8252(0x457)](applyCharMap(boldItalicCharMap, _0x3b266c)), $(_0x1d8252(0x2f3))[_0x1d8252(0x457)](applyCharMap(monospaceCharMap, _0x3b266c)), $(_0x1d8252(0x353))[_0x1d8252(0x457)](applyCharMap(upperAnglesCharMap, _0x3b266c)), $(_0x1d8252(0x7a))[_0x1d8252(0x457)](applyCharMap(greekCharMap, _0x3b266c)), $(_0x1d8252(0x30f))[_0x1d8252(0x457)](applyCharMap(symbolsCharMap, _0x3b266c)), $(_0x1d8252(0x17a))['html'](applyCharMap(currencyCharMap, _0x3b266c)), $(_0x1d8252(0x10e))['html'](applyCharMap(asianStyleCharMap, _0x3b266c)), $(_0x1d8252(0x397))[_0x1d8252(0x457)](applyCharMap(asianStyle2CharMap, _0x3b266c)), $(_0x1d8252(0x1b))['html'](thickBlockFramed(_0x3b266c)), $('.diametricAngleFrame')[_0x1d8252(0x457)](diametricAngleFrame(_0x3b266c)), $(_0x1d8252(0x108))[_0x1d8252(0x457)](wavyJoiner(_0x3b266c)), $('.dottyJoiner')[_0x1d8252(0x457)](dottyJoiner(_0x3b266c)), $(_0x1d8252(0x230))[_0x1d8252(0x457)](kirbyHug(_0x3b266c)), $(_0x1d8252(0x497))[_0x1d8252(0x457)](vaporwaveText(_0x3b266c)), $('.vaporwaveText1')[_0x1d8252(0x457)](vaporwaveText1(_0x3b266c)), $('.vaporwaveText2')['html'](vaporwaveText2(_0x3b266c)), $('.littleSparkles')[_0x1d8252(0x457)](littleSparkles(_0x3b266c)), $('.weirdBox')[_0x1d8252(0x457)](weirdBox(_0x3b266c)), $(_0x1d8252(0x377))[_0x1d8252(0x457)](thickBox(_0x3b266c)), $('.zigzagJoiner')[_0x1d8252(0x457)](zigzagJoiner(_0x3b266c)), $(_0x1d8252(0x28e))[_0x1d8252(0x457)](hashJoiner(_0x3b266c)), $(_0x1d8252(0x4fa))[_0x1d8252(0x457)](starJoiner(_0x3b266c)), $('.connectedJoiner')['html'](connectedJoiner(_0x3b266c)), $('.arrowjoin')[_0x1d8252(0x457)](arrowjoin(_0x3b266c)), $('.dotBoxtwo')['html'](dotBoxtwo(_0x3b266c)), $(_0x1d8252(0x307))[_0x1d8252(0x457)](dotBox(_0x3b266c)), $(_0x1d8252(0xd9))[_0x1d8252(0x457)](diametricBox(_0x3b266c)), $(_0x1d8252(0x2ec))['html'](arrowBox(_0x3b266c)), $(_0x1d8252(0x1e2))['html'](curlybrackets(_0x3b266c)), $(_0x1d8252(0x4ee))[_0x1d8252(0x457)](singlewavyJoiner(_0x3b266c)), $(_0x1d8252(0x1ae))['html'](firework(_0x3b266c)), $(_0x1d8252(0x2f6))[_0x1d8252(0x457)](stinky(_0x3b266c)), $('.heartsBetween')[_0x1d8252(0x457)](heartsBetween(_0x3b266c)), $(_0x1d8252(0x16))[_0x1d8252(0x457)](arrowBelow(_0x3b266c)), $(_0x1d8252(0x4e))[_0x1d8252(0x457)](crossAboveBelow(_0x3b266c)), $('.wingdings')[_0x1d8252(0x457)](wingdings(_0x3b266c)), $(_0x1d8252(0x148))[_0x1d8252(0x457)](fullCrazy(_0x3b266c)), $('.crazyWithFlourishOrSymbols')[_0x1d8252(0x457)](crazyWithFlourishOrSymbols(_0x3b266c)), $('.cuteText')[_0x1d8252(0x457)](cuteText(_0x3b266c)), $(_0x1d8252(0x440))[_0x1d8252(0x457)](star0(_0x3b266c)), $('.star1')['html'](star1(_0x3b266c)), $(_0x1d8252(0x4c4))[_0x1d8252(0x457)](star2(_0x3b266c)), $('.star3')[_0x1d8252(0x457)](star3(_0x3b266c)), $(_0x1d8252(0x3c3))['html'](star4(_0x3b266c)), $(_0x1d8252(0x47d))[_0x1d8252(0x457)](star5(_0x3b266c)), $(_0x1d8252(0x34b))['html'](star6(_0x3b266c)), $(_0x1d8252(0x323))[_0x1d8252(0x457)](star7(_0x3b266c)), $(_0x1d8252(0x88))['html'](star8(_0x3b266c)), $('.star9')[_0x1d8252(0x457)](star9(_0x3b266c)), $(_0x1d8252(0x359))[_0x1d8252(0x457)](star10(_0x3b266c)), $('.heart0')['html'](heart0(_0x3b266c)), $(_0x1d8252(0x6e))[_0x1d8252(0x457)](heart1(_0x3b266c)), $(_0x1d8252(0x369))[_0x1d8252(0x457)](heart2(_0x3b266c)), $(_0x1d8252(0x330))[_0x1d8252(0x457)](heart3(_0x3b266c)), $('.heart4')[_0x1d8252(0x457)](heart4(_0x3b266c)), $(_0x1d8252(0x27a))[_0x1d8252(0x457)](heart5(_0x3b266c)), $('.heart6')[_0x1d8252(0x457)](heart6(_0x3b266c)), $(_0x1d8252(0x364))[_0x1d8252(0x457)](heart7(_0x3b266c)), $(_0x1d8252(0x48d))[_0x1d8252(0x457)](emoticon0(_0x3b266c)), $('.emoticon1')[_0x1d8252(0x457)](emoticon1(_0x3b266c)), $(_0x1d8252(0xf2))[_0x1d8252(0x457)](emoticon2(_0x3b266c)), $(_0x1d8252(0x303))[_0x1d8252(0x457)](emoticon3(_0x3b266c)), $('.emoticon4')[_0x1d8252(0x457)](emoticon4(_0x3b266c)), $(_0x1d8252(0x214))[_0x1d8252(0x457)](emoticon5(_0x3b266c)), $(_0x1d8252(0x467))[_0x1d8252(0x457)](emoticon6(_0x3b266c)), $(_0x1d8252(0xbb))[_0x1d8252(0x457)](emoticon7(_0x3b266c)), $(_0x1d8252(0x406))[_0x1d8252(0x457)](thankyou0(_0x3b266c)), $(_0x1d8252(0x2c5))[_0x1d8252(0x457)](thankyou1(_0x3b266c)), $(_0x1d8252(0xcf))[_0x1d8252(0x457)](thankyou2(_0x3b266c)), $(_0x1d8252(0x3ca))['html'](thankyou3(_0x3b266c)), $(_0x1d8252(0x44b))[_0x1d8252(0x457)](thankyou4(_0x3b266c)), $('.thankyou5')[_0x1d8252(0x457)](thankyou5(_0x3b266c)), $(_0x1d8252(0x40d))['html'](thankyou6(_0x3b266c)), $(_0x1d8252(0x60))[_0x1d8252(0x457)](thankyou7(_0x3b266c)), $(_0x1d8252(0x174))[_0x1d8252(0x457)](sad0(_0x3b266c)), $(_0x1d8252(0xd1))[_0x1d8252(0x457)](sad1(_0x3b266c)), $(_0x1d8252(0x500))['html'](sad2(_0x3b266c)), $(_0x1d8252(0x357))[_0x1d8252(0x457)](sad3(_0x3b266c)), $(_0x1d8252(0x87))[_0x1d8252(0x457)](sad4(_0x3b266c)), $(_0x1d8252(0x55))[_0x1d8252(0x457)](sad5(_0x3b266c)), $(_0x1d8252(0x30b))[_0x1d8252(0x457)](sad6(_0x3b266c)), $(_0x1d8252(0x80))['html'](sad7(_0x3b266c)), $(_0x1d8252(0x407))[_0x1d8252(0x457)](cuteText1(_0x3b266c)), $(_0x1d8252(0x522))[_0x1d8252(0x457)](cuteText2(_0x3b266c)), $(_0x1d8252(0x2f7))[_0x1d8252(0x457)](cuteText3(_0x3b266c)), $(_0x1d8252(0x29f))['html'](cuteText4(_0x3b266c)), $(_0x1d8252(0x524))[_0x1d8252(0x457)](cuteText5(_0x3b266c)), $(_0x1d8252(0x453))[_0x1d8252(0x457)](crazyWithFlourishOrSymbols1(_0x3b266c)), $(_0x1d8252(0x2fa))[_0x1d8252(0x457)](crazyWithFlourishOrSymbols2(_0x3b266c)), $(_0x1d8252(0x5))[_0x1d8252(0x457)](crazyWithFlourishOrSymbols3(_0x3b266c)), $(_0x1d8252(0x107))[_0x1d8252(0x457)](crazyWithFlourishOrSymbols4(_0x3b266c)), $(_0x1d8252(0x1e3))[_0x1d8252(0x457)](crazyWithFlourishOrSymbols5(_0x3b266c)), $(_0x1d8252(0xff))[_0x1d8252(0x457)](fullCrazy1(_0x3b266c)), $(_0x1d8252(0x18b))[_0x1d8252(0x457)](fullCrazy2(_0x3b266c)), $(_0x1d8252(0x26b))[_0x1d8252(0x457)](fullCrazy3(_0x3b266c)), $(_0x1d8252(0x74))[_0x1d8252(0x457)](fullCrazy4(_0x3b266c)), $(_0x1d8252(0x29d))[_0x1d8252(0x457)](fullCrazy5(_0x3b266c)), $(_0x1d8252(0x23e))[_0x1d8252(0x457)](wrap1(_0x3b266c)), $('.wrap2')[_0x1d8252(0x457)](wrap2(_0x3b266c)), $(_0x1d8252(0x203))[_0x1d8252(0x457)](wrap3(_0x3b266c)), $(_0x1d8252(0x15))[_0x1d8252(0x457)](wrap4(_0x3b266c)), $(_0x1d8252(0x9d))[_0x1d8252(0x457)](wrap5(_0x3b266c));
    }
    $(_0x536874(0x9))[_0x536874(0x139)](function() {
        var _0x5ec3dc = _0x536874;
        $(_0x5ec3dc(0x2a7))[_0x5ec3dc(0x3e2)]('');
    });

    function _0x23b579() {
        var _0x37bf4b = _0x536874,
            _0x22b4c2 = document[_0x37bf4b(0xb)]('.copied'),
            _0x53eedd = _0x22b4c2[_0x37bf4b(0xb)](_0x37bf4b(0x2c));
        document[_0x37bf4b(0x3d9)](_0x37bf4b(0x2c1))[_0x37bf4b(0x223)](_0x498ac7 => {
            var _0x47a126 = _0x37bf4b;
            _0x498ac7['addEventListener'](_0x47a126(0x139), () => {
                var _0x2dad2e = _0x47a126;
                _0x53eedd[_0x2dad2e(0x50f)] = _0x498ac7[_0x2dad2e(0xb)]('p')[_0x2dad2e(0x40a)], _0x20ee27(_0x53eedd), _0x22b4c2[_0x2dad2e(0x315)][_0x2dad2e(0x31f)]('copied-show'), setTimeout(() => {
                    var _0x722611 = _0x2dad2e;
                    _0x22b4c2[_0x722611(0x315)][_0x722611(0x52a)]('copied-show');
                }, 0x3e8);
            });
        });
    }
    _0x23b579();

    function _0x20ee27(_0x3c8d5b) {
        var _0x352468 = _0x536874,
            _0x2d7872 = document[_0x352468(0x40f)](_0x352468(0x362));
        _0x2d7872['value'] = _0x3c8d5b[_0x352468(0x40a)] || _0x3c8d5b[_0x352468(0x50f)], document['body'][_0x352468(0xea)](_0x2d7872), _0x2d7872[_0x352468(0x153)](), document[_0x352468(0xa2)]('copy'), _0x2d7872[_0x352468(0x52a)]();
    }
});
