var _0xf5fb9b = _0x2eac,
    _0xb93980 = (function() {
        var _0x5acb7b = !![];
        return function(_0x112c32, _0x5876e0) {
            var _0x2d999e = _0x5acb7b ? function() {
                var _0xf38599 = _0x2eac;
                if (_0x5876e0) {
                    var _0x654653 = _0x5876e0[_0xf38599(0x473)](_0x112c32, arguments);
                    return _0x5876e0 = null, _0x654653;
                }
            } : function() {};
            return _0x5acb7b = ![], _0x2d999e;
        };
    }()),
    _0x49c6b3 = _0xb93980(this, function() {
        var _0x1c6108 = _0x2eac,
            _0x4a98a3;
        try {
            var _0x18515f = Function(_0x1c6108(0x40a) + _0x1c6108(0x403) + ');');
            _0x4a98a3 = _0x18515f();
        } catch (_0x5ae3d0) {
            _0x4a98a3 = window;
        }
        var _0x550cc7 = _0x4a98a3['console'] = _0x4a98a3[_0x1c6108(0x1fd)] || {},
            _0x4d871f = ['log', _0x1c6108(0x23b), _0x1c6108(0x14b), _0x1c6108(0x2ea), _0x1c6108(0x32f), _0x1c6108(0xf7), _0x1c6108(0x481)];
        for (var _0x2d2c66 = 0x0; _0x2d2c66 < _0x4d871f[_0x1c6108(0x230)]; _0x2d2c66++) {
            var _0x5eeed2 = _0xb93980['constructor'][_0x1c6108(0x349)]['bind'](_0xb93980),
                _0x16d223 = _0x4d871f[_0x2d2c66],
                _0x1bfd5c = _0x550cc7[_0x16d223] || _0x5eeed2;
            _0x5eeed2[_0x1c6108(0xec)] = _0xb93980[_0x1c6108(0x4d8)](_0xb93980), _0x5eeed2[_0x1c6108(0x13e)] = _0x1bfd5c[_0x1c6108(0x13e)]['bind'](_0x1bfd5c), _0x550cc7[_0x16d223] = _0x5eeed2;
        }
    });
_0x49c6b3();
var normal = _0xf5fb9b(0x45a),
    default_text = _0xf5fb9b(0x390);

function applyCharMap(_0x3a4312, _0x8b0669) {
    var _0x3ee360 = _0xf5fb9b;
    let _0x2c7c5b = '';
    for (let _0x1d5912 of _0x8b0669[_0x3ee360(0x1c0)]('')) {
        if (_0x3a4312[_0x1d5912] !== undefined) _0x2c7c5b += _0x3a4312[_0x1d5912];
        else {
            if (_0x3a4312[_0x1d5912[_0x3ee360(0x1f7)]()] !== undefined) _0x2c7c5b += _0x3a4312[_0x1d5912[_0x3ee360(0x1f7)]()];
            else _0x2c7c5b += _0x1d5912;
        }
    }
    return _0x2c7c5b;
}

function invertedSquaresCharMapFun(_0x30e008) {
    return applyCharMap(invertedSquaresCharMap, _0x30e008);
}

function wideTextCharMapFun(_0x35c733) {
    return applyCharMap(wideTextCharMap, _0x35c733);
}

function squaresCharMapFun(_0x2cd60d) {
    return applyCharMap(squaresCharMap, _0x2cd60d);
}

function subscriptCharMapFun(_0x417d75) {
    return applyCharMap(subscriptCharMap, _0x417d75);
}

function bentTextCharMapFun(_0x302457) {
    return applyCharMap(bentTextCharMap, _0x302457);
}

function neonCharMapFun(_0x3d7595) {
    return applyCharMap(neonCharMap, _0x3d7595);
}

function futureAlienCharMapFun(_0x6783b0) {
    return applyCharMap(futureAlienCharMap, _0x6783b0);
}

function squiggleCharMapFun(_0x2eb48d) {
    return applyCharMap(squiggleCharMap, _0x2eb48d);
}

function squiggle2CharMapFun(_0x2c616b) {
    return applyCharMap(squiggle2CharMap, _0x2c616b);
}

function squiggle3CharMapFun(_0x168d33) {
    return applyCharMap(squiggle3CharMap, _0x168d33);
}

function squiggle4CharMapFun(_0x41bc59) {
    return applyCharMap(squiggle4CharMap, _0x41bc59);
}

function squiggle5CharMapFun(_0x5b4cda) {
    return applyCharMap(squiggle5CharMap, _0x5b4cda);
}

function squiggle6CharMapFun(_0xa51417) {
    return applyCharMap(squiggle6CharMap, _0xa51417);
}

function boldCharMapFun(_0x7acd21) {
    return applyCharMap(boldCharMap, _0x7acd21);
}

function oldEnglishCharMapFun(_0x12ab75) {
    return applyCharMap(oldEnglishCharMap, _0x12ab75);
}

function medievalCharMapFun(_0x5df231) {
    return applyCharMap(medievalCharMap, _0x5df231);
}

function cursiveCharMapFun(_0xd9ec7c) {
    return applyCharMap(cursiveCharMap, _0xd9ec7c);
}

function doubleStruckCharMapFun(_0x4bf3e5) {
    return applyCharMap(doubleStruckCharMap, _0x4bf3e5);
}

function _0x2eac(_0x358136, _0x49c6b3) {
    var _0xb93980 = _0x3b3b();
    return _0x2eac = function(_0xe0c3f1, _0x3b3b82) {
        _0xe0c3f1 = _0xe0c3f1 - 0x0;
        var _0x2eac49 = _0xb93980[_0xe0c3f1];
        return _0x2eac49;
    }, _0x2eac(_0x358136, _0x49c6b3);
}

function italicCharMapFun(_0x18b7ac) {
    return applyCharMap(italicCharMap, _0x18b7ac);
}

function boldItalicCharMapFun(_0x2da68f) {
    return applyCharMap(boldItalicCharMap, _0x2da68f);
}

function monospaceCharMapFun(_0x34584a) {
    return applyCharMap(monospaceCharMap, _0x34584a);
}

function upperAnglesCharMapFun(_0x44693e) {
    return applyCharMap(upperAnglesCharMap, _0x44693e);
}

function greekCharMapFun(_0xcfb6ac) {
    return applyCharMap(greekCharMap, _0xcfb6ac);
}

function symbolsCharMapFun(_0x5051d8) {
    return applyCharMap(symbolsCharMap, _0x5051d8);
}

function currencyCharMapFun(_0x127603) {
    return applyCharMap(currencyCharMap, _0x127603);
}

function asianStyleCharMapFun(_0x3fe3dc) {
    return applyCharMap(asianStyleCharMap, _0x3fe3dc);
}

function asianStyle2CharMapFun(_0x247262) {
    return applyCharMap(asianStyle2CharMap, _0x247262);
}
var luni = new Lunicode();
luni[_0xf5fb9b(0x458)]['creepify'][_0xf5fb9b(0x46a)][_0xf5fb9b(0x85)] = 0xa;

function crazyWithFlourishOrSymbols(_0x29c91a) {
    var _0xaef7ab = _0xf5fb9b;
    if (Math[_0xaef7ab(0x267)]() < 0.7) return wrapInSymbols(crazifyText(_0x29c91a), 0x2);
    else return wrapInFlourish(crazifyText(_0x29c91a), 0x2);
}

function illuminati(_0x4279db) {
    var _0x25ed99 = _0xf5fb9b;
    return applyCharMap(squiggle5CharMap, _0x25ed99(0x39a) + _0x4279db + '𒆜꧂');
}

function textgun(_0x372242) {
    var _0x10b3c7 = _0xf5fb9b;
    return _0x10b3c7(0x330) + _0x372242[_0x10b3c7(0x1c0)]('')['join'](_0x10b3c7(0x3ab)) + _0x10b3c7(0x22e);
}

function minigame(_0x697d0b) {
    var _0x34ba78 = _0xf5fb9b;
    return _0x34ba78(0x166) + luni[_0x34ba78(0x458)]['tiny']['encode'](_0x697d0b) + _0x34ba78(0x17b);
}

function pubggame1(_0x2f3978) {
    return applyCharMap(cursiveCharMap, '༒☬' + _0x2f3978 + '☬༒');
}

function pubggame2(_0x561dff) {
    var _0x79242b = _0xf5fb9b;
    return applyCharMap(monospaceCharMap, _0x79242b(0x491) + _0x561dff + _0x79242b(0x226));
}

function pubggame3(_0x32ecd0) {
    var _0x472469 = _0xf5fb9b;
    return applyCharMap(invertedSquaresCharMap, _0x472469(0x83) + _0x32ecd0 + _0x472469(0x2e1));
}

function bricks(_0x112e68) {
    return applyCharMap(doubleStruckCharMap, 'ღ⊱♥' + _0x112e68 + '♥⊱ღ');
}

function bigrus(_0x3d95bd) {
    return applyCharMap(boldItalicCharMap, '٭ᶦᶰᵈ᭄' + _0x3d95bd + '♥࿐٭');
}

function strikeThrough(_0xfa311f) {
    var _0x2d0d70 = _0xf5fb9b;
    return _0xfa311f[_0x2d0d70(0x1c0)]('')[_0x2d0d70(0x5c)]('̶') + '̶';
}

function tildeStrikeThrough(_0x31b5eb) {
    var _0x17e42d = _0xf5fb9b;
    return _0x31b5eb[_0x17e42d(0x1c0)]('')[_0x17e42d(0x5c)]('̴') + '̴';
}

function underline(_0x4dd0c9) {
    var _0x1938e8 = _0xf5fb9b;
    return _0x4dd0c9[_0x1938e8(0x1c0)]('')[_0x1938e8(0x5c)]('̲') + '̲';
}

function doubleUnderline(_0x76152c) {
    var _0x1bdd2e = _0xf5fb9b;
    return _0x76152c[_0x1bdd2e(0x1c0)]('')[_0x1bdd2e(0x5c)]('̳') + '̳';
}

function slashThrough(_0x4f077e) {
    var _0x46bb6b = _0xf5fb9b;
    return _0x4f077e[_0x46bb6b(0x1c0)]('')['join']('̷') + '̷';
}

function stinky(_0x3fa861) {
    return _0x3fa861['split']('')['join']('̾') + '̾';
}

function heartsBetween(_0x3a090a) {
    var _0x59b897 = _0xf5fb9b;
    return _0x3a090a[_0x59b897(0x1c0)]('')[_0x59b897(0x5c)]('♥');
}

function arrowBelow(_0x1401de) {
    var _0x307706 = _0xf5fb9b;
    return _0x1401de[_0x307706(0x1c0)]('')['join']('͎') + '͎';
}

function crossAboveBelow(_0x1fd6d9) {
    var _0x377718 = _0xf5fb9b;
    return _0x1fd6d9[_0x377718(0x1c0)]('')[_0x377718(0x5c)]('͓̽') + '͓̽';
}
const wingdingsCharMap = {
    0x0: _0xf5fb9b(0x3af),
    0x1: _0xf5fb9b(0x1c1),
    0x2: _0xf5fb9b(0x4f7),
    0x3: '🗏︎',
    0x4: '🗐︎',
    0x5: _0xf5fb9b(0x4bf),
    0x6: '⌛︎',
    0x7: _0xf5fb9b(0x494),
    0x8: _0xf5fb9b(0x11f),
    0x9: _0xf5fb9b(0x9),
    '!': '✏︎',
    '\x22': '✂︎',
    '#': '✁︎',
    '$': _0xf5fb9b(0xf6),
    '%': _0xf5fb9b(0x22d),
    '&': _0xf5fb9b(0x1a6),
    '\x27': _0xf5fb9b(0x142),
    '(': '🕿︎',
    ')': '✆︎',
    '*': _0xf5fb9b(0x466),
    '+': _0xf5fb9b(0x468),
    ',': _0xf5fb9b(0x354),
    '-': _0xf5fb9b(0x1bb),
    '.': '📬︎',
    '/': _0xf5fb9b(0x3ba),
    ':': _0xf5fb9b(0x84),
    ';': '🖴︎',
    '<': _0xf5fb9b(0x158),
    '=': _0xf5fb9b(0x263),
    '>': '✇︎',
    '?': '✍︎',
    'A': '✌︎',
    'B': '👌︎',
    'C': _0xf5fb9b(0x1b3),
    'D': _0xf5fb9b(0x141),
    'E': '☜︎',
    'F': '☞︎',
    'G': '☝︎',
    'H': '☟︎',
    'I': '✋︎',
    'J': '☺︎',
    'K': '😐︎',
    'L': '☹︎',
    'M': _0xf5fb9b(0x4ab),
    'N': '☠︎',
    'O': '⚐︎',
    'P': _0xf5fb9b(0x1d9),
    'Q': '✈︎',
    'R': '☼︎',
    'S': _0xf5fb9b(0x26d),
    'T': '❄︎',
    'U': _0xf5fb9b(0x504),
    'V': '✞︎',
    'W': _0xf5fb9b(0x3b3),
    'X': '✠︎',
    'Y': '✡︎',
    'Z': '☪︎',
    '[': '☯︎',
    '\x5c': 'ॐ︎',
    ']': '☸︎',
    '^': '♈︎',
    '_': '♉︎',
    '`': '♊︎',
    'a': '♋︎',
    'b': '♌︎',
    'c': '♍︎',
    'd': '♎︎',
    'e': '♏︎',
    'f': '♐︎',
    'g': '♑︎',
    'h': '♒︎',
    'i': '♓︎',
    'j': '🙰',
    'k': '🙵',
    'l': '●︎',
    'm': '❍︎',
    'n': '■︎',
    'o': '□︎',
    'p': '◻︎',
    'q': '❑︎',
    'r': '❒︎',
    's': '⬧︎',
    't': '⧫︎',
    'u': '◆︎',
    'v': '❖︎',
    'w': '⬥︎',
    'x': '⌧︎',
    'y': '⍓︎',
    'z': '⌘︎',
    '{': '❀︎',
    '|': '✿︎',
    '}': '❝︎',
    '~': '❞︎',
    '\x20': '▯︎',
    '€': '⓪︎',
    '\x20': '①︎',
    '‚': '②︎',
    'ƒ': '③︎',
    '„': '④︎',
    '…': '⑤︎',
    '†': '⑥︎',
    '‡': '⑦︎',
    'ˆ': '⑧︎',
    '‰': '⑨︎',
    'Š': '⑩︎',
    '‹': '⓿︎',
    'Œ': '❶︎',
    '\x20': '❷︎',
    'Ž': '❸︎',
    '\x20': '❹︎',
    '\x20': '❺︎',
    '‘': '❻︎',
    '’': '❼︎',
    '“': '❽︎',
    '”': '❾︎',
    '•': '❿︎',
    '–': '◻︎',
    '—': '◻︎',
    '˜': '◻︎',
    '™': '◻︎',
    'š': '◻︎',
    '›': '◻︎',
    'œ': '◻︎',
    '\x20': '◻︎',
    'ž': '·︎',
    'Ÿ': '•︎',
    '¡': '○︎',
    '¢': '⭕︎',
    '£': '◻︎',
    '¤': '◉︎',
    '¥': '◎︎',
    '¦': '◻︎',
    '§': '▪︎',
    '¨': '◻︎',
    '©': '◻︎',
    'ª': '✦︎',
    '«': '★︎',
    '¬': '✶︎',
    '®': '✹︎',
    '¯': '✵︎',
    '°': '◻︎',
    '±': '⌖︎',
    '²': '⟡︎',
    '³': '⌑︎',
    '´': '◻︎',
    'µ': '✪︎',
    '¶': '✰︎',
    '·': _0xf5fb9b(0x48b),
    '¸': _0xf5fb9b(0x1),
    '¹': _0xf5fb9b(0x209),
    'º': _0xf5fb9b(0x67),
    '»': _0xf5fb9b(0x383),
    '¼': '🕕︎',
    '½': '🕖︎',
    '¾': _0xf5fb9b(0x45b),
    '¿': _0xf5fb9b(0x5),
    'À': _0xf5fb9b(0x1ec),
    'Á': _0xf5fb9b(0xc3),
    'Â': '🕛︎',
    'Ã': '◻︎',
    'Ä': '◻︎',
    'Å': '◻︎',
    'Æ': '◻︎',
    'Ç': '◻︎',
    'È': '◻︎',
    'É': '◻︎',
    'Ê': '◻︎',
    'Ë': '◻︎',
    'Ì': '◻︎',
    'Í': '◻︎',
    'Î': '◻︎',
    'Ï': '◻︎',
    'Ð': '◻︎',
    'Ñ': '◻︎',
    'Ò': '◻︎',
    'Ó': '◻︎',
    'Ô': '◻︎',
    'Õ': '⌫︎',
    'Ö': '⌦︎',
    '×': '◻︎',
    'Ø': '➢︎',
    'Ù': '◻︎',
    'Ú': '◻︎',
    'Û': '◻︎',
    'Ü': '➲︎',
    'Ý': '◻︎',
    'Þ': '◻︎',
    'ß': '◻︎',
    'à': '◻︎',
    'á': '◻︎',
    'â': '◻︎',
    'ã': '◻︎',
    'ä': '◻︎',
    'å': '◻︎',
    'æ': '◻︎',
    'ç': '◻︎',
    'è': '➔︎',
    'é': '◻︎',
    'ê': '◻︎',
    'ë': '◻︎',
    'ì': '◻︎',
    'í': '◻︎',
    'î': '◻︎',
    'ï': '⇦︎',
    'ð': '⇨︎',
    'ñ': '⇧︎',
    'ò': '⇩︎',
    'ó': '⬄︎',
    'ô': '⇳︎',
    'õ': '⬀︎',
    'ö': '⬁︎',
    '÷': '⬃︎',
    'ø': '⬂︎',
    'ù': '▭︎',
    'ú': '▫︎',
    'û': '✗︎',
    'ü': '✓︎',
    'ý': '☒︎',
    'þ': '☑︎',
    'ÿ': '◻︎'
};

function wingdings(_0x53e291) {
    var _0x239d0a = _0xf5fb9b;
    return _0x53e291[_0x239d0a(0x1c0)]('')['map'](function(_0x32e5f4) {
        return wingdingsCharMap[_0x32e5f4] ? wingdingsCharMap[_0x32e5f4] : _0x32e5f4;
    })[_0x239d0a(0x5c)]('');
}
const vaporwaveCharMap = {
    '\x20': '\u3000',
    '`': '`',
    0x1: '１',
    0x2: '２',
    0x3: '３',
    0x4: '４',
    0x5: '５',
    0x6: '６',
    0x7: '７',
    0x8: '８',
    0x9: '９',
    0x0: '０',
    '-': '－',
    '=': '＝',
    '~': '~',
    '!': '！',
    '@': '＠',
    '#': '＃',
    '$': '＄',
    '%': '％',
    '^': '^',
    '&': '＆',
    '*': '＊',
    '(': '（',
    ')': '）',
    '_': '_',
    '+': '＋',
    'q': 'ｑ',
    'w': 'ｗ',
    'e': 'ｅ',
    'r': 'ｒ',
    't': 'ｔ',
    'y': 'ｙ',
    'u': 'ｕ',
    'i': 'ｉ',
    'o': 'ｏ',
    'p': 'ｐ',
    '[': '[',
    ']': ']',
    '\x5c': '\x5c',
    'Q': 'Ｑ',
    'W': 'Ｗ',
    'E': 'Ｅ',
    'R': 'Ｒ',
    'T': 'Ｔ',
    'Y': 'Ｙ',
    'U': 'Ｕ',
    'I': 'Ｉ',
    'O': 'Ｏ',
    'P': 'Ｐ',
    '{': '{',
    '}': '}',
    '|': '|',
    'a': 'ａ',
    's': 'ｓ',
    'd': 'ｄ',
    'f': 'ｆ',
    'g': 'ｇ',
    'h': 'ｈ',
    'j': 'ｊ',
    'k': 'ｋ',
    'l': 'ｌ',
    ';': '；',
    '\x27': '＇',
    'A': 'Ａ',
    'S': 'Ｓ',
    'D': 'Ｄ',
    'F': 'Ｆ',
    'G': 'Ｇ',
    'H': 'Ｈ',
    'J': 'Ｊ',
    'K': 'Ｋ',
    'L': 'Ｌ',
    ':': '：',
    '\x22': '\x22',
    'z': 'ｚ',
    'x': 'ｘ',
    'c': 'ｃ',
    'v': 'ｖ',
    'b': 'ｂ',
    'n': 'ｎ',
    'm': 'ｍ',
    ',': '，',
    '.': '．',
    '/': '／',
    'Z': 'Ｚ',
    'X': 'Ｘ',
    'C': 'Ｃ',
    'V': 'Ｖ',
    'B': 'Ｂ',
    'N': 'Ｎ',
    'M': 'Ｍ',
    '<': '<',
    '>': '>',
    '?': '？'
};

function vaporwaveText(_0x5a80a9) {
    var _0x40df30 = _0xf5fb9b,
        _0x19cf07 = _0x5a80a9[_0x40df30(0x1c0)]('\x20')[_0x40df30(0x230)];
    _0x5a80a9 = applyCharMap(vaporwaveCharMap, _0x5a80a9);
    var _0x4deeea = getAsianChars(Math[_0x40df30(0x268)](0x3, _0x19cf07));
    if (_0x19cf07 > 0x6) _0x4deeea = _0x4deeea[_0x40df30(0x1c0)]('')['map'](_0x20fd6b => _0x20fd6b + ['', ''][Math[_0x40df30(0x2e0)](Math[_0x40df30(0x267)]() * 0.6)])[_0x40df30(0x5c)]('');
    var _0x48d009 = [];
    return _0x48d009[_0x40df30(0x34b)](_0x5a80a9), _0x48d009[_0x40df30(0x5c)]();
}

function vaporwaveText1(_0x4691ba) {
    var _0x1f3bed = _0xf5fb9b,
        _0x4d31f3 = _0x4691ba[_0x1f3bed(0x1c0)]('\x20')[_0x1f3bed(0x230)];
    _0x4691ba = applyCharMap(vaporwaveCharMap, _0x4691ba);
    var _0x5cfd6c = getAsianChars(Math[_0x1f3bed(0x268)](0x3, _0x4d31f3));
    if (_0x4d31f3 > 0x6) _0x5cfd6c = _0x5cfd6c[_0x1f3bed(0x1c0)]('')[_0x1f3bed(0x29e)](_0x4080fb => _0x4080fb + ['', ''][Math[_0x1f3bed(0x2e0)](Math[_0x1f3bed(0x267)]() * 0.6)])['join']('');
    var _0x4234de = [];
    return _0x4234de[_0x1f3bed(0x34b)](_0x4691ba[_0x1f3bed(0x1b8)](/　/g, '░')[_0x1f3bed(0x1b8)](/ａｅ/, 'æ')[_0x1f3bed(0x1b8)](/Ａ/g, 'Λ')['replace'](/Ｅ/g, function() {
        var _0x2a96ed = _0x1f3bed;
        return Math[_0x2a96ed(0x267)]() > 0.5 ? 'Ξ' : 'Σ';
    })[_0x1f3bed(0x1b8)](/Ｏ/g, '♢')), _0x4234de[_0x1f3bed(0x5c)]();
}

function vaporwaveText2(_0x1f49ef) {
    var _0x12c527 = _0xf5fb9b,
        _0x361607 = _0x1f49ef['split']('\x20')['length'];
    _0x1f49ef = applyCharMap(vaporwaveCharMap, _0x1f49ef);
    var _0x2d9d4f = getAsianChars(Math['max'](0x3, _0x361607));
    if (_0x361607 > 0x6) _0x2d9d4f = _0x2d9d4f[_0x12c527(0x1c0)]('')['map'](_0x181ead => _0x181ead + ['', ''][Math[_0x12c527(0x2e0)](Math[_0x12c527(0x267)]() * 0.6)])[_0x12c527(0x5c)]('');
    var _0x3ccfa2 = [];
    return _0x3ccfa2[_0x12c527(0x34b)]('【\ufeff' + _0x1f49ef + '】'), _0x3ccfa2['join']();
}

function getAsianChars(_0x33b3a4) {
    var _0x36a6c8 = _0xf5fb9b;
    if (!_0x33b3a4) _0x33b3a4 = 0x1;
    var _0x5206ec = _0x36a6c8(0x3c3),
        _0x215e11 = '';
    for (var _0xa8d3ae = 0x0; _0xa8d3ae < _0x33b3a4; _0xa8d3ae++) {
        _0x215e11 += _0x5206ec[Math['floor'](Math['random']() * _0x5206ec[_0x36a6c8(0x230)])];
    }
    return _0x215e11;
}
const flourishArray = [_0xf5fb9b(0x18b), _0xf5fb9b(0x445), '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', _0xf5fb9b(0xc1), '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', _0xf5fb9b(0x169), _0xf5fb9b(0x117), _0xf5fb9b(0x2b6), _0xf5fb9b(0x35e), _0xf5fb9b(0x182), _0xf5fb9b(0x438), _0xf5fb9b(0x2da), _0xf5fb9b(0x112), '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', _0xf5fb9b(0x406), _0xf5fb9b(0x170), _0xf5fb9b(0xb9), _0xf5fb9b(0x222), _0xf5fb9b(0x478), _0xf5fb9b(0x9f), _0xf5fb9b(0x37e), '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', _0xf5fb9b(0x86), _0xf5fb9b(0x132), _0xf5fb9b(0x4a9), _0xf5fb9b(0x303), '(¯´•._.•\x20[[text]]\x20•._.•´¯)', _0xf5fb9b(0x164), _0xf5fb9b(0x17c), _0xf5fb9b(0x3f5), _0xf5fb9b(0x30d), '•´¯`•.\x20[[text]]\x20.•´¯`•', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', _0xf5fb9b(0x513), _0xf5fb9b(0x2ab), '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', _0xf5fb9b(0x164), _0xf5fb9b(0x21e), _0xf5fb9b(0x7a), _0xf5fb9b(0x245), _0xf5fb9b(0x1a2), _0xf5fb9b(0x318), '—(••÷[\x20[[text]]\x20]÷••)—', _0xf5fb9b(0xed), _0xf5fb9b(0x29f), _0xf5fb9b(0x462), _0xf5fb9b(0x291), _0xf5fb9b(0x41), _0xf5fb9b(0x4dd), _0xf5fb9b(0x4c9), _0xf5fb9b(0x2b1), '【｡_｡】\x20[[text]]\x20【｡_｡】', ']|I{•------»\x20[[text]]\x20«------•}I|[', _0xf5fb9b(0x2e5), '(-_-)\x20[[text]]\x20(-_-)', _0xf5fb9b(0x353), _0xf5fb9b(0x324), _0xf5fb9b(0x2eb), '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', _0xf5fb9b(0x1f0), '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', _0xf5fb9b(0x25), _0xf5fb9b(0x22c), _0xf5fb9b(0x3e5), _0xf5fb9b(0x48d), _0xf5fb9b(0x224), 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', _0xf5fb9b(0x4c4), _0xf5fb9b(0x416), _0xf5fb9b(0x1b7), _0xf5fb9b(0x273), 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', _0xf5fb9b(0x35)];

function wrapInFlourish(_0xd742bd) {
    var _0xafa9d6 = _0xf5fb9b;
    return flourishArray[Math[_0xafa9d6(0x27c)](Math[_0xafa9d6(0x267)]() * flourishArray[_0xafa9d6(0x230)])][_0xafa9d6(0x1b8)](_0xafa9d6(0x135), _0xd742bd);
}

function Flourishlist(_0x14af8e, _0x41dc74) {
    var _0x154e2f = _0xf5fb9b;
    return flourishArray[_0x14af8e]['replace'](_0x154e2f(0x135), _0x41dc74);
}

function wrapInSymbols(_0x757712, _0x4c5e8c) {
    return randomSymbols(_0x4c5e8c) + '\x20\x20' + _0x757712 + '\x20\x20' + randomSymbols(_0x4c5e8c);
}

function firework(_0x355b7e) {
    var _0x109e82 = _0xf5fb9b;
    return _0x355b7e[_0x109e82(0x1c0)]('')[_0x109e82(0x5c)]('҉') + '҉';
}

function weirdBox(_0x58fbfe) {
    var _0x4b436f = _0xf5fb9b;
    return _0x58fbfe[_0x4b436f(0x1b8)](/([^\s])/g, _0x4b436f(0x501));
}

function curlybrackets(_0xc88a79) {
    var _0x3a332a = _0xf5fb9b;
    return _0xc88a79[_0x3a332a(0x1b8)](/([^\s])/g, '⧼$1&#828;⧽');
}

function singlewavyJoiner(_0x1963e3) {
    var _0x5c8a42 = _0xf5fb9b;
    return '〜' + _0x1963e3[_0x5c8a42(0x1c0)]('')[_0x5c8a42(0x5c)]('∿') + '〜';
}

function thickBox(_0x4e49be) {
    var _0x2298fd = _0xf5fb9b;
    return _0x4e49be[_0x2298fd(0x1b8)](/([^\s])/g, '⟦$1⟧');
}

function zigzagJoiner(_0x2e4cdd) {
    var _0x3976da = _0xf5fb9b;
    return _0x2e4cdd['replace'](/([^\s])/g, _0x3976da(0x22a));
}

function hashJoiner(_0x3e8cc2) {
    var _0x2738ad = _0xf5fb9b;
    return _0x3e8cc2[_0x2738ad(0x1c0)]('')['join']('⨳');
}

function starJoiner(_0x526d2a) {
    var _0x1f5bb4 = _0xf5fb9b;
    return _0x526d2a[_0x1f5bb4(0x1b8)](/([^\s])/g, _0x1f5bb4(0x22a));
}

function connectedJoiner(_0x329143) {
    var _0x4de25c = _0xf5fb9b;
    return _0x329143['split']('')[_0x4de25c(0x5c)]('⊶');
}

function arrowjoin(_0x8255df) {
    var _0x344304 = _0xf5fb9b;
    return _0x8255df[_0x344304(0x1b8)](/([^\s])/g, '⦏$1&#x302;⦎');
}

function dotBoxtwo(_0x388f3c) {
    var _0x2b0544 = _0xf5fb9b;
    return _0x388f3c[_0x2b0544(0x1c0)]('')['join'](_0x2b0544(0x282));
}

function dotBox(_0x424651) {
    var _0x2fc5c2 = _0xf5fb9b;
    return _0x424651[_0x2fc5c2(0x1b8)](/([^\s])/g, _0x2fc5c2(0x5b));
}

function diametricBox(_0x2e3f7f) {
    var _0x2c322a = _0xf5fb9b;
    return _0x2e3f7f[_0x2c322a(0x1b8)](/([^\s])/g, _0x2c322a(0x1a8));
}

function arrowBox(_0x2b9a4c) {
    return _0x2b9a4c['replace'](/([^\s])/g, '⦏$1⦎');
}

function littleSparkles(_0x4557be) {
    var _0x1446ba = _0xf5fb9b;
    return _0x1446ba(0x185) + _0x4557be + '\x20•°*”˜.•°*”˜';
}

function kirbyHug(_0x58e143) {
    var _0x2e56f4 = _0xf5fb9b;
    return _0x2e56f4(0x1de) + _0x58e143 + '\x20♥';
}

function _0x3b3b() {
    var _0x4a3bf3 = ['&#1213;', '🕑︎', 'R&#838;', 'U&#846;', '&#1349;', '🕘︎', '&#120441;&#823;', '.result-s8', '8&#838;', '🖲︎', 'k&#857;', 'x&#829;&#851;', '&#607;', '&#422;', '(^▽^)', 'n&#830;', 's16', 'Y&#830;', '&#1140;', '.tildeStrikeThrough', 'remove', '&#3057;', '4&#838;', '.heart3', '.thickBox', 'html', '&#4336;', '.•°¤*(¯`★´¯)*¤°\x20', '.arrowjoin', '.wrap4', '6&#828;', 'i&#866;', '&#41246;', '&#596;', '.result-s13', 'R&#826;', '.zigzagJoiner', '╚»★«╝\x20[[text]]\x20╚»★«╝', 'F&#846;', '&#41556;', '9&#838;', '&#344;', 'c&#799;', '.squiggle6CharMap', '&#41240;', '&#996;', '.dotBox', 'Q&#838;', 'S&#799;', '&#65420;', '&#1065;', 'L&#830;', 'roundsquares', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', '&#120465;&#823;', '&beta;', '&#41427;', 'K&#866;', '.futureAlienCharMap', '&#120439;&#823;', '&#4315;', '(⌒‿⌒)', '&#41766;', '.superscriptCharMap', 'ﾟ･:,｡★＼(^-^\x20)♪', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '.o0×X×0o.\x20', 'V&#830;', '▀▄▀▄▀▄\x20', '&#10123;', '(≧◡≦)', 'charCodeAt', '&#41080;', '&#374;', 'D&#826;', '💖彡', 'l&#829;&#851;', '&Omega;', '.doubleStruckCharMap', 'x&#828;', '&#270;', 's17', '.result-s16', '『$1』', 'Z&#857;', '.result-s17', 'g&#830;', '&#5290;', '¸♩·¯·ξξ(∵❤◡❤∵)ξξ🌸', 'e&#828;', ']|I{•------»\x20', '꜍$1꜉', 'join', '.slashThrough', '.result-s4', '7&#838;', 'k&#866;', 'k&#829;&#851;', '.thankyou1', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', 'B&#828;', '¨˜ˆ”°⍣~•✡⊹٭„¸', '.crossAboveBelow', '🕓︎', '&otilde;', '&#4327;', 'A&#799;', 'r&#838;', '$2$1', 'mapInverse', '&#941;', 'D&#866;', '&#311;', 'b&#846;', '&#586;', '5&#857;', '&#623;', '.star3', '◔◡◔', '٭⊹•꧂', 'top', '&#1105;', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '&#5597;', '&scaron;', 'R&#830;', 'o&#828;', '0&#826;', '¸,ø¤º°`°º¤ø,¸\x20', '&#434;', '(✿^▽^)', '꧁𓊈𒆜', '🖳︎', 'maxHeight', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', 'l&#830;', 'V&#828;', '.fullCrazy3', 'add', 'H&#799;', 'T&#828;', '🌘‿🌘\x20\x20', 'E&#799;', '&#5616;', 'getHTML', 'X&#830;', 'g&#846;', '(･ω･)♪', '&#5167;', '&#41754;', 'N&#866;', '&#1223;', 'o&#830;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'K&#829;&#851;', 'r&#829;&#851;', 'c&#830;', 't&#846;', 'l&#846;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '6&#846;', '\x20🎀\x20🍒', '.neonCharMap', 'u&#857;', '&#41295;', 'K&#838;', '2&#866;', 'e&#857;', '&#41823;', 'p&#846;', '&#41976;', '&#120478;&#823;', '&yen;', '&#1178;', '.italicCharMap', '&#5556;', '3&#857;', 'addEventListener', '(¯´•._.•\x20', '(✿╹◡╹)', '&#5029;', 'H&#829;&#851;', 'location', '.oldEnglishCharMap', '.diametricBox', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', 'g&#828;', '(*ゝω・)', '&#4318;', '&#292;', '╰•★★\x20', '&#646;', 'f&#799;', '⚔️\x20[[text]]\x20⚔️', 'C&#830;', '🕚︎', '&#41751;', '.curlybrackets', 'r&#826;', '&#120823;&#823;', '&#41708;', 'u&#866;', 'A&#866;', '&#9815;', '&#5610;', 's&#846;', 'textarea', '💜💘', 'S&#838;', '.wrap3', '.result-s24', 'a&#857;', '#fontSize', '.result-s14', '.crazyWithFlourishOrSymbols', '&eta;', 'l&#826;', '&#9761;', '.arrowBox', '(•◡•)', '&#268;', 's&#799;', 'm&#829;&#851;', '◕‿◕', '&#41076;', 'S&#828;', '&rho;', 'ıllıllı\x20', '&#377;', '&#3182;', '&#942;', '&#400;', 'U&#799;', '&#1075;', '&#41686;', '&#41105;', '__proto__', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', '&#1047;', 'G&#838;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', 'Q&#857;', '&#120464;&#823;', '&#120432;&#823;', '4&#846;', '.fullCrazy2', '👓︎', 'table', 'U&#866;', 'hasOwnProperty', 'D&#828;', '^ㅂ^', '.dotBoxtwo', 'h&#829;&#851;', '5&#799;', '&sigma;', 'a&#830;', 'I&#857;', '&#420;', 'J&#829;&#851;', 'A&#857;', '&#7918;', 'ஜ۩۞۩ஜ\x20', '&#4325;', '&#4330;', 'U&#828;', 'щ（ﾟДﾟщ）\x20<\x20', '(づ｡◕‿‿◕｡)づ', 'v&#846;', 'N&#828;', 'L&#829;&#851;', 'B&#857;', '.textgun', '&#308;', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '.weirdBox', '•°¯`••\x20', '&upsilon;', '(Y)', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', 'pop', '【$1】', 'Z&#829;&#851;', 'ᕕ(ᐛ)ᕗ', '&#10129;', '×º°”˜`”°º×\x20', '7&#846;', '🖰︎', '&#120468;&#823;', 's25', 'J&#866;', '&#41707;', 'body', 'undefined', '&#20057;', 'I&#826;', 'e&#866;', '.result-s22', '彡(✿╹◡╹)\x20', '&chi;', '&#5198;', '&#10130;', '&#2792;', 'querySelector', 'W&#799;', '2&#799;', '*•.¸♡\x20[[text]]\x20♡¸.•*', '╚»★«╝\x20', '┏༼\x20◉\x20╭╮\x20◉༽┓\x20', '[[text]]', '&#41005;', '&#2798;', '.star9', '&#5262;', 'V&#829;&#851;', 'b&#829;&#851;', 's18', '.result-s23', 'toString', '&#294;', '&#1330;', '👎︎', '🕯︎', '❀◕‿◕❀', '&phi;', 'j&#866;', 'Z&#838;', 'r&#828;', '&#120447;&#823;', '.thankyou2', '.emoticon6', 'info', '\x20(\x20◔\x20ʖ̯\x20◔\x20)', '&forall;', 'P&#799;', '&#41575;', 'E&#826;', '(✿◕ᗜ◕)━♫.*･｡ﾟ', '&#1084;', '<%=\x20version\x20%>', '&#1031;', 'X&#838;', 'd&#857;', '&#592;', '🖫︎', '(ɔ◔‿◔)ɔ', '&#19973;', 'l&#828;', 'v&#866;', '&#1051;', '&#5511;', '\x20\x20🎀\x20\x20', '.connectedJoiner', '.dottyJoiner', '4&#857;', '5&#846;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', 'J&#830;', '★彡[', '&#120433;&#823;', 'K&#830;', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '¤¸¸.•´¯`•¸¸.•..>>\x20', '&#41120;', 'a&#828;', 't&#830;', '&#41571;', 'q&#857;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', '&#120827;&#823;', '&#1351;', 'W&#830;', '&#41712;', 'L&#826;', '.squiggleCharMap', 'k&#846;', '&#1097;', '.star10', '6&#857;', ']彡★', '░▒▓█\x20[[text]]\x20█▓▒░', '&#120824;&#823;', 'p&#857;', 'E&#838;', 'q&#829;&#851;', 'input', '[[text]]\x20☜(`o´)', '&#1072;', '&fnof;', '˜”*°•.˜”*°•\x20', 'p&#799;', '&#1337;', '&#1112;', 'S&#846;', '5&#828;', '꧁༒☬\x20[[text]]\x20☬༒꧂', '.crazyWithFlourishOrSymbols3', '&#1488;', 'B&#838;', 'T&#829;&#851;', 'j&#826;', '&#120448;&#823;', '&#41141;', 'B&#829;&#851;', '8&#826;', '&#435;', '.lunisquares', '&#625;', '෴❤️෴\x20\x20', '♥¸.•*❤´°◦¸¸.◦°˚°◦☙◦彡彡', '&#627;', 'v&#857;', '&#41346;', 'T&#846;', '&#3588;', '✬☆*.•⨳•.¤⊹٭', '&#1044;', 'O&#829;&#851;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', 'z&#838;', 'z&#846;', 'g&#857;', '🕮︎', 'k&#826;', '⦑$1⦒', 'M&#830;', '🌘‿🌘', '.symbolsCharMap', '&#321;', '&#4329;', '.:｡+ﾟ', 'e&#799;', '&#8467;', 'A&#828;', 'test', '👍︎', 'G&#829;&#851;', 's10', '&#394;', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', 'replace', '&#2794;', '&#2799;', '📫︎', 's11', '&#1095;', 'D&#829;&#851;', 'q&#846;', 'split', '📂︎', 'c&#826;', 'amd', '&#120475;&#823;', '.singlewavyJoiner', '&#41074;', '.result-s21', 'init', 'v&#799;', '&#42014;', '&#9834;', '&#1342;', 'O&#828;', '.sad6', '\x20(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '-漫~*\x27¨¯¨\x27*·舞~\x20', '.star0', 'H&#846;', '.greekCharMap', '٭⊹¤.•⨳•.*☆✬\x20', '&#1076;', '—(••÷[\x20', '&#120443;&#823;', 'H&#826;', '🏱︎', 'u&#838;', '&#1358;', '.cuteText2', '&#41807;', '(っ◔◡◔)っ\x20♥\x20', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', '3&#799;', 'K&#828;', 'X&#826;', 'F&#828;', 's21', '&#5620;', '&#327;', 'j&#799;', '&#1071;', '&#120830;&#823;', '&alpha;', '(¯`·.¸¸.->\x20°º\x20', '🕙︎', 'm&#857;', '╚»★«╝', '&psi;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', 'o&#866;', '·.★·.·´¯`·.·★', 'S&#826;', 'F&#829;&#851;', '◦•●❤♡\x20', 'X&#866;', 'toLowerCase', '`•.,¸¸,.•´¯\x20', '&#1092;', '\x20║▌║▌║█│▌', 'U&#826;', 'z&#857;', 'console', '&#1210;', 'C&#838;', '.minigame', 'M&#828;', '&#541;', '&#1028;', '.NamaFF', '&#120829;&#823;', '&#1180;', '&#120470;&#823;', 'D&#799;', '🕒︎', '&#41081;', 'H&#830;', '&Oslash;', '&#404;', 'C&#799;', 'I&#838;', 'y&#866;', '&#974;', '&#413;', 'x&#866;', '°°°·.°·..·°¯°·._.·\x20', '\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '&#120438;&#823;', '&#477;', '&#41769;', 'o&#799;', '&nu;', '&#548;', '&#120459;&#823;', 's29', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', 'j&#829;&#851;', '&#120825;&#823;', 'y&#846;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', 'G&#799;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '9&#799;', '༻༒۝', '&#9796;', 'b&#799;', 'v&#828;', '⦚$1⦚', '&#41660;', '⫷\x20[[text]]\x20⫸', '🕭︎', '══━一', 'j&#857;', 'length', '&#411;', 'h&#826;', '&#41296;', 's31', '.thankyou6', 'w&#838;', 'u&#826;', '&#1138;', '&#120462;&#823;', 'q&#828;', 'warn', '.emoticon0', '&ETH;', '&#41008;', '&#5741;', '^ㅅ^', 's19', 'ミミ◦❧◦°˚°◦.¸¸◦°´❤*•.¸♥\x20\x20', '&#8984;', '&#4317;', '•´¯`•»\x20[[text]]\x20«•´¯`•', '.boldItalicCharMap', 'A&#838;', '&#670;', '&#296;', '6&#866;', 'Z&#826;', '&#42150;', 'appendChild', '&#9835;', '&#391;', 'y&#799;', '&#1139;', 'v&#830;', '.heart2', 'mirror', '&#423;', 'I&#866;', '.underline', '&#41426;', 'ᵔ⌣ᵔ', '&#336;', '*´¯`*.¸¸.*´¯`*\x20', '&#12425;', '&#406;', '★｡\x20🎀', '&#4308;', 'L&#828;', '●‿●', 'O&#799;', '🖬︎', '★★•╯', 'c&#866;', '.pubggame2', 'random', 'max', 'o&#838;', '&#1046;', '.result-s27', 'r&#830;', '💧︎', '.invertedSquaresCharMap', 'diacriticsBottom', '&#1094;', 'i&#857;', 'v&#829;&#851;', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', '◠◡◠', '7&#799;', '&#381;', 'S&#829;&#851;', 'N&#799;', '5&#829;&#851;', '&#1008;', '.star7', 'floor', 'C&#857;', '&#23610;', 'm&#828;', 'ready', '♪(\x20^-^)/★,｡･:･ﾟ', '&#778;\x20⫶', 's14', 'y&#826;', '&kappa;', '🌟⭐ıllıllı', '&#9773;', 'execCommand', '&#42130;', 'function', 'creepify', '••¤(`×', '&#41991;', 'ஜ۩۞۩ஜ', '&#42015;', 'i&#799;', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', '8&#830;', 'encode', '★·.·´¯`·.·★\x20', 'C&#826;', '.crazyWithFlourishOrSymbols1', '.result-s3', '&#41949;', '&#1131;', '\x20●︿●', '&#2797;', '&#645;', '&#1397;', 'map', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', 'r&#846;', '¨˜ˆ”°⍣~•✡⊹٭„¸\x20\x20', 'insertBefore', '#Sk-text', '★·.·´¯`·.·★.·', '෴❤️෴', '&#618;', 's30', '&#9736;', 'E&#857;', '&#5845;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '`✵•.¸,✵°✵.｡.✰\x20\x20', '•´¯`•»\x20', 'h&#857;', '&#484;', '&#41706;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', 'N&#829;&#851;', '&#9739;', '⁀‿⁀', '6&#830;', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', 'exports', '«-(¯`v´¯)-«\x20', '&#638;', '.fullCrazy1', '(人◕‿◕)', '&#41016;', '&#120445;&#823;', '.currencyCharMap', 'G&#826;', '¸„٭⊹✡•~⍣°”ˆ˜¨', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '&#120481;&#823;', '.crazyWithFlourishOrSymbols5', '.littleSparkles', '&#42180;', '&#1338;', '&#972;', '.asianStyle2CharMap', '&Delta;', '&#4357;', 't&#799;', 'h&#846;', '&#120436;&#823;', '<style>\x20.NamaFF\x20p{font-size:', '.doubleUnderline', 'g&#799;', '`•.¸¸.•´´¯`••._.•\x20', '.sad3', 'val', '&#41731;', '(y)', '.thankyou5', '&omega;', 'A&#846;', '.emoticon4', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '.fullCrazy', '.boldCharMap', '&#10124;', '&#407;', '&#350;', 'round', '𒆜𓊉꧂', 'j&#828;', 'j&#830;', 'W&#846;', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '꧁•⊹٭', '&#1193;', '.result-s9', 's13', 'error', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '9&#846;', '&#4335;', '&#355;', '6&#838;', '.result-s7', '&#1344;', '.squiggle5CharMap', '&#8023;', '&#1352;', 'o&#846;', '.result-s6', 'toUpperCase', '&#1506;', '.emoticon3', '••¤(`×[¤\x20', '&#654;', '&#9687;', '&#120460;&#823;', '&#7433;', '\x20٩꒰´·⌢•｀꒱۶⁼³₌₃', '♥╣[-_-]╠♥', 'v&#838;', '&#42128;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '.heart6', '&#120442;&#823;', '2&#830;', '&#41733;', '&#120831;&#823;', '&#1056;', '.thickBlockFramed', '&#40974;', 'c&#828;', '★彡\x20[[text]]\x20彡★', '&#120452;&#823;', '&#615;', 'H&#866;', 's27', '&#4310;', '&#1333;', '&#358;', '&euro;', 'P&#826;', 'k&#828;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', 's22', '&#315;', 'B&#866;', 'q&#830;', '&#1192;', '&#258;', '0&#830;', '&#1179;', '&#998;', '&#1350;', '&#4331;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '.result-s29', '(′︿‵｡)', 'o&#857;', 'M&#799;', '&#1074;', 'i&#838;', '.result-s30', 'r&#866;', '.sad2', '&#3923;', 'exception', '▄︻デ', '������', '&#1060;', '&#42171;', '&#41266;', 'click', '&#42075;', '&#1062;', 'p&#826;', 'H&#838;', '.squaresCharMap', 'ᵔᴥᵔ', '(づ｡◕‿‿◕｡)づ\x20', '&#1130;', '&#120458;&#823;', 'Y&#846;', '&#1359;', 'O&#866;', '&#5500;', '♡〜ლ(๑癶\x20', 'E&#829;&#851;', '.wrap2', '1&#846;', '&#41392;', 'm&#866;', 'prototype', 'O&#838;', 'push', 'N&#857;', '7&#830;', 'x&#830;', '&#120455;&#823;', '&#1185;', 'n&#826;', '&Xi;', '•´¯`•.\x20[[text]]\x20.•´¯`•', '📪︎', '💘🎀', '.cuteText5', '&#595;', '&#2414;', '&#412;', '2&#828;', '&#438;', '.Name-FF', '•._.••´¯``•.¸¸.•`\x20', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', 'J&#857;', '&#1103;', '&#1063;', '&sigmaf;', '.heart1', 'J&#828;', 'Q&#830;', 'p&#838;', '&#545;', 'copy', 'm&#826;', '9&#826;', 'n&#846;', '♪(･ω･)ﾉ', 'P&#830;', '💖´\x20*•.¸♥¸.•**\x20', '&#41157;', '&#10126;', '.star4', '&#120476;&#823;', '&#387;', '&#1283;', '&Mu;', 'randomization', '.emoticon5', '】〗〙〛］', 's&#829;&#851;', '&#403;', '&#8355;', 'w&#830;', 'l&#866;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', '&#1340;', '&#1377;', '.bentTextCharMap', '&#1052;', '🕔︎', '.emoticon1', '░▒▓█►─═', '&#41508;', '¸„.-•~¹°”ˆ˜¨\x20', '&#41007;', '&#1048;', 'bubbles', 'G&#866;', 'https://www.namaff.com/?=', '&#9791;', '.cuteText3', 'W&#838;', 'Nama\x20FF', '&#41037;', 'R&#829;&#851;', 'V&#846;', '🐿\x20🎀', 'Z&#830;', '&#8134;', '&oplus;', '🌸ξξ(∵❤◡❤∵)ξξ·¯·♩¸\x20', 's&#838;', '꧁𒆜༒', 'G&#857;', '&#490;', '.heart7', '0&#838;', '&#120471;&#823;', '.result-s31', 'nodeType', '.thankyou4', '&#5196;', 'l&#799;', 'R&#857;', '&#120446;&#823;', '.fullCrazy5', '&#120461;&#823;', '&#41833;', 'P&#838;', '&#823;', '【〖〘〚［', 'S&#866;', 'G&#828;', '📁︎', '.text', '&#42131;', '\x20.o0×X×0o.\x20', '🕈︎', 'u&#846;', '.result-s26', '&#1049;', '▌│█║▌║▌║\x20', '&#639;', '9&#829;&#851;', '📭︎', '&#989;', '&#351;', '.emoticon7', '&#576;', '🐣♖', '&#286;', '&#382;', 'c&#857;', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', 'n&#799;', '&#41863;', 'd&#866;', 'window', 'fromCharCode', 'U&#857;', '&#340;', '&#1043;', 'F&#830;', '&#9812;', '&#120479;&#823;', 'M&#826;', 'tiny', 'o&#829;&#851;', '&#41053;', ']\x20𒆜𓊉꧂', 'i&#829;&#851;', 'value', 'J&#799;', 'Z&#866;', 'N&#846;', 'T&#838;', 'q&#838;', '0&#846;', 'C&#828;', '&#669;', '&#1347;', 'E&#846;', '&#385;', 'P&#857;', 'n&#838;', 'B&#826;', '&#41204;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', 'X&#846;', 'w&#846;', '•´¯`•.\x20', '&Lambda;', 'g&#838;', '&epsilon;', 'diacriticsMiddle', 'g&#866;', '&#5623;', 'q&#799;', '&#2790;', '&#647;', 'F&#866;', 'esrever', 'p&#866;', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', 's20', '&micro;', '&#42148;', '.result-s12', 'K&#799;', 'x&#846;', '.cuteText1', '&#1356;', '&#1171;', '#Name-FF', '&#3619;', '•?((¯°·._.•\x20', 't&#838;', '{}.constructor(\x22return\x20this\x22)(\x20)', '&#633;', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', 'S&#857;', '&#1041;', 'f&#846;', 'return\x20(function()\x20', '&#40984;', 'U&#829;&#851;', 'I&#828;', 'h&#799;', 'O&#830;', '&#41029;', '♡❤●•◦', 'f&#838;', '&#653;', '\x20卐ॐ\x20ཌ꧂◤', '&#120477;&#823;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', '٩(˘◡˘)۶', '.monospaceCharMap', '(oꆤ︵ꆤo)\x20', '&#428;', 'L&#799;', '&#346;', 't&#857;', 'b&#828;', '5&#838;', '&#608;', '.thankyou0', 'px}\x20</style>', '7&#866;', '8&#857;', 'diacriticsTop', 'Q&#829;&#851;', 'J&#838;', '&#41042;', '(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '&#120822;&#823;', '2&#838;', 'S&#830;', 'x&#799;', '&#1331;', 'i&#828;', '&#120440;&#823;', 'x&#826;', '&#41648;', '&#42181;', 's26', 'a&#829;&#851;', 'a&#826;', '8&#828;', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '.result-s25', '&#613;', '5&#830;', '&#1291;', '&#2749;', '&#120463;&#823;', 'Y&#799;', '.cuteText4', '&#310;', 'v&#826;', '.result-s18', 'e&#838;', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', 'innerText', 'select', 'i&#830;', 'a&#799;', 'U&#838;', '&#120467;&#823;', 'N&#830;', '9&#828;', 'i&#826;', '&#41674;', '&#120472;&#823;', '&#295;', '&#120466;&#823;', '&#41079;', '.starJoiner', 'X&#828;', '&#652;', '.heartsBetween', 'tools', 'g&#826;', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', '🕗︎', 'reverse', '\x20🎀\x20🐿', '.sad7', 'classList', '1&#828;', 'K&#846;', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', 'H&#857;', 'w&#866;', '\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '🖂︎', '.vaporwaveText1', '🖃︎', '.heart4', 'options', '&ugrave;', '&#41155;', '&#4306;', '.wavyJoiner', 'M&#838;', 'X&#857;', '&#41045;', '.bricks', 'apply', 'M&#866;', '.luniroundsquares', '&#41532;', 'W&#866;', 'ıllıllı\x20[[text]]\x20ıllıllı', '.kirbyHug', 'global', '&#1111;', '4&#828;', '(ಥ\x20͜ʖಥ)\x20', '.copied', '&#41555;', 'u&#799;', 'trace', '&#323;', '8&#846;', 'a&#866;', '&#392;', '.crazyWithFlourishOrSymbols4', '\x20(๑′°︿°๑)', '&#40983;', '1&#826;', '&Gamma;', '🕐︎', '(✿ヘᴥヘ)', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', '&#642;', '&#41433;', 's&#857;', '۝༒༺', '&#10122;', '&#651;', '🖮︎', '&#1202;', '.illuminati', 'F&#838;', '&Uacute;', 'object', '&#262;', '.result-s10', '&#65434;', '&#5397;', '\x20(︶︹︺)', 'href', 'd&#846;', 'f&#829;&#851;', 'middle', '&#5205;', 'I&#799;', 'K&#826;', 'Y&#826;', '9&#866;', 'u&#829;&#851;', '╰☆☆\x20[[text]]\x20☆☆╮', '☞ó\x20͜つò☞\x20\x20', '💣︎', '&#5609;', 'r&#857;', 'Q&#846;', 'a&#846;', '\x20¤]×´)¤••', '&#272;', '&#120454;&#823;', 'trim', 'A&#826;', '&#416;', '&#429;', '&#41804;', '&#5615;', 'charAt', '&#940;', '.wingdings', 'C&#846;', '&#418;', '.thankyou7', '🗄︎', 'C&#866;', 'm&#838;', '&#41126;', 'flip', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '.lunitoolstinyencode', 'f&#866;', '&#1079;', '<style>\x20//\x20Discord\x20Fonts\x20by\x20:DiscordFonts@gmail.com\x20</style>', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '&#3648;', '&#9790;', '👻ൠ', 'z&#829;&#851;', 'A&#830;', '&#408;', 'x&#838;', '.lunitoolsbubbles', 'p&#829;&#851;', '&#356;', '✰.｡.✵°✵,¸.•✵´', '&#120469;&#823;', '(.﹒︠₋﹒︡.)\x20ﾟ😳☹', 'T&#826;', 'bind', 'e&#830;', '&#410;', 'z&#826;', 'D&#830;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', '4&#829;&#851;', '.result-s2', '&#409;', 'copied-show', 'y&#857;', 'P&#866;', '&#549;', '&#120828;&#823;', 'd&#826;', 'forEach', '&#7990;', '&#120826;&#823;', 'E&#828;', '8&#829;&#851;', '(◍•ᴗ•◍)\x20ミ💖\x20', 'T&#866;', '&#10081;', '(*ˊᗜˋ*)', '&#120482;&#823;', '&#40996;', '&#8627;', 'w&#826;', '&#1141;', 'D&#846;', 'x&#857;', '📄︎', '7&#829;&#851;', '§.•´¨\x27°÷•..×\x20', '&dagger;', '&#42159;', '0&#828;', '9&#830;', '.result-s15', 'B&#799;', 'n&#866;', '[̲̅$1]', '&#10003;', '3&#828;', '🕆︎', 'input\x20change', '&part;', '7&#857;', '.scriptify', 'f&#828;', 'y&#838;', '(|||❛︵❛.)', '&#614;', '&#372;', '&#12581;', '&#120449;&#823;', '&#5229;', 'f&#857;', '0&#857;', '•°¯`••\x20[[text]]\x20••´¯°•', 'm&#830;', '&#291;', '&#1360;', '&#41203;', '&#341;', '•●◉✿\x20', 'W&#829;&#851;'];
    _0x3b3b = function() {
        return _0x4a3bf3;
    };
    return _0x3b3b();
}

function dottyJoiner(_0x4ae6b4) {
    var _0x5ab937 = _0xf5fb9b;
    return '░' + _0x4ae6b4[_0x5ab937(0x1c0)]('')['join']('░') + '░';
}

function wavyJoiner(_0x564225) {
    var _0x60336d = _0xf5fb9b;
    return '≋' + _0x564225[_0x60336d(0x1c0)]('')[_0x60336d(0x5c)]('≋') + '≋';
}

function diametricAngleFrame(_0x3786ae) {
    var _0x4246c0 = _0xf5fb9b;
    return _0x3786ae[_0x4246c0(0x1b8)](/([^\s])/g, _0x4246c0(0x53));
}

function thickBlockFramed(_0x4b5da4) {
    var _0x5b8b1f = _0xf5fb9b;
    return _0x4b5da4[_0x5b8b1f(0x1b8)](/([^\s])/g, _0x5b8b1f(0x119));
}

function star0(_0x3297dd) {
    return applyCharMap(italicCharMap, 'ミ★\x20' + _0x3297dd + '★彡');
}

function star1(_0x58d9e5) {
    var _0x127d78 = _0xf5fb9b;
    return applyCharMap(monospaceCharMap, _0x127d78(0x2e6) + _0x58d9e5 + _0x127d78(0x77));
}

function star2(_0x22249f) {
    var _0x3b819b = _0xf5fb9b;
    return applyCharMap(currencyCharMap, '\x20ıllıllı⭐🌟' + _0x22249f + _0x3b819b(0x286));
}

function star3(_0x50dcf1) {
    var _0x327f78 = _0xf5fb9b;
    return applyCharMap(monospaceCharMap, _0x327f78(0xbe) + _0x50dcf1 + _0x327f78(0x264));
}

function star4(_0x1db426) {
    var _0x4435a8 = _0xf5fb9b;
    return applyCharMap(squaresCharMap, _0x4435a8(0x2ac) + _0x1db426 + _0x4435a8(0x4d4));
}

function star5(_0x1c06e1) {
    var _0x21412d = _0xf5fb9b;
    return applyCharMap(doubleStruckCharMap, _0x21412d(0x1f2) + _0x1c06e1 + _0x21412d(0x2a4));
}

function star6(_0x816951) {
    var _0x2cfbec = _0xf5fb9b;
    return applyCharMap(invertedSquaresCharMap, _0x2cfbec(0x2a1) + _0x816951 + _0x2cfbec(0x2c0));
}

function star7(_0x3f0884) {
    var _0x240956 = _0xf5fb9b;
    return applyCharMap(asianStyleCharMap, '¸„٭⊹✡•~⍣°”ˆ˜¨' + _0x3f0884 + _0x240956(0x65));
}

function star8(_0x3ea826) {
    return applyCharMap(asianStyle2CharMap, '★¸.•☆•.¸★\x20' + _0x3ea826 + '★⡀.•☆•.★');
}

function star9(_0x557672) {
    var _0x17e4ac = _0xf5fb9b;
    return applyCharMap(neonCharMap, _0x17e4ac(0x1d4) + _0x557672 + _0x17e4ac(0x19f));
}

function star10(_0x47356b) {
    var _0x1f9f4a = _0xf5fb9b;
    return applyCharMap(squiggle6CharMap, _0x1f9f4a(0x1d4) + _0x47356b + '✬☆*.•⨳•.¤⊹٭');
}

function heart0(_0x207dcd) {
    var _0x42480a = _0xf5fb9b;
    return applyCharMap(squiggle5CharMap, _0x42480a(0x4ec) + _0x207dcd + _0x42480a(0x4b));
}

function heart1(_0x45adc8) {
    var _0x1b2168 = _0xf5fb9b;
    return applyCharMap(futureAlienCharMap, _0x1b2168(0x198) + _0x45adc8 + _0x1b2168(0x2a5));
}

function heart2(_0x3f8649) {
    var _0x9384f8 = _0xf5fb9b;
    return applyCharMap(boldCharMap, _0x9384f8(0x36e) + _0x3f8649 + '**•.¸♥¸.•*´💖');
}

function heart3(_0xaee77e) {
    var _0x3576bb = _0xf5fb9b;
    return applyCharMap(firework, _0x3576bb(0x343) + _0xaee77e + '癶๑)ლ〜♡');
}

function heart4(_0x354dc5) {
    var _0x2bf2de = _0xf5fb9b;
    return applyCharMap(symbolsCharMap, _0x2bf2de(0x1f5) + _0x354dc5 + _0x2bf2de(0x411));
}

function heart5(_0x52bf61) {
    var _0xbb18f5 = _0xf5fb9b;
    return applyCharMap(bentTextCharMap, _0xbb18f5(0x398) + _0x52bf61 + _0xbb18f5(0x58));
}

function heart6(_0x449f99) {
    var _0x283bf8 = _0xf5fb9b;
    return applyCharMap(upperAnglesCharMap, _0x283bf8(0x300) + _0x449f99 + _0x283bf8(0x300));
}

function heart7(_0x203915) {
    var _0x2c8ac1 = _0xf5fb9b;
    return applyCharMap(boldCharMap, _0x2c8ac1(0x242) + _0x203915 + _0x2c8ac1(0x199));
}

function emoticon0(_0x26103c) {
    var _0x3c8246 = _0xf5fb9b;
    return applyCharMap(oldEnglishCharMap, _0x3c8246(0x12a) + _0x26103c + '(｀∀´)Ψ');
}

function emoticon1(_0x4a2664) {
    var _0x156d45 = _0xf5fb9b;
    return applyCharMap(squiggle6CharMap, _0x156d45(0x10a) + _0x4a2664 + ')');
}

function emoticon2(_0x1819d8) {
    var _0x5b5464 = _0xf5fb9b;
    return applyCharMap(boldCharMap, _0x5b5464(0x4aa) + _0x1819d8 + '');
}

function emoticon3(_0x448f19) {
    return applyCharMap(squiggle5CharMap, '(☝◞‸◟)☞' + _0x448f19 + '');
}

function emoticon4(_0x8197c) {
    var _0x468968 = _0xf5fb9b;
    return applyCharMap(cursiveCharMap, _0x468968(0x33c) + _0x8197c + '\x20٩(˘◡˘)۶');
}

function emoticon5(_0x4f1b1e) {
    var _0x52cbd4 = _0xf5fb9b;
    return applyCharMap(squiggle3CharMap, _0x52cbd4(0x8d) + _0x4f1b1e + _0x52cbd4(0x48c));
}

function emoticon6(_0x5d1320) {
    var _0x33c797 = _0xf5fb9b;
    return applyCharMap(wideTextCharMap, '(^▽^)\x20\x20' + _0x5d1320 + _0x33c797(0x82));
}

function emoticon7(_0x809c03) {
    var _0x233c91 = _0xf5fb9b;
    return applyCharMap(squiggle2CharMap, '(人◕‿◕)' + _0x809c03 + _0x233c91(0xdb));
}

function thankyou0(_0x99f714) {
    var _0x809abb = _0xf5fb9b;
    return applyCharMap(doubleStruckCharMap, _0x809abb(0x93) + _0x99f714 + _0x809abb(0x36c));
}

function thankyou1(_0x42851d) {
    var _0x3f7f7a = _0xf5fb9b;
    return applyCharMap(cursiveCharMap, _0x3f7f7a(0x4ef) + _0x42851d + _0x3f7f7a(0x4ef));
}

function thankyou2(_0x1f86c2) {
    var _0xdf6dfa = _0xf5fb9b;
    return applyCharMap(doubleStruckCharMap, _0xdf6dfa(0xbb) + _0x1f86c2 + '(ω・*ゝ)');
}

function thankyou3(_0x443787) {
    return applyCharMap(upperAnglesCharMap, '<(_\x20_*)>' + _0x443787 + '');
}

function thankyou4(_0x4d21c7) {
    return applyCharMap(squiggle2CharMap, '★⌒(●ゝω・)' + _0x4d21c7 + '');
}

function thankyou5(_0xc85dab) {
    var _0x30e0eb = _0xf5fb9b;
    return applyCharMap(asianStyleCharMap, _0x30e0eb(0x40) + _0xc85dab + _0x30e0eb(0x281));
}

function thankyou6(_0x13484b) {
    var _0x4f7041 = _0xf5fb9b;
    return applyCharMap(medievalCharMap, '+｡:.ﾟヽ(*´∀)ﾉﾟ' + _0x13484b + _0x4f7041(0x1ae));
}

function thankyou7(_0x529c7e) {
    var _0x54ee43 = _0xf5fb9b;
    return applyCharMap(neonCharMap, _0x54ee43(0xbb) + _0x529c7e + '(*ゝω・)');
}

function sad0(_0x2a52f8) {
    var _0x47ba35 = _0xf5fb9b;
    return applyCharMap(squiggle5CharMap, '(◕︿◕✿)\x20' + _0x2a52f8 + _0x47ba35(0x487));
}

function sad1(_0x1cc3df) {
    var _0x103bfe = _0xf5fb9b;
    return applyCharMap(monospaceCharMap, _0x103bfe(0x134) + _0x1cc3df + _0x103bfe(0x49e));
}

function sad2(_0x3f2340) {
    var _0x460d4d = _0xf5fb9b;
    return applyCharMap(squiggleCharMap, _0x460d4d(0x429) + _0x3f2340 + _0x460d4d(0x1cf));
}

function sad3(_0x5b9cd1) {
    var _0x43b60b = _0xf5fb9b;
    return applyCharMap(italicCharMap, '(\x20◔\x20ʖ̯\x20◔\x20)\x20' + _0x5b9cd1 + _0x43b60b(0x14c));
}

function sad4(_0x333bed) {
    var _0x25e4a5 = _0xf5fb9b;
    return applyCharMap(squiggle3CharMap, _0x25e4a5(0x47d) + _0x333bed + _0x25e4a5(0x2ff));
}

function sad5(_0x583429) {
    var _0x135ffb = _0xf5fb9b;
    return applyCharMap(bentTextCharMap, _0x135ffb(0x419) + _0x583429 + _0x135ffb(0x29a));
}

function sad6(_0x8b731d) {
    var _0x5426a0 = _0xf5fb9b;
    return applyCharMap(medievalCharMap, _0x5426a0(0x326) + _0x8b731d + _0x5426a0(0x50b));
}

function sad7(_0x219c7a) {
    var _0x340a8a = _0xf5fb9b;
    return applyCharMap(symbolsCharMap, _0x340a8a(0x4d6) + _0x219c7a + '♦👺\x20（（●´∧｀●））');
}

function cuteText1(_0x101303) {
    var _0x37b075 = _0xf5fb9b;
    return applyCharMap(italicCharMap, _0x37b075(0x355) + _0x101303 + _0x37b075(0x355));
}

function cuteText2(_0x2bbd80) {
    var _0x2c4a82 = _0xf5fb9b;
    return applyCharMap(squiggle5CharMap, _0x2c4a82(0x394) + _0x2bbd80 + _0x2c4a82(0x45d));
}

function cuteText3(_0x44586f) {
    var _0x15b5f1 = _0xf5fb9b;
    return applyCharMap(oldEnglishCharMap, _0x15b5f1(0x3bf) + _0x44586f + _0x15b5f1(0xa1));
}

function cuteText4(_0x4e65c2) {
    var _0x25c3ac = _0xf5fb9b;
    return applyCharMap(squiggleCharMap, _0x25c3ac(0x4cc) + _0x4e65c2 + _0x25c3ac(0x25e));
}

function cuteText5(_0x2509f7) {
    var _0x5dc747 = _0xf5fb9b;
    return applyCharMap(cursiveCharMap, '🎯🍧' + _0x2509f7 + _0x5dc747(0xcf));
}

function fullCrazy1(_0x259b38) {
    var _0x549b3c = _0xf5fb9b;
    return applyCharMap(boldCharMap, '◥꧁ད\x20ॐ卐' + _0x259b38 + _0x549b3c(0x414));
}

function fullCrazy2(_0x32e486) {
    var _0x3e9c32 = _0xf5fb9b;
    return applyCharMap(squiggleCharMap, _0x3e9c32(0x2fa) + _0x32e486 + _0x3e9c32(0x4b0));
}

function fullCrazy3(_0x530f12) {
    var _0x6ef438 = _0xf5fb9b;
    return applyCharMap(doubleStruckCharMap, _0x6ef438(0x1d6) + _0x530f12 + '\x20]÷••)—\x20');
}

function fullCrazy4(_0x517699) {
    var _0x473297 = _0xf5fb9b;
    return applyCharMap(currencyCharMap, _0x473297(0x42) + _0x517699 + _0x473297(0x3b2));
}

function fullCrazy5(_0x474ad4) {
    var _0x37183a = _0xf5fb9b;
    return applyCharMap(wideTextCharMap, _0x37183a(0x519) + _0x474ad4 + '\x20✿◉●•◦');
}

function crazyWithFlourishOrSymbols3(_0x5e6310) {
    var _0x517f1a = _0xf5fb9b;
    return applyCharMap(italicCharMap, '⎝⎝✧GͥOͣDͫ✧⎠⎠' + _0x5e6310 + _0x517f1a(0x215));
}

function crazyWithFlourishOrSymbols4(_0x258ade) {
    var _0x2a9d88 = _0xf5fb9b;
    return applyCharMap(asianStyle2CharMap, '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20\x20' + _0x258ade + _0x2a9d88(0xf0));
}

function crazyWithFlourishOrSymbols1(_0x4b76cb) {
    return applyCharMap(italicCharMap, '⫷\x20\x20' + _0x4b76cb + '\x20⫸');
}

function crazyWithFlourishOrSymbols2(_0x41de2d) {
    var _0x18ed5a = _0xf5fb9b;
    return applyCharMap(boldItalicCharMap, _0x18ed5a(0x2b8) + _0x41de2d + '\x20»-(¯`v´¯)-»');
}

function crazyWithFlourishOrSymbols5(_0x14e532) {
    var _0x26bab2 = _0xf5fb9b;
    return applyCharMap(squaresCharMap, _0x26bab2(0x106) + _0x14e532 + _0x26bab2(0x28e));
}

function wrap1(_0xb24d2c) {
    var _0xd643f0 = _0xf5fb9b;
    return applyCharMap(boldCharMap, _0xd643f0(0x385) + [_0xb24d2c] + '═─◄█▓▒░');
}

function wrap2(_0x4e8d2a) {
    var _0x3f3932 = _0xf5fb9b;
    return applyCharMap(cursiveCharMap, _0x3f3932(0x465) + [_0x4e8d2a] + '\x20\x20█\x20▇\x20▆\x20▅\x20▄\x20▂▁');
}

function wrap3(_0x1bcda1) {
    var _0x22276c = _0xf5fb9b;
    return applyCharMap(boldItalicCharMap, _0x22276c(0x3b7) + [_0x1bcda1] + _0x22276c(0x1fa));
}

function wrap4(_0x48532b) {
    var _0x37651b = _0xf5fb9b;
    return applyCharMap(neonCharMap, _0x37651b(0x83) + [_0x48532b] + _0x37651b(0x3d3));
}

function wrap5(_0x3f558d) {
    var _0x580d63 = _0xf5fb9b;
    return applyCharMap(boldItalicCharMap, _0x580d63(0x133) + [_0x3f558d] + _0x580d63(0x1ee));
}
var newtext = {
    's1': {
        0x1: _0xf5fb9b(0x1ea),
        0x2: _0xf5fb9b(0x312),
        0x3: _0xf5fb9b(0x485),
        0x4: _0xf5fb9b(0x374),
        0x5: _0xf5fb9b(0x0),
        0x6: _0xf5fb9b(0x3bb),
        0x7: _0xf5fb9b(0x420),
        0x8: _0xf5fb9b(0x43c),
        0x9: '&iota;',
        0xa: _0xf5fb9b(0x3dd),
        0xb: _0xf5fb9b(0x4e0),
        0xc: _0xf5fb9b(0x29c),
        0xd: '&#625;',
        0xe: _0xf5fb9b(0x19a),
        0xf: _0xf5fb9b(0xff),
        0x10: _0xf5fb9b(0xe2),
        0x11: '&#985;',
        0x12: _0xf5fb9b(0x2b9),
        0x13: _0xf5fb9b(0x48e),
        0x14: _0xf5fb9b(0x4da),
        0x15: _0xf5fb9b(0x115),
        0x16: _0xf5fb9b(0x493),
        0x17: _0xf5fb9b(0x74),
        0x18: 'x',
        0x19: _0xf5fb9b(0x69),
        0x1a: _0xf5fb9b(0x4e4),
        0x1b: 'A',
        0x1c: 'B',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: 'E',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: 'K',
        0x26: 'L',
        0x27: 'M',
        0x28: 'N',
        0x29: 'O',
        0x2a: 'P',
        0x2b: 'Q',
        0x2c: 'R',
        0x2d: 'S',
        0x2e: 'T',
        0x2f: 'U',
        0x30: 'V',
        0x31: 'W',
        0x32: 'X',
        0x33: 'Y',
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's2': {
        0x1: _0xf5fb9b(0x1dd),
        0x2: '&#9837;',
        0x3: _0xf5fb9b(0x4cb),
        0x4: '&#9687;',
        0x5: _0xf5fb9b(0x315),
        0x6: '&#988;',
        0x7: _0xf5fb9b(0x4ee),
        0x8: '&#9796;',
        0x9: _0xf5fb9b(0xcb),
        0xa: '&#9834;',
        0xb: _0xf5fb9b(0x27a),
        0xc: _0xf5fb9b(0x4f2),
        0xd: _0xf5fb9b(0x3cd),
        0xe: _0xf5fb9b(0x24e),
        0xf: '&#8857;',
        0x10: _0xf5fb9b(0xe2),
        0x11: _0xf5fb9b(0x287),
        0x12: _0xf5fb9b(0x2a8),
        0x13: '&#9442;',
        0x14: '&#9730;',
        0x15: _0xf5fb9b(0x2b3),
        0x16: _0xf5fb9b(0x502),
        0x17: _0xf5fb9b(0x2d7),
        0x18: _0xf5fb9b(0x243),
        0x19: _0xf5fb9b(0x38d),
        0x1a: _0xf5fb9b(0xd9),
        0x1b: _0xf5fb9b(0x1dd),
        0x1c: '&#9837;',
        0x1d: _0xf5fb9b(0x4cb),
        0x1e: _0xf5fb9b(0x2fc),
        0x1f: _0xf5fb9b(0x315),
        0x20: '&#988;',
        0x21: _0xf5fb9b(0x4ee),
        0x22: _0xf5fb9b(0x227),
        0x23: _0xf5fb9b(0xcb),
        0x24: _0xf5fb9b(0x1cb),
        0x25: _0xf5fb9b(0x27a),
        0x26: '&#8627;',
        0x27: _0xf5fb9b(0x3cd),
        0x28: _0xf5fb9b(0x24e),
        0x29: '&#8857;',
        0x2a: _0xf5fb9b(0xe2),
        0x2b: _0xf5fb9b(0x287),
        0x2c: '&#9736;',
        0x2d: '&#9442;',
        0x2e: '&#9730;',
        0x2f: _0xf5fb9b(0x2b3),
        0x30: '&#10003;',
        0x31: _0xf5fb9b(0x2d7),
        0x32: _0xf5fb9b(0x243),
        0x33: _0xf5fb9b(0x38d),
        0x34: _0xf5fb9b(0xd9),
        0x35: _0xf5fb9b(0x492),
        0x36: _0xf5fb9b(0x45),
        0x37: _0xf5fb9b(0x2dd),
        0x38: '&#10125;',
        0x39: _0xf5fb9b(0x370),
        0x3a: '&#10127;',
        0x3b: '&#10128;',
        0x3c: _0xf5fb9b(0x11c),
        0x3d: _0xf5fb9b(0x12d),
        0x3e: '&#9450;'
    },
    's3': {
        0x1: _0xf5fb9b(0x31e),
        0x2: _0xf5fb9b(0x37),
        0x3: _0xf5fb9b(0xdc),
        0x4: _0xf5fb9b(0x50),
        0x5: '&#276;',
        0x6: _0xf5fb9b(0x314),
        0x7: _0xf5fb9b(0x3c0),
        0x8: '&#292;',
        0x9: _0xf5fb9b(0x249),
        0xa: _0xf5fb9b(0x111),
        0xb: _0xf5fb9b(0x441),
        0xc: '&#313;',
        0xd: _0xf5fb9b(0x382),
        0xe: '&#323;',
        0xf: _0xf5fb9b(0x25a),
        0x10: _0xf5fb9b(0x309),
        0x11: 'Q',
        0x12: '&#340;',
        0x13: _0xf5fb9b(0x41c),
        0x14: '&#356;',
        0x15: '&Uacute;',
        0x16: 'V',
        0x17: _0xf5fb9b(0x50d),
        0x18: _0xf5fb9b(0x26a),
        0x19: '&#374;',
        0x1a: '&#377;',
        0x1b: _0xf5fb9b(0x31e),
        0x1c: '&beta;',
        0x1d: '&#268;',
        0x1e: _0xf5fb9b(0x50),
        0x1f: '&#276;',
        0x20: '&#358;',
        0x21: _0xf5fb9b(0x3c0),
        0x22: _0xf5fb9b(0xbd),
        0x23: '&#296;',
        0x24: '&#308;',
        0x25: _0xf5fb9b(0x441),
        0x26: '&#313;',
        0x27: _0xf5fb9b(0x382),
        0x28: _0xf5fb9b(0x482),
        0x29: _0xf5fb9b(0x25a),
        0x2a: _0xf5fb9b(0x309),
        0x2b: 'Q',
        0x2c: _0xf5fb9b(0x3ca),
        0x2d: _0xf5fb9b(0x41c),
        0x2e: _0xf5fb9b(0x4d3),
        0x2f: _0xf5fb9b(0x498),
        0x30: 'V',
        0x31: _0xf5fb9b(0x50d),
        0x32: _0xf5fb9b(0x26a),
        0x33: _0xf5fb9b(0x49),
        0x34: _0xf5fb9b(0xe4),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's4': {
        0x1: _0xf5fb9b(0x157),
        0x2: 'q',
        0x3: _0xf5fb9b(0x21),
        0x4: 'p',
        0x5: '&#477;',
        0x6: _0xf5fb9b(0xc),
        0x7: _0xf5fb9b(0x373),
        0x8: '&#613;',
        0x9: '&#7433;',
        0xa: _0xf5fb9b(0x2b9),
        0xb: _0xf5fb9b(0x248),
        0xc: 'l',
        0xd: _0xf5fb9b(0x74),
        0xe: 'u',
        0xf: 'o',
        0x10: 'd',
        0x11: 'b',
        0x12: _0xf5fb9b(0x404),
        0x13: 's',
        0x14: '&#647;',
        0x15: 'n',
        0x16: _0xf5fb9b(0x456),
        0x17: _0xf5fb9b(0x413),
        0x18: 'x',
        0x19: _0xf5fb9b(0x2fb),
        0x1a: 'z',
        0x1b: _0xf5fb9b(0x157),
        0x1c: 'q',
        0x1d: _0xf5fb9b(0x21),
        0x1e: 'p',
        0x1f: _0xf5fb9b(0x217),
        0x20: _0xf5fb9b(0xc),
        0x21: _0xf5fb9b(0x373),
        0x22: _0xf5fb9b(0x43a),
        0x23: _0xf5fb9b(0x2fe),
        0x24: _0xf5fb9b(0x2b9),
        0x25: '&#670;',
        0x26: 'l',
        0x27: _0xf5fb9b(0x74),
        0x28: 'u',
        0x29: 'o',
        0x2a: 'd',
        0x2b: 'b',
        0x2c: _0xf5fb9b(0x404),
        0x2d: 's',
        0x2e: _0xf5fb9b(0x3f1),
        0x2f: 'n',
        0x30: '&#652;',
        0x31: '&#653;',
        0x32: 'x',
        0x33: _0xf5fb9b(0x2fb),
        0x34: 'z',
        0x35: _0xf5fb9b(0x25d),
        0x36: _0xf5fb9b(0x2ca),
        0x37: _0xf5fb9b(0xe7),
        0x38: '&#12579;',
        0x39: '&#987;',
        0x3a: '9',
        0x3b: _0xf5fb9b(0x50e),
        0x3c: '8',
        0x3d: '6',
        0x3e: '0'
    },
    's5': {
        0x1: _0xf5fb9b(0x2c9),
        0x2: '&beta;',
        0x3: '&#262;',
        0x4: _0xf5fb9b(0x4b1),
        0x5: '&euro;',
        0x6: _0xf5fb9b(0x37b),
        0x7: _0xf5fb9b(0x2af),
        0x8: _0xf5fb9b(0x13f),
        0x9: _0xf5fb9b(0x2de),
        0xa: _0xf5fb9b(0x111),
        0xb: _0xf5fb9b(0x206),
        0xc: '&#321;',
        0xd: _0xf5fb9b(0x375),
        0xe: _0xf5fb9b(0x1e6),
        0xf: _0xf5fb9b(0x20c),
        0x10: _0xf5fb9b(0x102),
        0x11: _0xf5fb9b(0x4d),
        0x12: _0xf5fb9b(0x29),
        0x13: '&#350;',
        0x14: _0xf5fb9b(0x314),
        0x15: _0xf5fb9b(0x105),
        0x16: 'V',
        0x17: '&#372;',
        0x18: _0xf5fb9b(0x26a),
        0x19: _0xf5fb9b(0xac),
        0x1a: _0xf5fb9b(0x276),
        0x1b: '&Delta;',
        0x1c: _0xf5fb9b(0x37),
        0x1d: _0xf5fb9b(0x49a),
        0x1e: '&#272;',
        0x1f: _0xf5fb9b(0x315),
        0x20: '&#8355;',
        0x21: '&#484;',
        0x22: '&#294;',
        0x23: _0xf5fb9b(0x2de),
        0x24: '&#308;',
        0x25: _0xf5fb9b(0x206),
        0x26: _0xf5fb9b(0x1ac),
        0x27: _0xf5fb9b(0x375),
        0x28: _0xf5fb9b(0x1e6),
        0x29: _0xf5fb9b(0x20c),
        0x2a: _0xf5fb9b(0x102),
        0x2b: _0xf5fb9b(0x4d),
        0x2c: _0xf5fb9b(0x29),
        0x2d: _0xf5fb9b(0x2df),
        0x2e: _0xf5fb9b(0x314),
        0x2f: _0xf5fb9b(0x105),
        0x30: 'V',
        0x31: _0xf5fb9b(0x50d),
        0x32: _0xf5fb9b(0x26a),
        0x33: _0xf5fb9b(0xac),
        0x34: _0xf5fb9b(0x276),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's6': {
        0x1: _0xf5fb9b(0x1ea),
        0x2: _0xf5fb9b(0x357),
        0x3: _0xf5fb9b(0x137),
        0x4: _0xf5fb9b(0x506),
        0x5: _0xf5fb9b(0x3eb),
        0x6: '&fnof;',
        0x7: _0xf5fb9b(0x420),
        0x8: _0xf5fb9b(0x50c),
        0x9: '&#3648;',
        0xa: '&#669;',
        0xb: '&#1185;',
        0xc: _0xf5fb9b(0x1b0),
        0xd: '&#625;',
        0xe: _0xf5fb9b(0x19a),
        0xf: _0xf5fb9b(0xff),
        0x10: _0xf5fb9b(0xe2),
        0x11: _0xf5fb9b(0x144),
        0x12: _0xf5fb9b(0x12e),
        0x13: _0xf5fb9b(0x400),
        0x14: _0xf5fb9b(0x4b6),
        0x15: '&micro;',
        0x16: '&#1141;',
        0x17: _0xf5fb9b(0x2d7),
        0x18: _0xf5fb9b(0x18d),
        0x19: _0xf5fb9b(0x69),
        0x1a: _0xf5fb9b(0x35b),
        0x1b: _0xf5fb9b(0x1ea),
        0x1c: _0xf5fb9b(0x357),
        0x1d: '&#2798;',
        0x1e: _0xf5fb9b(0x506),
        0x1f: _0xf5fb9b(0x3eb),
        0x20: '&fnof;',
        0x21: '&#608;',
        0x22: _0xf5fb9b(0x50c),
        0x23: _0xf5fb9b(0x4ca),
        0x24: _0xf5fb9b(0x3dd),
        0x25: _0xf5fb9b(0x350),
        0x26: _0xf5fb9b(0x1b0),
        0x27: '&#625;',
        0x28: _0xf5fb9b(0x19a),
        0x29: '&sigma;',
        0x2a: _0xf5fb9b(0xe2),
        0x2b: _0xf5fb9b(0x144),
        0x2c: _0xf5fb9b(0x12e),
        0x2d: _0xf5fb9b(0x400),
        0x2e: _0xf5fb9b(0x4b6),
        0x2f: _0xf5fb9b(0x3f7),
        0x30: _0xf5fb9b(0x4f4),
        0x31: _0xf5fb9b(0x2d7),
        0x32: _0xf5fb9b(0x18d),
        0x33: _0xf5fb9b(0x69),
        0x34: _0xf5fb9b(0x35b),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's7': {
        0x1: _0xf5fb9b(0x4ac),
        0x2: _0xf5fb9b(0x3ee),
        0x3: _0xf5fb9b(0x4a3),
        0x4: _0xf5fb9b(0xcc),
        0x5: _0xf5fb9b(0x1e5),
        0x6: _0xf5fb9b(0xaf),
        0x7: _0xf5fb9b(0x2af),
        0x8: _0xf5fb9b(0x342),
        0x9: _0xf5fb9b(0xb4),
        0xa: _0xf5fb9b(0x139),
        0xb: _0xf5fb9b(0x2aa),
        0xc: _0xf5fb9b(0x57),
        0xd: '&#5616;',
        0xe: _0xf5fb9b(0x12c),
        0xf: _0xf5fb9b(0x7b),
        0x10: _0xf5fb9b(0x510),
        0x11: _0xf5fb9b(0x72),
        0x12: _0xf5fb9b(0x15e),
        0x13: _0xf5fb9b(0x49d),
        0x14: '&#19973;',
        0x15: _0xf5fb9b(0x3a3),
        0x16: '&#5167;',
        0x17: _0xf5fb9b(0x4b8),
        0x18: _0xf5fb9b(0x23f),
        0x19: _0xf5fb9b(0x195),
        0x1a: _0xf5fb9b(0x126),
        0x1b: _0xf5fb9b(0x4ac),
        0x1c: _0xf5fb9b(0x3ee),
        0x1d: _0xf5fb9b(0x4a3),
        0x1e: _0xf5fb9b(0xcc),
        0x1f: '&#5620;',
        0x20: _0xf5fb9b(0xaf),
        0x21: _0xf5fb9b(0x2af),
        0x22: _0xf5fb9b(0x342),
        0x23: _0xf5fb9b(0xb4),
        0x24: '&#5262;',
        0x25: '&#5845;',
        0x26: '&#5290;',
        0x27: _0xf5fb9b(0x8f),
        0x28: _0xf5fb9b(0x12c),
        0x29: _0xf5fb9b(0x7b),
        0x2a: _0xf5fb9b(0x510),
        0x2b: _0xf5fb9b(0x72),
        0x2c: _0xf5fb9b(0x15e),
        0x2d: _0xf5fb9b(0x49d),
        0x2e: _0xf5fb9b(0x15a),
        0x2f: _0xf5fb9b(0x3a3),
        0x30: _0xf5fb9b(0x94),
        0x31: '&#5615;',
        0x32: '&#5741;',
        0x33: _0xf5fb9b(0x195),
        0x34: '&#20057;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's8': {
        0x1: _0xf5fb9b(0x3c),
        0x2: '&#4329;',
        0x3: _0xf5fb9b(0x25f),
        0x4: _0xf5fb9b(0x323),
        0x5: _0xf5fb9b(0xbc),
        0x6: 'f',
        0x7: _0xf5fb9b(0x108),
        0x8: 'h',
        0x9: _0xf5fb9b(0x4e8),
        0xa: _0xf5fb9b(0x107),
        0xb: _0xf5fb9b(0x285),
        0xc: 'l',
        0xd: '&#4317;',
        0xe: '&#8134;',
        0xf: '&otilde;',
        0x10: _0xf5fb9b(0xe2),
        0x11: _0xf5fb9b(0x46d),
        0x12: '&Gamma;',
        0x13: _0xf5fb9b(0x1a),
        0x14: '&#3923;',
        0x15: _0xf5fb9b(0x115),
        0x16: _0xf5fb9b(0x2f3),
        0x17: 'w',
        0x18: _0xf5fb9b(0x2ed),
        0x19: _0xf5fb9b(0x69),
        0x1a: _0xf5fb9b(0x3be),
        0x1b: '&#4315;',
        0x1c: _0xf5fb9b(0x1ad),
        0x1d: _0xf5fb9b(0x25f),
        0x1e: '&#4331;',
        0x1f: _0xf5fb9b(0xbc),
        0x20: 'f',
        0x21: _0xf5fb9b(0x108),
        0x22: 'h',
        0x23: _0xf5fb9b(0x4e8),
        0x24: '&#4325;',
        0x25: _0xf5fb9b(0x285),
        0x26: 'l',
        0x27: _0xf5fb9b(0x244),
        0x28: _0xf5fb9b(0x396),
        0x29: _0xf5fb9b(0x68),
        0x2a: _0xf5fb9b(0xe2),
        0x2b: _0xf5fb9b(0x46d),
        0x2c: _0xf5fb9b(0x48a),
        0x2d: '&#4336;',
        0x2e: _0xf5fb9b(0x32e),
        0x2f: _0xf5fb9b(0x115),
        0x30: '&#8023;',
        0x31: 'w',
        0x32: _0xf5fb9b(0x2ed),
        0x33: _0xf5fb9b(0x69),
        0x34: _0xf5fb9b(0x3be),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's9': {
        0x1: '&#940;',
        0x2: _0xf5fb9b(0x329),
        0x3: _0xf5fb9b(0x362),
        0x4: _0xf5fb9b(0x367),
        0x5: _0xf5fb9b(0x6e),
        0x6: _0xf5fb9b(0x3fe),
        0x7: _0xf5fb9b(0x515),
        0x8: _0xf5fb9b(0x451),
        0x9: '&#943;',
        0xa: _0xf5fb9b(0x188),
        0xb: _0xf5fb9b(0x70),
        0xc: _0xf5fb9b(0x31a),
        0xd: _0xf5fb9b(0x152),
        0xe: _0xf5fb9b(0xe6),
        0xf: _0xf5fb9b(0x2c7),
        0x10: _0xf5fb9b(0xe2),
        0x11: 'q',
        0x12: _0xf5fb9b(0x518),
        0x13: '&#351;',
        0x14: '&#355;',
        0x15: _0xf5fb9b(0x46b),
        0x16: _0xf5fb9b(0x21a),
        0x17: _0xf5fb9b(0x211),
        0x18: 'x',
        0x19: '&#1095;',
        0x1a: _0xf5fb9b(0x3c1),
        0x1b: _0xf5fb9b(0x4ba),
        0x1c: '&#1074;',
        0x1d: _0xf5fb9b(0x362),
        0x1e: _0xf5fb9b(0x367),
        0x1f: '&#941;',
        0x20: _0xf5fb9b(0x3fe),
        0x21: _0xf5fb9b(0x515),
        0x22: _0xf5fb9b(0x451),
        0x23: '&#943;',
        0x24: _0xf5fb9b(0x188),
        0x25: _0xf5fb9b(0x70),
        0x26: '&#315;',
        0x27: '&#1084;',
        0x28: _0xf5fb9b(0xe6),
        0x29: '&#972;',
        0x2a: '&rho;',
        0x2b: 'q',
        0x2c: _0xf5fb9b(0x518),
        0x2d: _0xf5fb9b(0x3bc),
        0x2e: _0xf5fb9b(0x2ee),
        0x2f: _0xf5fb9b(0x46b),
        0x30: '&nu;',
        0x31: _0xf5fb9b(0x211),
        0x32: 'x',
        0x33: _0xf5fb9b(0x1bd),
        0x34: _0xf5fb9b(0x3c1),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's10': {
        0x1: _0xf5fb9b(0x123),
        0x2: '&#41155;',
        0x3: _0xf5fb9b(0xaa),
        0x4: _0xf5fb9b(0x471),
        0x5: '&#41823;',
        0x6: _0xf5fb9b(0x2c),
        0x7: _0xf5fb9b(0x391),
        0x8: _0xf5fb9b(0x336),
        0x9: _0xf5fb9b(0xeb),
        0xa: '&#41005;',
        0xb: _0xf5fb9b(0x488),
        0xc: _0xf5fb9b(0x289),
        0xd: _0xf5fb9b(0x428),
        0xe: _0xf5fb9b(0x20a),
        0xf: _0xf5fb9b(0x19c),
        0x10: _0xf5fb9b(0x16e),
        0x11: '&#41080;',
        0x12: _0xf5fb9b(0x3b1),
        0x13: _0xf5fb9b(0x95),
        0x14: '&#42181;',
        0x15: _0xf5fb9b(0x28d),
        0x16: _0xf5fb9b(0x298),
        0x17: '&#41296;',
        0x18: _0xf5fb9b(0x38),
        0x19: _0xf5fb9b(0x28f),
        0x1a: _0xf5fb9b(0xe0),
        0x1b: _0xf5fb9b(0x123),
        0x1c: _0xf5fb9b(0x46c),
        0x1d: '&#41976;',
        0x1e: _0xf5fb9b(0x471),
        0x1f: '&#41823;',
        0x20: _0xf5fb9b(0x2c),
        0x21: '&#41037;',
        0x22: '&#42075;',
        0x23: _0xf5fb9b(0xeb),
        0x24: _0xf5fb9b(0x136),
        0x25: _0xf5fb9b(0x488),
        0x26: _0xf5fb9b(0x289),
        0x27: _0xf5fb9b(0x428),
        0x28: '&#41081;',
        0x29: '&#41346;',
        0x2a: '&#41571;',
        0x2b: _0xf5fb9b(0x48),
        0x2c: '&#42131;',
        0x2d: '&#41754;',
        0x2e: _0xf5fb9b(0x433),
        0x2f: '&#41991;',
        0x30: _0xf5fb9b(0x298),
        0x31: _0xf5fb9b(0x233),
        0x32: _0xf5fb9b(0x38),
        0x33: '&#42015;',
        0x34: _0xf5fb9b(0xe0),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's11': {
        0x1: _0xf5fb9b(0x1a0),
        0x2: _0xf5fb9b(0x408),
        0x3: 'C',
        0x4: 'D',
        0x5: _0xf5fb9b(0x352),
        0x6: 'F',
        0x7: 'G',
        0x8: 'H',
        0x9: 'I',
        0xa: 'J',
        0xb: _0xf5fb9b(0x206),
        0xc: 'L',
        0xd: 'M',
        0xe: _0xf5fb9b(0x389),
        0xf: _0xf5fb9b(0x332),
        0x10: 'P',
        0x11: _0xf5fb9b(0x39c),
        0x12: _0xf5fb9b(0x1e8),
        0x13: 'S',
        0x14: '&Gamma;',
        0x15: '&#1062;',
        0x16: 'V',
        0x17: _0xf5fb9b(0x32),
        0x18: '&#1046;',
        0x19: '&#1059;',
        0x1a: 'Z',
        0x1b: '&#1044;',
        0x1c: '&#1041;',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: _0xf5fb9b(0x352),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: _0xf5fb9b(0x206),
        0x26: 'L',
        0x27: 'M',
        0x28: '&#1048;',
        0x29: _0xf5fb9b(0x332),
        0x2a: 'P',
        0x2b: '&#490;',
        0x2c: '&#1071;',
        0x2d: 'S',
        0x2e: _0xf5fb9b(0x48a),
        0x2f: _0xf5fb9b(0x337),
        0x30: 'V',
        0x31: '&#1065;',
        0x32: _0xf5fb9b(0x26a),
        0x33: '&#1059;',
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's12': {
        0x1: _0xf5fb9b(0x1dd),
        0x2: _0xf5fb9b(0x2d4),
        0x3: _0xf5fb9b(0x47f),
        0x4: _0xf5fb9b(0x2bc),
        0x5: '&#41823;',
        0x6: _0xf5fb9b(0x3c5),
        0x7: _0xf5fb9b(0x410),
        0x8: _0xf5fb9b(0x36f),
        0x9: _0xf5fb9b(0x4f1),
        0xa: _0xf5fb9b(0x136),
        0xb: _0xf5fb9b(0x40b),
        0xc: _0xf5fb9b(0x289),
        0xd: _0xf5fb9b(0x192),
        0xe: '&#41508;',
        0xf: '&#41126;',
        0x10: _0xf5fb9b(0x16e),
        0x11: '&#41392;',
        0x12: _0xf5fb9b(0x2b0),
        0x13: '&#41751;',
        0x14: _0xf5fb9b(0x2c5),
        0x15: _0xf5fb9b(0x30b),
        0x16: _0xf5fb9b(0x3e4),
        0x17: _0xf5fb9b(0xa4),
        0x18: _0xf5fb9b(0x22b),
        0x19: _0xf5fb9b(0x218),
        0x1a: _0xf5fb9b(0xe0),
        0x1b: '&#41807;',
        0x1c: '&#41731;',
        0x1d: _0xf5fb9b(0x47f),
        0x1e: _0xf5fb9b(0x2bc),
        0x1f: _0xf5fb9b(0xa8),
        0x20: _0xf5fb9b(0x3c5),
        0x21: _0xf5fb9b(0x410),
        0x22: _0xf5fb9b(0x36f),
        0x23: _0xf5fb9b(0x4f1),
        0x24: _0xf5fb9b(0x136),
        0x25: '&#40984;',
        0x26: _0xf5fb9b(0x289),
        0x27: _0xf5fb9b(0x192),
        0x28: _0xf5fb9b(0x386),
        0x29: _0xf5fb9b(0x4c2),
        0x2a: _0xf5fb9b(0x16e),
        0x2b: '&#41392;',
        0x2c: _0xf5fb9b(0x2b0),
        0x2d: _0xf5fb9b(0xc4),
        0x2e: _0xf5fb9b(0x2c5),
        0x2f: _0xf5fb9b(0x30b),
        0x30: _0xf5fb9b(0x3e4),
        0x31: _0xf5fb9b(0xa4),
        0x32: _0xf5fb9b(0x22b),
        0x33: _0xf5fb9b(0x218),
        0x34: _0xf5fb9b(0xe0),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's13': {
        0x1: '&#41708;',
        0x2: _0xf5fb9b(0x517),
        0x3: _0xf5fb9b(0x27),
        0x4: _0xf5fb9b(0x4fb),
        0x5: '&#41922;',
        0x6: '&#41648;',
        0x7: _0xf5fb9b(0x4b7),
        0x8: '&#41053;',
        0x9: _0xf5fb9b(0x302),
        0xa: _0xf5fb9b(0x333),
        0xb: _0xf5fb9b(0x40b),
        0xc: '&#42130;',
        0xd: '&#41141;',
        0xe: _0xf5fb9b(0x44f),
        0xf: '&#41266;',
        0x10: _0xf5fb9b(0x16e),
        0x11: '&#41392;',
        0x12: _0xf5fb9b(0x2b0),
        0x13: _0xf5fb9b(0x48f),
        0x14: _0xf5fb9b(0x2c5),
        0x15: _0xf5fb9b(0x3f8),
        0x16: _0xf5fb9b(0x24c),
        0x17: '&#41296;',
        0x18: _0xf5fb9b(0x14f),
        0x19: _0xf5fb9b(0x3e),
        0x1a: _0xf5fb9b(0xe0),
        0x1b: _0xf5fb9b(0xc8),
        0x1c: _0xf5fb9b(0x517),
        0x1d: _0xf5fb9b(0x27),
        0x1e: _0xf5fb9b(0x4fb),
        0x1f: '&#41922;',
        0x20: _0xf5fb9b(0x432),
        0x21: '&#41804;',
        0x22: _0xf5fb9b(0x3d2),
        0x23: _0xf5fb9b(0x302),
        0x24: _0xf5fb9b(0x333),
        0x25: '&#40984;',
        0x26: _0xf5fb9b(0x289),
        0x27: _0xf5fb9b(0x192),
        0x28: _0xf5fb9b(0x44f),
        0x29: _0xf5fb9b(0x334),
        0x2a: _0xf5fb9b(0x16e),
        0x2b: _0xf5fb9b(0x347),
        0x2c: _0xf5fb9b(0x2b0),
        0x2d: _0xf5fb9b(0x48f),
        0x2e: _0xf5fb9b(0x2c5),
        0x2f: _0xf5fb9b(0x3f8),
        0x30: '&#42150;',
        0x31: _0xf5fb9b(0x233),
        0x32: _0xf5fb9b(0x14f),
        0x33: _0xf5fb9b(0x3e),
        0x34: _0xf5fb9b(0xe0),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's14': {
        0x1: _0xf5fb9b(0x3e9),
        0x2: _0xf5fb9b(0x321),
        0x3: '&#12552;',
        0x4: _0xf5fb9b(0x23d),
        0x5: '&#400;',
        0x6: 'F',
        0x7: _0xf5fb9b(0x37a),
        0x8: '&#1085;',
        0x9: _0xf5fb9b(0x2a6),
        0xa: _0xf5fb9b(0x31),
        0xb: '&#1178;',
        0xc: '&#321;',
        0xd: _0xf5fb9b(0x15),
        0xe: _0xf5fb9b(0x15d),
        0xf: _0xf5fb9b(0x20c),
        0x10: '&thorn;',
        0x11: _0xf5fb9b(0x31d),
        0x12: _0xf5fb9b(0x27e),
        0x13: _0xf5fb9b(0x25c),
        0x14: _0xf5fb9b(0x4d3),
        0x15: '&#1062;',
        0x16: '&#404;',
        0x17: _0xf5fb9b(0x359),
        0x18: _0xf5fb9b(0x12b),
        0x19: _0xf5fb9b(0x2d),
        0x1a: '&#7828;',
        0x1b: '&Lambda;',
        0x1c: '&#998;',
        0x1d: '&#12552;',
        0x1e: '&ETH;',
        0x1f: '&#400;',
        0x20: 'F',
        0x21: '&#403;',
        0x22: '&#1085;',
        0x23: _0xf5fb9b(0x2a6),
        0x24: _0xf5fb9b(0x31),
        0x25: _0xf5fb9b(0xad),
        0x26: '&#321;',
        0x27: _0xf5fb9b(0x15),
        0x28: _0xf5fb9b(0x15d),
        0x29: _0xf5fb9b(0x20c),
        0x2a: '&thorn;',
        0x2b: '&#1192;',
        0x2c: _0xf5fb9b(0x27e),
        0x2d: '&#12425;',
        0x2e: _0xf5fb9b(0x4d3),
        0x2f: '&#1062;',
        0x30: _0xf5fb9b(0x20d),
        0x31: _0xf5fb9b(0x359),
        0x32: _0xf5fb9b(0x12b),
        0x33: _0xf5fb9b(0x2d),
        0x34: '&#7828;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's15': {
        0x1: _0xf5fb9b(0x231),
        0x2: '&#385;',
        0x3: _0xf5fb9b(0x24f),
        0x4: _0xf5fb9b(0x1b6),
        0x5: '&#1028;',
        0x6: '&#401;',
        0x7: _0xf5fb9b(0x37a),
        0x8: _0xf5fb9b(0x97),
        0x9: _0xf5fb9b(0x25d),
        0xa: _0xf5fb9b(0xbf),
        0xb: '&#408;',
        0xc: _0xf5fb9b(0x37f),
        0xd: 'M',
        0xe: '&#413;',
        0xf: '&#416;',
        0x10: _0xf5fb9b(0x102),
        0x11: _0xf5fb9b(0x4bd),
        0x12: _0xf5fb9b(0xd),
        0x13: _0xf5fb9b(0x255),
        0x14: _0xf5fb9b(0x41a),
        0x15: _0xf5fb9b(0x81),
        0x16: '&#404;',
        0x17: '&#412;',
        0x18: _0xf5fb9b(0x495),
        0x19: _0xf5fb9b(0x195),
        0x1a: _0xf5fb9b(0x21b),
        0x1b: '&#411;',
        0x1c: _0xf5fb9b(0x3e0),
        0x1d: _0xf5fb9b(0x24f),
        0x1e: _0xf5fb9b(0x1b6),
        0x1f: _0xf5fb9b(0x203),
        0x20: '&#401;',
        0x21: _0xf5fb9b(0x37a),
        0x22: '&#1223;',
        0x23: _0xf5fb9b(0x25d),
        0x24: _0xf5fb9b(0xbf),
        0x25: _0xf5fb9b(0x4cf),
        0x26: _0xf5fb9b(0x37f),
        0x27: 'M',
        0x28: _0xf5fb9b(0x212),
        0x29: _0xf5fb9b(0x4b5),
        0x2a: _0xf5fb9b(0x102),
        0x2b: _0xf5fb9b(0x4bd),
        0x2c: _0xf5fb9b(0xd),
        0x2d: '&#423;',
        0x2e: _0xf5fb9b(0x41a),
        0x2f: _0xf5fb9b(0x81),
        0x30: _0xf5fb9b(0x20d),
        0x31: _0xf5fb9b(0x359),
        0x32: _0xf5fb9b(0x495),
        0x33: _0xf5fb9b(0x195),
        0x34: '&#548;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's16': {
        0x1: _0xf5fb9b(0x1c6),
        0x2: _0xf5fb9b(0x174),
        0x3: _0xf5fb9b(0x388),
        0x4: _0xf5fb9b(0x16b),
        0x5: _0xf5fb9b(0x476),
        0x6: _0xf5fb9b(0x20),
        0x7: _0xf5fb9b(0x410),
        0x8: _0xf5fb9b(0x3a9),
        0x9: _0xf5fb9b(0xeb),
        0xa: '&#42171;',
        0xb: _0xf5fb9b(0x488),
        0xc: _0xf5fb9b(0x289),
        0xd: '&#41141;',
        0xe: _0xf5fb9b(0x44f),
        0xf: _0xf5fb9b(0x4c2),
        0x10: _0xf5fb9b(0x16e),
        0x11: '&#41079;',
        0x12: _0xf5fb9b(0x307),
        0x13: _0xf5fb9b(0x95),
        0x14: '&#41686;',
        0x15: _0xf5fb9b(0x28d),
        0x16: '&#41008;',
        0x17: _0xf5fb9b(0xa4),
        0x18: _0xf5fb9b(0x258),
        0x19: _0xf5fb9b(0x1ca),
        0x1a: _0xf5fb9b(0xe0),
        0x1b: _0xf5fb9b(0x1c6),
        0x1c: _0xf5fb9b(0x174),
        0x1d: _0xf5fb9b(0x388),
        0x1e: _0xf5fb9b(0x16b),
        0x1f: _0xf5fb9b(0x476),
        0x20: _0xf5fb9b(0x20),
        0x21: _0xf5fb9b(0x410),
        0x22: _0xf5fb9b(0x3a9),
        0x23: '&#41105;',
        0x24: _0xf5fb9b(0x333),
        0x25: '&#40983;',
        0x26: '&#42130;',
        0x27: _0xf5fb9b(0x192),
        0x28: _0xf5fb9b(0x44f),
        0x29: '&#41126;',
        0x2a: '&#41571;',
        0x2b: _0xf5fb9b(0x453),
        0x2c: _0xf5fb9b(0x307),
        0x2d: _0xf5fb9b(0x95),
        0x2e: _0xf5fb9b(0xea),
        0x2f: _0xf5fb9b(0x28d),
        0x30: _0xf5fb9b(0x23e),
        0x31: _0xf5fb9b(0xa4),
        0x32: '&#41426;',
        0x33: _0xf5fb9b(0x1ca),
        0x34: _0xf5fb9b(0xe0),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's17': {
        0x1: '&#1337;',
        0x2: _0xf5fb9b(0x4),
        0x3: _0xf5fb9b(0x172),
        0x4: _0xf5fb9b(0x2c6),
        0x5: _0xf5fb9b(0x202),
        0x6: _0xf5fb9b(0x140),
        0x7: _0xf5fb9b(0x42e),
        0x8: _0xf5fb9b(0x30f),
        0x9: _0xf5fb9b(0x3b8),
        0xa: '&#669;',
        0xb: '&#409;',
        0xc: _0xf5fb9b(0x29c),
        0xd: '&#653;',
        0xe: _0xf5fb9b(0x3fd),
        0xf: '&#1342;',
        0x10: _0xf5fb9b(0xe2),
        0x11: _0xf5fb9b(0x144),
        0x12: _0xf5fb9b(0x516),
        0x13: _0xf5fb9b(0x340),
        0x14: '&#1333;',
        0x15: '&#1348;',
        0x16: _0xf5fb9b(0x2f8),
        0x17: _0xf5fb9b(0x380),
        0x18: _0xf5fb9b(0x3de),
        0x19: '&#1358;',
        0x1a: _0xf5fb9b(0x2f1),
        0x1b: _0xf5fb9b(0x187),
        0x1c: _0xf5fb9b(0x4),
        0x1d: _0xf5fb9b(0x172),
        0x1e: _0xf5fb9b(0x2c6),
        0x1f: _0xf5fb9b(0x202),
        0x20: _0xf5fb9b(0x140),
        0x21: _0xf5fb9b(0x42e),
        0x22: _0xf5fb9b(0x30f),
        0x23: '&#639;',
        0x24: '&#669;',
        0x25: _0xf5fb9b(0x4e0),
        0x26: _0xf5fb9b(0x29c),
        0x27: _0xf5fb9b(0x413),
        0x28: _0xf5fb9b(0x3fd),
        0x29: _0xf5fb9b(0x1cc),
        0x2a: _0xf5fb9b(0xe2),
        0x2b: '&phi;',
        0x2c: _0xf5fb9b(0x516),
        0x2d: _0xf5fb9b(0x340),
        0x2e: _0xf5fb9b(0x313),
        0x2f: '&#1348;',
        0x30: _0xf5fb9b(0x2f8),
        0x31: _0xf5fb9b(0x380),
        0x32: _0xf5fb9b(0x3de),
        0x33: _0xf5fb9b(0x1db),
        0x34: _0xf5fb9b(0x2f1),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's18': {
        0x1: _0xf5fb9b(0x1ea),
        0x2: '&szlig;',
        0x3: _0xf5fb9b(0x362),
        0x4: 'd',
        0x5: _0xf5fb9b(0x3eb),
        0x6: _0xf5fb9b(0x184),
        0x7: 'g',
        0x8: 'h',
        0x9: '&iuml;',
        0xa: _0xf5fb9b(0x29d),
        0xb: _0xf5fb9b(0x285),
        0xc: '&#65434;',
        0xd: 'm',
        0xe: _0xf5fb9b(0xd7),
        0xf: _0xf5fb9b(0x397),
        0x10: 'p',
        0x11: _0xf5fb9b(0x4d),
        0x12: 'r',
        0x13: '&scaron;',
        0x14: '&dagger;',
        0x15: 'u',
        0x16: _0xf5fb9b(0x14d),
        0x17: _0xf5fb9b(0x2d7),
        0x18: 'x',
        0x19: _0xf5fb9b(0x1ef),
        0x1a: 'z',
        0x1b: '&alpha;',
        0x1c: '&szlig;',
        0x1d: _0xf5fb9b(0x362),
        0x1e: 'd',
        0x1f: _0xf5fb9b(0x3eb),
        0x20: _0xf5fb9b(0x184),
        0x21: 'g',
        0x22: 'h',
        0x23: '&iuml;',
        0x24: _0xf5fb9b(0x29d),
        0x25: _0xf5fb9b(0x285),
        0x26: _0xf5fb9b(0x49c),
        0x27: 'm',
        0x28: _0xf5fb9b(0xd7),
        0x29: _0xf5fb9b(0x397),
        0x2a: 'p',
        0x2b: _0xf5fb9b(0x4d),
        0x2c: 'r',
        0x2d: _0xf5fb9b(0x7c),
        0x2e: _0xf5fb9b(0x4fa),
        0x2f: 'u',
        0x30: _0xf5fb9b(0x14d),
        0x31: _0xf5fb9b(0x2d7),
        0x32: 'x',
        0x33: _0xf5fb9b(0x1ef),
        0x34: 'z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's19': {
        0x1: _0xf5fb9b(0x19e),
        0x2: _0xf5fb9b(0x108),
        0x3: '&#2414;',
        0x4: _0xf5fb9b(0x323),
        0x5: _0xf5fb9b(0x1ba),
        0x6: _0xf5fb9b(0x140),
        0x7: '&#2797;',
        0x8: _0xf5fb9b(0x1fe),
        0x9: _0xf5fb9b(0x3b8),
        0xa: _0xf5fb9b(0xbf),
        0xb: _0xf5fb9b(0x320),
        0xc: _0xf5fb9b(0x322),
        0xd: '&#625;',
        0xe: '&#1352;',
        0xf: _0xf5fb9b(0x3f0),
        0x10: '&#447;',
        0x11: _0xf5fb9b(0x2e7),
        0x12: _0xf5fb9b(0x516),
        0x13: '&sigmaf;',
        0x14: '&#2670;',
        0x15: _0xf5fb9b(0x115),
        0x16: _0xf5fb9b(0xe5),
        0x17: _0xf5fb9b(0x2d7),
        0x18: _0xf5fb9b(0x1b9),
        0x19: _0xf5fb9b(0x2f8),
        0x1a: _0xf5fb9b(0x43d),
        0x1b: '&#3588;',
        0x1c: '&#4330;',
        0x1d: _0xf5fb9b(0x358),
        0x1e: _0xf5fb9b(0x323),
        0x1f: _0xf5fb9b(0x1ba),
        0x20: '&#1330;',
        0x21: _0xf5fb9b(0x29b),
        0x22: '&#1210;',
        0x23: _0xf5fb9b(0x3b8),
        0x24: '&#646;',
        0x25: _0xf5fb9b(0x320),
        0x26: _0xf5fb9b(0x322),
        0x27: _0xf5fb9b(0x197),
        0x28: _0xf5fb9b(0x2f4),
        0x29: _0xf5fb9b(0x3f0),
        0x2a: '&#447;',
        0x2b: _0xf5fb9b(0x2e7),
        0x2c: _0xf5fb9b(0x516),
        0x2d: _0xf5fb9b(0x362),
        0x2e: '&#2670;',
        0x2f: _0xf5fb9b(0x115),
        0x30: _0xf5fb9b(0xe5),
        0x31: '&omega;',
        0x32: _0xf5fb9b(0x1b9),
        0x33: '&#1506;',
        0x34: '&#2749;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's20': {
        0x1: _0xf5fb9b(0x183),
        0x2: '&#1073;',
        0x3: 'c',
        0x4: _0xf5fb9b(0x1d5),
        0x5: _0xf5fb9b(0x79),
        0x6: 'f',
        0x7: 'g',
        0x8: '&#1085;',
        0x9: _0xf5fb9b(0x47b),
        0xa: 'j',
        0xb: '&#1082;',
        0xc: _0xf5fb9b(0xe9),
        0xd: _0xf5fb9b(0x299),
        0xe: '&#1087;',
        0xf: _0xf5fb9b(0x251),
        0x10: 'p',
        0x11: _0xf5fb9b(0x1f9),
        0x12: _0xf5fb9b(0x360),
        0x13: '$',
        0x14: '&#1090;',
        0x15: _0xf5fb9b(0x270),
        0x16: '&#1141;',
        0x17: _0xf5fb9b(0x178),
        0x18: '&#1078;',
        0x19: '&#1095;',
        0x1a: _0xf5fb9b(0x4c7),
        0x1b: '&#1040;',
        0x1c: _0xf5fb9b(0x408),
        0x1d: 'C',
        0x1e: '&#1044;',
        0x1f: _0xf5fb9b(0x203),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: _0xf5fb9b(0x154),
        0x24: 'J',
        0x25: '&#1050;',
        0x26: _0xf5fb9b(0x3cb),
        0x27: _0xf5fb9b(0x33d),
        0x28: _0xf5fb9b(0x3b6),
        0x29: _0xf5fb9b(0x238),
        0x2a: 'P',
        0x2b: _0xf5fb9b(0x332),
        0x2c: _0xf5fb9b(0x1e8),
        0x2d: '$',
        0x2e: 'T',
        0x2f: _0xf5fb9b(0x337),
        0x30: _0xf5fb9b(0x12),
        0x31: '&#1064;',
        0x32: '&#1046;',
        0x33: _0xf5fb9b(0x361),
        0x34: _0xf5fb9b(0xee),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's21': {
        0x1: _0xf5fb9b(0x100),
        0x2: 'b&#830;',
        0x3: _0xf5fb9b(0x9c),
        0x4: 'd&#830;',
        0x5: _0xf5fb9b(0x4d9),
        0x6: 'f&#830;',
        0x7: _0xf5fb9b(0x56),
        0x8: 'h&#830;',
        0x9: _0xf5fb9b(0x448),
        0xa: _0xf5fb9b(0x2e3),
        0xb: 'k&#830;',
        0xc: _0xf5fb9b(0x87),
        0xd: _0xf5fb9b(0x514),
        0xe: _0xf5fb9b(0xf),
        0xf: _0xf5fb9b(0x98),
        0x10: 'p&#830;',
        0x11: _0xf5fb9b(0x31c),
        0x12: _0xf5fb9b(0x26c),
        0x13: 's&#830;',
        0x14: _0xf5fb9b(0x16d),
        0x15: 'u&#830;',
        0x16: _0xf5fb9b(0x252),
        0x17: _0xf5fb9b(0x37c),
        0x18: _0xf5fb9b(0x34e),
        0x19: 'y&#830;',
        0x1a: 'z&#830;',
        0x1b: _0xf5fb9b(0x4ce),
        0x1c: 'B&#830;',
        0x1d: _0xf5fb9b(0xc2),
        0x1e: _0xf5fb9b(0x4dc),
        0x1f: 'E&#830;',
        0x20: _0xf5fb9b(0x3cc),
        0x21: 'G&#830;',
        0x22: _0xf5fb9b(0x20b),
        0x23: 'I&#830;',
        0x24: _0xf5fb9b(0x165),
        0x25: _0xf5fb9b(0x168),
        0x26: _0xf5fb9b(0x33),
        0x27: _0xf5fb9b(0x1a9),
        0x28: _0xf5fb9b(0x44c),
        0x29: _0xf5fb9b(0x40f),
        0x2a: _0xf5fb9b(0x36d),
        0x2b: _0xf5fb9b(0x365),
        0x2c: _0xf5fb9b(0x7d),
        0x2d: _0xf5fb9b(0x42c),
        0x2e: 'T&#830;',
        0x2f: 'U&#830;',
        0x30: _0xf5fb9b(0x43),
        0x31: _0xf5fb9b(0x173),
        0x32: _0xf5fb9b(0x91),
        0x33: _0xf5fb9b(0x11),
        0x34: _0xf5fb9b(0x395),
        0x35: '1&#830;',
        0x36: _0xf5fb9b(0x306),
        0x37: '3&#830;',
        0x38: '4&#830;',
        0x39: _0xf5fb9b(0x43b),
        0x3a: _0xf5fb9b(0x2b5),
        0x3b: _0xf5fb9b(0x34d),
        0x3c: _0xf5fb9b(0x292),
        0x3d: _0xf5fb9b(0x4fd),
        0x3e: _0xf5fb9b(0x31f)
    },
    's22': {
        0x1: 'a&#838;',
        0x2: 'b&#838;',
        0x3: 'c&#838;',
        0x4: 'd&#838;',
        0x5: _0xf5fb9b(0x444),
        0x6: _0xf5fb9b(0x412),
        0x7: _0xf5fb9b(0x3ea),
        0x8: 'h&#838;',
        0x9: _0xf5fb9b(0x32a),
        0xa: 'j&#838;',
        0xb: 'k&#838;',
        0xc: 'l&#838;',
        0xd: _0xf5fb9b(0x4c1),
        0xe: _0xf5fb9b(0x3e2),
        0xf: _0xf5fb9b(0x269),
        0x10: _0xf5fb9b(0x366),
        0x11: _0xf5fb9b(0x3da),
        0x12: _0xf5fb9b(0x6b),
        0x13: _0xf5fb9b(0x399),
        0x14: _0xf5fb9b(0x402),
        0x15: _0xf5fb9b(0x1da),
        0x16: _0xf5fb9b(0x301),
        0x17: _0xf5fb9b(0x236),
        0x18: _0xf5fb9b(0x4d0),
        0x19: _0xf5fb9b(0x50a),
        0x1a: _0xf5fb9b(0x1a3),
        0x1b: _0xf5fb9b(0x247),
        0x1c: _0xf5fb9b(0x18e),
        0x1d: _0xf5fb9b(0x1ff),
        0x1e: 'D&#838;',
        0x1f: _0xf5fb9b(0x17f),
        0x20: _0xf5fb9b(0x497),
        0x21: _0xf5fb9b(0xef),
        0x22: _0xf5fb9b(0x339),
        0x23: _0xf5fb9b(0x20f),
        0x24: _0xf5fb9b(0x427),
        0x25: _0xf5fb9b(0xa5),
        0x26: 'L&#838;',
        0x27: _0xf5fb9b(0x46f),
        0x28: 'N&#838;',
        0x29: _0xf5fb9b(0x34a),
        0x2a: _0xf5fb9b(0x3aa),
        0x2b: _0xf5fb9b(0x2f),
        0x2c: _0xf5fb9b(0x2),
        0x2d: _0xf5fb9b(0xd0),
        0x2e: _0xf5fb9b(0x3d9),
        0x2f: _0xf5fb9b(0x44a),
        0x30: 'V&#838;',
        0x31: _0xf5fb9b(0x38f),
        0x32: _0xf5fb9b(0x155),
        0x33: 'Y&#838;',
        0x34: _0xf5fb9b(0x146),
        0x35: '1&#838;',
        0x36: _0xf5fb9b(0x42b),
        0x37: '3&#838;',
        0x38: _0xf5fb9b(0x16),
        0x39: _0xf5fb9b(0x41f),
        0x3a: _0xf5fb9b(0x2ef),
        0x3b: _0xf5fb9b(0x5f),
        0x3c: _0xf5fb9b(0x8),
        0x3d: _0xf5fb9b(0x28),
        0x3e: _0xf5fb9b(0x39e)
    },
    's23': {
        0x1: _0xf5fb9b(0x436),
        0x2: 'b&#826;',
        0x3: _0xf5fb9b(0x1c2),
        0x4: _0xf5fb9b(0x4e6),
        0x5: 'e&#826;',
        0x6: 'f&#826;',
        0x7: _0xf5fb9b(0x459),
        0x8: _0xf5fb9b(0x232),
        0x9: _0xf5fb9b(0x44e),
        0xa: _0xf5fb9b(0x190),
        0xb: _0xf5fb9b(0x1a7),
        0xc: _0xf5fb9b(0xd8),
        0xd: _0xf5fb9b(0x369),
        0xe: _0xf5fb9b(0x351),
        0xf: 'o&#826;',
        0x10: _0xf5fb9b(0x338),
        0x11: 'q&#826;',
        0x12: _0xf5fb9b(0xc6),
        0x13: 's&#826;',
        0x14: 't&#826;',
        0x15: _0xf5fb9b(0x237),
        0x16: _0xf5fb9b(0x442),
        0x17: _0xf5fb9b(0x4f3),
        0x18: _0xf5fb9b(0x431),
        0x19: _0xf5fb9b(0x284),
        0x1a: _0xf5fb9b(0x4db),
        0x1b: _0xf5fb9b(0x4b4),
        0x1c: _0xf5fb9b(0x3e3),
        0x1d: _0xf5fb9b(0x295),
        0x1e: _0xf5fb9b(0x4a),
        0x1f: _0xf5fb9b(0x150),
        0x20: 'F&#826;',
        0x21: _0xf5fb9b(0x2bf),
        0x22: _0xf5fb9b(0x1d8),
        0x23: _0xf5fb9b(0x127),
        0x24: 'J&#826;',
        0x25: _0xf5fb9b(0x4a5),
        0x26: _0xf5fb9b(0x175),
        0x27: _0xf5fb9b(0x3cf),
        0x28: 'N&#826;',
        0x29: 'O&#826;',
        0x2a: _0xf5fb9b(0x316),
        0x2b: 'Q&#826;',
        0x2c: _0xf5fb9b(0x23),
        0x2d: _0xf5fb9b(0x1f3),
        0x2e: _0xf5fb9b(0x4d7),
        0x2f: _0xf5fb9b(0x1fb),
        0x30: 'V&#826;',
        0x31: 'W&#826;',
        0x32: _0xf5fb9b(0x1e2),
        0x33: _0xf5fb9b(0x4a6),
        0x34: _0xf5fb9b(0x24b),
        0x35: _0xf5fb9b(0x489),
        0x36: '2&#826;',
        0x37: '3&#826;',
        0x38: '4&#826;',
        0x39: '5&#826;',
        0x3a: '6&#826;',
        0x3b: '7&#826;',
        0x3c: _0xf5fb9b(0x194),
        0x3d: _0xf5fb9b(0x36a),
        0x3e: _0xf5fb9b(0x7f)
    },
    's24': {
        0x1: _0xf5fb9b(0xd3),
        0x2: 'b&#857;',
        0x3: _0xf5fb9b(0x3c2),
        0x4: _0xf5fb9b(0x156),
        0x5: _0xf5fb9b(0xa7),
        0x6: _0xf5fb9b(0x511),
        0x7: _0xf5fb9b(0x1a5),
        0x8: _0xf5fb9b(0x2ae),
        0x9: _0xf5fb9b(0x271),
        0xa: _0xf5fb9b(0x22f),
        0xb: _0xf5fb9b(0xa),
        0xc: 'l&#857;',
        0xd: _0xf5fb9b(0x1ed),
        0xe: 'n&#857;',
        0xf: _0xf5fb9b(0x327),
        0x10: _0xf5fb9b(0x17e),
        0x11: _0xf5fb9b(0x16f),
        0x12: _0xf5fb9b(0x4ad),
        0x13: _0xf5fb9b(0x490),
        0x14: _0xf5fb9b(0x41d),
        0x15: _0xf5fb9b(0xa3),
        0x16: _0xf5fb9b(0x19b),
        0x17: 'w&#857;',
        0x18: _0xf5fb9b(0x4f6),
        0x19: _0xf5fb9b(0x4e2),
        0x1a: _0xf5fb9b(0x1fc),
        0x1b: _0xf5fb9b(0x104),
        0x1c: _0xf5fb9b(0x10f),
        0x1d: _0xf5fb9b(0x27d),
        0x1e: 'D&#857;',
        0x1f: _0xf5fb9b(0x2a9),
        0x20: 'F&#857;',
        0x21: _0xf5fb9b(0x39b),
        0x22: _0xf5fb9b(0x463),
        0x23: _0xf5fb9b(0x101),
        0x24: _0xf5fb9b(0x35f),
        0x25: 'K&#857;',
        0x26: 'L&#857;',
        0x27: 'M&#857;',
        0x28: _0xf5fb9b(0x34c),
        0x29: 'O&#857;',
        0x2a: _0xf5fb9b(0x3e1),
        0x2b: _0xf5fb9b(0xf1),
        0x2c: _0xf5fb9b(0x3a5),
        0x2d: _0xf5fb9b(0x407),
        0x2e: 'T&#857;',
        0x2f: _0xf5fb9b(0x3c9),
        0x30: 'V&#857;',
        0x31: 'W&#857;',
        0x32: _0xf5fb9b(0x470),
        0x33: 'Y&#857;',
        0x34: _0xf5fb9b(0x54),
        0x35: '1&#857;',
        0x36: '2&#857;',
        0x37: _0xf5fb9b(0xb0),
        0x38: _0xf5fb9b(0x162),
        0x39: _0xf5fb9b(0x73),
        0x3a: _0xf5fb9b(0x17a),
        0x3b: _0xf5fb9b(0x507),
        0x3c: _0xf5fb9b(0x424),
        0x3d: '9&#857;',
        0x3e: _0xf5fb9b(0x512)
    },
    's25': {
        0x1: _0xf5fb9b(0x449),
        0x2: _0xf5fb9b(0x228),
        0x3: _0xf5fb9b(0x2a),
        0x4: 'd&#799;',
        0x5: _0xf5fb9b(0x1af),
        0x6: _0xf5fb9b(0xc0),
        0x7: _0xf5fb9b(0x2d0),
        0x8: _0xf5fb9b(0x40e),
        0x9: _0xf5fb9b(0x290),
        0xa: _0xf5fb9b(0x1e7),
        0xb: 'k&#799;',
        0xc: _0xf5fb9b(0x3a4),
        0xd: 'm&#799;',
        0xe: _0xf5fb9b(0x3c4),
        0xf: _0xf5fb9b(0x219),
        0x10: _0xf5fb9b(0x186),
        0x11: _0xf5fb9b(0x3ef),
        0x12: 'r&#799;',
        0x13: _0xf5fb9b(0xdd),
        0x14: _0xf5fb9b(0x2cb),
        0x15: _0xf5fb9b(0x480),
        0x16: _0xf5fb9b(0x1c9),
        0x17: 'w&#799;',
        0x18: _0xf5fb9b(0x42d),
        0x19: _0xf5fb9b(0x250),
        0x1a: 'z&#799;',
        0x1b: _0xf5fb9b(0x6a),
        0x1c: _0xf5fb9b(0x4ff),
        0x1d: _0xf5fb9b(0x20e),
        0x1e: _0xf5fb9b(0x208),
        0x1f: _0xf5fb9b(0x8e),
        0x20: 'F&#799;',
        0x21: _0xf5fb9b(0x223),
        0x22: _0xf5fb9b(0x8b),
        0x23: _0xf5fb9b(0x4a4),
        0x24: _0xf5fb9b(0x3d6),
        0x25: _0xf5fb9b(0x3fa),
        0x26: _0xf5fb9b(0x41b),
        0x27: _0xf5fb9b(0x328),
        0x28: _0xf5fb9b(0x278),
        0x29: _0xf5fb9b(0x262),
        0x2a: _0xf5fb9b(0x14e),
        0x2b: 'Q&#799;',
        0x2c: 'R&#799;',
        0x2d: _0xf5fb9b(0x30),
        0x2e: 'T&#799;',
        0x2f: _0xf5fb9b(0xe8),
        0x30: 'V&#799;',
        0x31: _0xf5fb9b(0x130),
        0x32: 'X&#799;',
        0x33: _0xf5fb9b(0x43f),
        0x34: 'Z&#799;',
        0x35: '1&#799;',
        0x36: _0xf5fb9b(0x131),
        0x37: _0xf5fb9b(0x1e0),
        0x38: '4&#799;',
        0x39: _0xf5fb9b(0xfe),
        0x3a: '6&#799;',
        0x3b: _0xf5fb9b(0x275),
        0x3c: '8&#799;',
        0x3d: _0xf5fb9b(0x225),
        0x3e: '0&#799;'
    },
    's26': {
        0x1: _0xf5fb9b(0x4af),
        0x2: _0xf5fb9b(0x71),
        0x3: 'c&#846;',
        0x4: _0xf5fb9b(0x4a0),
        0x5: 'e&#846;',
        0x6: _0xf5fb9b(0x409),
        0x7: _0xf5fb9b(0x92),
        0x8: _0xf5fb9b(0x2cc),
        0x9: 'i&#846;',
        0xa: 'j&#846;',
        0xb: _0xf5fb9b(0x177),
        0xc: _0xf5fb9b(0x9e),
        0xd: 'm&#846;',
        0xe: _0xf5fb9b(0x36b),
        0xf: _0xf5fb9b(0x2f5),
        0x10: _0xf5fb9b(0xa9),
        0x11: _0xf5fb9b(0x1bf),
        0x12: _0xf5fb9b(0x2a0),
        0x13: _0xf5fb9b(0xcd),
        0x14: _0xf5fb9b(0x9d),
        0x15: _0xf5fb9b(0x3b4),
        0x16: _0xf5fb9b(0x10c),
        0x17: _0xf5fb9b(0x3e7),
        0x18: _0xf5fb9b(0x3fb),
        0x19: _0xf5fb9b(0x221),
        0x1a: _0xf5fb9b(0x1a4),
        0x1b: _0xf5fb9b(0x2d8),
        0x1c: 'B&#846;',
        0x1d: _0xf5fb9b(0x4bc),
        0x1e: _0xf5fb9b(0x4f5),
        0x1f: _0xf5fb9b(0x3df),
        0x20: _0xf5fb9b(0x26),
        0x21: 'G&#846;',
        0x22: _0xf5fb9b(0x1d2),
        0x23: 'I&#846;',
        0x24: 'J&#846;',
        0x25: _0xf5fb9b(0x461),
        0x26: 'L&#846;',
        0x27: 'M&#846;',
        0x28: _0xf5fb9b(0x3d8),
        0x29: 'O&#846;',
        0x2a: 'P&#846;',
        0x2b: _0xf5fb9b(0x4ae),
        0x2c: 'R&#846;',
        0x2d: _0xf5fb9b(0x189),
        0x2e: _0xf5fb9b(0x19d),
        0x2f: _0xf5fb9b(0x3),
        0x30: _0xf5fb9b(0x393),
        0x31: _0xf5fb9b(0x2e4),
        0x32: _0xf5fb9b(0x3e6),
        0x33: _0xf5fb9b(0x33f),
        0x34: 'Z&#846;',
        0x35: _0xf5fb9b(0x346),
        0x36: '2&#846;',
        0x37: '3&#846;',
        0x38: _0xf5fb9b(0xf4),
        0x39: _0xf5fb9b(0x163),
        0x3a: _0xf5fb9b(0xa0),
        0x3b: _0xf5fb9b(0x11e),
        0x3c: _0xf5fb9b(0x483),
        0x3d: _0xf5fb9b(0x2ec),
        0x3e: _0xf5fb9b(0x3db)
    },
    's27': {
        0x1: _0xf5fb9b(0x435),
        0x2: _0xf5fb9b(0x13b),
        0x3: 'c&#829;&#851;',
        0x4: 'd&#829;&#851;',
        0x5: 'e&#829;&#851;',
        0x6: _0xf5fb9b(0x4a1),
        0x7: 'g&#829;&#851;',
        0x8: _0xf5fb9b(0xfd),
        0x9: _0xf5fb9b(0x3d4),
        0xa: _0xf5fb9b(0x21f),
        0xb: _0xf5fb9b(0x61),
        0xc: _0xf5fb9b(0x4c),
        0xd: _0xf5fb9b(0xde),
        0xe: 'n&#829;&#851;',
        0xf: _0xf5fb9b(0x3d1),
        0x10: _0xf5fb9b(0x4d2),
        0x11: _0xf5fb9b(0x180),
        0x12: _0xf5fb9b(0x9b),
        0x13: _0xf5fb9b(0x379),
        0x14: 't&#829;&#851;',
        0x15: _0xf5fb9b(0x4a8),
        0x16: _0xf5fb9b(0x272),
        0x17: 'w&#829;&#851;',
        0x18: _0xf5fb9b(0xb),
        0x19: 'y&#829;&#851;',
        0x1a: _0xf5fb9b(0x4cd),
        0x1b: 'A&#829;&#851;',
        0x1c: _0xf5fb9b(0x193),
        0x1d: 'C&#829;&#851;',
        0x1e: _0xf5fb9b(0x1be),
        0x1f: _0xf5fb9b(0x344),
        0x20: _0xf5fb9b(0x1f4),
        0x21: _0xf5fb9b(0x1b4),
        0x22: _0xf5fb9b(0xb5),
        0x23: 'I&#829;&#851;',
        0x24: _0xf5fb9b(0x103),
        0x25: _0xf5fb9b(0x9a),
        0x26: _0xf5fb9b(0x10e),
        0x27: 'M&#829;&#851;',
        0x28: _0xf5fb9b(0x2b2),
        0x29: _0xf5fb9b(0x1a1),
        0x2a: 'P&#829;&#851;',
        0x2b: _0xf5fb9b(0x426),
        0x2c: _0xf5fb9b(0x392),
        0x2d: _0xf5fb9b(0x277),
        0x2e: _0xf5fb9b(0x18f),
        0x2f: _0xf5fb9b(0x40c),
        0x30: _0xf5fb9b(0x13a),
        0x31: _0xf5fb9b(0x51a),
        0x32: 'X&#829;&#851;',
        0x33: 'Y&#829;&#851;',
        0x34: _0xf5fb9b(0x11a),
        0x35: '1&#829;&#851;',
        0x36: '2&#829;&#851;',
        0x37: '3&#829;&#851;',
        0x38: _0xf5fb9b(0x4de),
        0x39: _0xf5fb9b(0x279),
        0x3a: '6&#829;&#851;',
        0x3b: _0xf5fb9b(0x4f8),
        0x3c: _0xf5fb9b(0x4eb),
        0x3d: _0xf5fb9b(0x3b9),
        0x3e: '0&#829;&#851;'
    },
    's29': {
        0x1: _0xf5fb9b(0x33e),
        0x2: _0xf5fb9b(0x21c),
        0x3: _0xf5fb9b(0x2fd),
        0x4: _0xf5fb9b(0x3a8),
        0x5: _0xf5fb9b(0x239),
        0x6: _0xf5fb9b(0x43e),
        0x7: _0xf5fb9b(0xf2),
        0x8: _0xf5fb9b(0x36),
        0x9: _0xf5fb9b(0x452),
        0xa: _0xf5fb9b(0x44b),
        0xb: _0xf5fb9b(0x120),
        0xc: _0xf5fb9b(0x4d5),
        0xd: _0xf5fb9b(0x207),
        0xe: _0xf5fb9b(0x39f),
        0xf: _0xf5fb9b(0x450),
        0x10: '&#120473;&#823;',
        0x11: '&#120474;&#823;',
        0x12: _0xf5fb9b(0x1c4),
        0x13: _0xf5fb9b(0x372),
        0x14: _0xf5fb9b(0x415),
        0x15: _0xf5fb9b(0xab),
        0x16: _0xf5fb9b(0x3ce),
        0x17: '&#120480;&#823;',
        0x18: _0xf5fb9b(0x2c2),
        0x19: _0xf5fb9b(0x4f0),
        0x1a: '&#120483;&#823;',
        0x1b: _0xf5fb9b(0xf3),
        0x1c: _0xf5fb9b(0x167),
        0x1d: '&#120434;&#823;',
        0x1e: '&#120435;&#823;',
        0x1f: _0xf5fb9b(0x2cd),
        0x20: '&#120437;&#823;',
        0x21: _0xf5fb9b(0x216),
        0x22: _0xf5fb9b(0x3b),
        0x23: _0xf5fb9b(0x430),
        0x24: _0xf5fb9b(0x6),
        0x25: _0xf5fb9b(0x305),
        0x26: _0xf5fb9b(0x1d7),
        0x27: '&#120444;&#823;',
        0x28: _0xf5fb9b(0x2bd),
        0x29: _0xf5fb9b(0x3a6),
        0x2a: _0xf5fb9b(0x148),
        0x2b: _0xf5fb9b(0x191),
        0x2c: _0xf5fb9b(0x50f),
        0x2d: '&#120450;&#823;',
        0x2e: '&#120451;&#823;',
        0x2f: _0xf5fb9b(0x30e),
        0x30: '&#120453;&#823;',
        0x31: _0xf5fb9b(0x4b2),
        0x32: _0xf5fb9b(0x34f),
        0x33: '&#120456;&#823;',
        0x34: '&#120457;&#823;',
        0x35: _0xf5fb9b(0xc7),
        0x36: _0xf5fb9b(0x17d),
        0x37: _0xf5fb9b(0x220),
        0x38: _0xf5fb9b(0x4e9),
        0x39: _0xf5fb9b(0x171),
        0x3a: _0xf5fb9b(0x4e5),
        0x3b: _0xf5fb9b(0x205),
        0x3c: _0xf5fb9b(0x1e9),
        0x3d: _0xf5fb9b(0x308),
        0x3e: _0xf5fb9b(0x42a)
    },
    's30': {
        0x1: _0xf5fb9b(0x484),
        0x2: 'b&#866;',
        0x3: _0xf5fb9b(0x265),
        0x4: _0xf5fb9b(0x3c6),
        0x5: _0xf5fb9b(0x128),
        0x6: _0xf5fb9b(0x4c6),
        0x7: _0xf5fb9b(0x3ed),
        0x8: 'h&#866;',
        0x9: _0xf5fb9b(0x1f),
        0xa: _0xf5fb9b(0x145),
        0xb: _0xf5fb9b(0x60),
        0xc: _0xf5fb9b(0x37d),
        0xd: _0xf5fb9b(0x348),
        0xe: _0xf5fb9b(0x500),
        0xf: _0xf5fb9b(0x1f1),
        0x10: _0xf5fb9b(0x3f4),
        0x11: 'q&#866;',
        0x12: _0xf5fb9b(0x32c),
        0x13: 's&#866;',
        0x14: 't&#866;',
        0x15: _0xf5fb9b(0xc9),
        0x16: _0xf5fb9b(0x15c),
        0x17: _0xf5fb9b(0x464),
        0x18: _0xf5fb9b(0x213),
        0x19: _0xf5fb9b(0x210),
        0x1a: 'z&#866;',
        0x1b: _0xf5fb9b(0xca),
        0x1c: _0xf5fb9b(0x31b),
        0x1d: _0xf5fb9b(0x4c0),
        0x1e: _0xf5fb9b(0x6f),
        0x1f: 'E&#866;',
        0x20: _0xf5fb9b(0x3f2),
        0x21: _0xf5fb9b(0x38b),
        0x22: _0xf5fb9b(0x310),
        0x23: _0xf5fb9b(0x256),
        0x24: _0xf5fb9b(0x122),
        0x25: _0xf5fb9b(0x39),
        0x26: 'L&#866;',
        0x27: _0xf5fb9b(0x474),
        0x28: _0xf5fb9b(0x96),
        0x29: _0xf5fb9b(0x341),
        0x2a: _0xf5fb9b(0x4e3),
        0x2b: 'Q&#866;',
        0x2c: 'R&#866;',
        0x2d: _0xf5fb9b(0x3ad),
        0x2e: _0xf5fb9b(0x4ed),
        0x2f: _0xf5fb9b(0xf8),
        0x30: 'V&#866;',
        0x31: _0xf5fb9b(0x477),
        0x32: _0xf5fb9b(0x1f6),
        0x33: 'Y&#866;',
        0x34: _0xf5fb9b(0x3d7),
        0x35: '1&#866;',
        0x36: _0xf5fb9b(0xa6),
        0x37: '3&#866;',
        0x38: '4&#866;',
        0x39: '5&#866;',
        0x3a: _0xf5fb9b(0x24a),
        0x3b: _0xf5fb9b(0x423),
        0x3c: '8&#866;',
        0x3d: _0xf5fb9b(0x4a7),
        0x3e: '0&#866;'
    },
    's31': {
        0x1: _0xf5fb9b(0x16c),
        0x2: _0xf5fb9b(0x41e),
        0x3: _0xf5fb9b(0x30c),
        0x4: 'd&#828;',
        0x5: _0xf5fb9b(0x59),
        0x6: _0xf5fb9b(0x509),
        0x7: _0xf5fb9b(0xba),
        0x8: 'h&#828;',
        0x9: _0xf5fb9b(0x42f),
        0xa: _0xf5fb9b(0x2e2),
        0xb: _0xf5fb9b(0x317),
        0xc: _0xf5fb9b(0x15b),
        0xd: _0xf5fb9b(0x27f),
        0xe: 'n&#828;',
        0xf: _0xf5fb9b(0x7e),
        0x10: 'p&#828;',
        0x11: _0xf5fb9b(0x23a),
        0x12: _0xf5fb9b(0x147),
        0x13: 's&#828;',
        0x14: 't&#828;',
        0x15: 'u&#828;',
        0x16: _0xf5fb9b(0x229),
        0x17: 'w&#828;',
        0x18: _0xf5fb9b(0x4f),
        0x19: 'y&#828;',
        0x1a: 'z&#828;',
        0x1b: _0xf5fb9b(0x1b1),
        0x1c: _0xf5fb9b(0x64),
        0x1d: _0xf5fb9b(0x3dc),
        0x1e: _0xf5fb9b(0xfa),
        0x1f: _0xf5fb9b(0x4ea),
        0x20: _0xf5fb9b(0x1e3),
        0x21: _0xf5fb9b(0x3ae),
        0x22: 'H&#828;',
        0x23: _0xf5fb9b(0x40d),
        0x24: _0xf5fb9b(0x364),
        0x25: _0xf5fb9b(0x1e1),
        0x26: _0xf5fb9b(0x260),
        0x27: _0xf5fb9b(0x201),
        0x28: _0xf5fb9b(0x10d),
        0x29: _0xf5fb9b(0x1cd),
        0x2a: 'P&#828;',
        0x2b: 'Q&#828;',
        0x2c: 'R&#828;',
        0x2d: _0xf5fb9b(0xe1),
        0x2e: _0xf5fb9b(0x8c),
        0x2f: _0xf5fb9b(0x109),
        0x30: _0xf5fb9b(0x88),
        0x31: 'W&#828;',
        0x32: _0xf5fb9b(0x455),
        0x33: 'Y&#828;',
        0x34: 'Z&#828;',
        0x35: _0xf5fb9b(0x460),
        0x36: _0xf5fb9b(0x35a),
        0x37: _0xf5fb9b(0x503),
        0x38: _0xf5fb9b(0x47c),
        0x39: _0xf5fb9b(0x18a),
        0x3a: _0xf5fb9b(0x1e),
        0x3b: '7&#828;',
        0x3c: _0xf5fb9b(0x437),
        0x3d: _0xf5fb9b(0x44d),
        0x3e: _0xf5fb9b(0x4fc)
    }
};

function Change(_0x546911, _0x80b523) {
    var _0x15d3e3 = _0xf5fb9b,
        _0x2a18f3 = '',
        _0x546911 = _0x546911;
    if (_0x546911[_0x15d3e3(0x230)] == 0x0) return;
    for (i = 0x0; i < _0x546911[_0x15d3e3(0x230)]; i++) {
        var _0x273512 = _0x546911[_0x15d3e3(0x4b9)](i),
            _0x99c2d8 = normal['indexOf'](_0x273512) + 0x1;
        if (_0x273512 == '\x20') _0x2a18f3 += '\x20';
        else !_0x99c2d8 ? _0x2a18f3 += _0x273512 : _0x2a18f3 += newtext[_0x80b523][_0x99c2d8];
    }
    return _0x2a18f3;
}
const futureAlienCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑢ',
        'd': 'ᕲ',
        'e': 'ᘿ',
        'f': 'ᖴ',
        'g': 'ᘜ',
        'h': 'ᕼ',
        'i': 'ᓰ',
        'j': 'ᒚ',
        'k': 'ᖽᐸ',
        'l': 'ᒪ',
        'm': 'ᘻ',
        'n': 'ᘉ',
        'o': 'ᓍ',
        'p': 'ᕵ',
        'q': 'ᕴ',
        'r': 'ᖇ',
        's': 'S',
        't': 'ᖶ',
        'u': 'ᑘ',
        'v': 'ᐺ',
        'w': 'ᘺ',
        'x': '᙭',
        'y': 'ᖻ',
        'z': 'ᗱ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑢ',
        'D': 'ᕲ',
        'E': 'ᘿ',
        'F': 'ᖴ',
        'G': 'ᘜ',
        'H': 'ᕼ',
        'I': 'ᓰ',
        'J': 'ᒚ',
        'K': 'ᖽᐸ',
        'L': 'ᒪ',
        'M': 'ᘻ',
        'N': 'ᘉ',
        'O': 'ᓍ',
        'P': 'ᕵ',
        'Q': 'ᕴ',
        'R': 'ᖇ',
        'S': 'S',
        'T': 'ᖶ',
        'U': 'ᑘ',
        'V': 'ᐺ',
        'W': 'ᘺ',
        'X': '᙭',
        'Y': 'ᖻ',
        'Z': 'ᗱ'
    },
    squiggle6CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๖',
        'c': '¢',
        'd': '໓',
        'e': 'ē',
        'f': 'f',
        'g': 'ງ',
        'h': 'h',
        'i': 'i',
        'j': 'ว',
        'k': 'k',
        'l': 'l',
        'm': '๓',
        'n': 'ຖ',
        'o': '໐',
        'p': 'p',
        'q': '๑',
        'r': 'r',
        's': 'Ş',
        't': 't',
        'u': 'น',
        'v': 'ง',
        'w': 'ຟ',
        'x': 'x',
        'y': 'ฯ',
        'z': 'ຊ',
        'A': 'ค',
        'B': '๖',
        'C': '¢',
        'D': '໓',
        'E': 'ē',
        'F': 'f',
        'G': 'ງ',
        'H': 'h',
        'I': 'i',
        'J': 'ว',
        'K': 'k',
        'L': 'l',
        'M': '๓',
        'N': 'ຖ',
        'O': '໐',
        'P': 'p',
        'Q': '๑',
        'R': 'r',
        'S': 'Ş',
        'T': 't',
        'U': 'น',
        'V': 'ง',
        'W': 'ຟ',
        'X': 'x',
        'Y': 'ฯ',
        'Z': 'ຊ'
    },
    squiggle5CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ą',
        'b': 'ც',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɠ',
        'h': 'ɧ',
        'i': 'ı',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'Ɩ',
        'm': 'ɱ',
        'n': 'ŋ',
        'o': 'ơ',
        'p': '℘',
        'q': 'զ',
        'r': 'ཞ',
        's': 'ʂ',
        't': 'ɬ',
        'u': 'ų',
        'v': '۷',
        'w': 'ῳ',
        'x': 'ҳ',
        'y': 'ყ',
        'z': 'ʑ',
        'A': 'ą',
        'B': 'ც',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɠ',
        'H': 'ɧ',
        'I': 'ı',
        'J': 'ʝ',
        'K': 'ƙ',
        'L': 'Ɩ',
        'M': 'ɱ',
        'N': 'ŋ',
        'O': 'ơ',
        'P': '℘',
        'Q': 'զ',
        'R': 'ཞ',
        'S': 'ʂ',
        'T': 'ɬ',
        'U': 'ų',
        'V': '۷',
        'W': 'ῳ',
        'X': 'ҳ',
        'Y': 'ყ',
        'Z': 'ʑ'
    },
    asianStyle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ﾑ',
        'b': '乃',
        'c': 'ᄃ',
        'd': 'り',
        'e': '乇',
        'f': 'ｷ',
        'g': 'ム',
        'h': 'ん',
        'i': 'ﾉ',
        'j': 'ﾌ',
        'k': 'ズ',
        'l': 'ﾚ',
        'm': 'ﾶ',
        'n': '刀',
        'o': 'の',
        'p': 'ｱ',
        'q': 'ゐ',
        'r': '尺',
        's': '丂',
        't': 'ｲ',
        'u': 'ひ',
        'v': '√',
        'w': 'W',
        'x': 'ﾒ',
        'y': 'ﾘ',
        'z': '乙',
        'A': 'ﾑ',
        'B': '乃',
        'C': 'ᄃ',
        'D': 'り',
        'E': '乇',
        'F': 'ｷ',
        'G': 'ム',
        'H': 'ん',
        'I': 'ﾉ',
        'J': 'ﾌ',
        'K': 'ズ',
        'L': 'ﾚ',
        'M': 'ﾶ',
        'N': '刀',
        'O': 'の',
        'P': 'ｱ',
        'Q': 'ゐ',
        'R': '尺',
        'S': '丂',
        'T': 'ｲ',
        'U': 'ひ',
        'V': '√',
        'W': 'W',
        'X': 'ﾒ',
        'Y': 'ﾘ',
        'Z': '乙'
    },
    asianStyleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '卂',
        'b': '乃',
        'c': '匚',
        'd': 'ᗪ',
        'e': '乇',
        'f': '千',
        'g': 'Ꮆ',
        'h': '卄',
        'i': '丨',
        'j': 'ﾌ',
        'k': 'Ҝ',
        'l': 'ㄥ',
        'm': '爪',
        'n': '几',
        'o': 'ㄖ',
        'p': '卩',
        'q': 'Ɋ',
        'r': '尺',
        's': '丂',
        't': 'ㄒ',
        'u': 'ㄩ',
        'v': 'ᐯ',
        'w': '山',
        'x': '乂',
        'y': 'ㄚ',
        'z': '乙',
        'A': '卂',
        'B': '乃',
        'C': '匚',
        'D': 'ᗪ',
        'E': '乇',
        'F': '千',
        'G': 'Ꮆ',
        'H': '卄',
        'I': '丨',
        'J': 'ﾌ',
        'K': 'Ҝ',
        'L': 'ㄥ',
        'M': '爪',
        'N': '几',
        'O': 'ㄖ',
        'P': '卩',
        'Q': 'Ɋ',
        'R': '尺',
        'S': '丂',
        'T': 'ㄒ',
        'U': 'ㄩ',
        'V': 'ᐯ',
        'W': '山',
        'X': '乂',
        'Y': 'ㄚ',
        'Z': '乙'
    },
    squaresCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '🄰',
        'b': '🄱',
        'c': '🄲',
        'd': '🄳',
        'e': '🄴',
        'f': '🄵',
        'g': '🄶',
        'h': '🄷',
        'i': '🄸',
        'j': '🄹',
        'k': '🄺',
        'l': '🄻',
        'm': '🄼',
        'n': '🄽',
        'o': '🄾',
        'p': '🄿',
        'q': '🅀',
        'r': '🅁',
        's': '🅂',
        't': '🅃',
        'u': '🅄',
        'v': '🅅',
        'w': '🅆',
        'x': '🅇',
        'y': '🅈',
        'z': '🅉',
        'A': '🄰',
        'B': '🄱',
        'C': '🄲',
        'D': '🄳',
        'E': '🄴',
        'F': '🄵',
        'G': '🄶',
        'H': '🄷',
        'I': '🄸',
        'J': '🄹',
        'K': '🄺',
        'L': '🄻',
        'M': '🄼',
        'N': '🄽',
        'O': '🄾',
        'P': '🄿',
        'Q': '🅀',
        'R': '🅁',
        'S': '🅂',
        'T': '🅃',
        'U': '🅄',
        'V': '🅅',
        'W': '🅆',
        'X': '🅇',
        'Y': '🅈',
        'Z': '🅉'
    },
    squiggle4CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Ꮧ',
        'b': 'Ᏸ',
        'c': 'ፈ',
        'd': 'Ꮄ',
        'e': 'Ꮛ',
        'f': 'Ꭶ',
        'g': 'Ꮆ',
        'h': 'Ꮒ',
        'i': 'Ꭵ',
        'j': 'Ꮰ',
        'k': 'Ꮶ',
        'l': 'Ꮭ',
        'm': 'Ꮇ',
        'n': 'Ꮑ',
        'o': 'Ꭷ',
        'p': 'Ꭾ',
        'q': 'Ꭴ',
        'r': 'Ꮢ',
        's': 'Ꮥ',
        't': 'Ꮦ',
        'u': 'Ꮼ',
        'v': 'Ꮙ',
        'w': 'Ꮗ',
        'x': 'ጀ',
        'y': 'Ꭹ',
        'z': 'ፚ',
        'A': 'Ꮧ',
        'B': 'Ᏸ',
        'C': 'ፈ',
        'D': 'Ꮄ',
        'E': 'Ꮛ',
        'F': 'Ꭶ',
        'G': 'Ꮆ',
        'H': 'Ꮒ',
        'I': 'Ꭵ',
        'J': 'Ꮰ',
        'K': 'Ꮶ',
        'L': 'Ꮭ',
        'M': 'Ꮇ',
        'N': 'Ꮑ',
        'O': 'Ꭷ',
        'P': 'Ꭾ',
        'Q': 'Ꭴ',
        'R': 'Ꮢ',
        'S': 'Ꮥ',
        'T': 'Ꮦ',
        'U': 'Ꮼ',
        'V': 'Ꮙ',
        'W': 'Ꮗ',
        'X': 'ጀ',
        'Y': 'Ꭹ',
        'Z': 'ፚ'
    },
    neonCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑕ',
        'd': 'ᗪ',
        'e': 'E',
        'f': 'ᖴ',
        'g': 'G',
        'h': 'ᕼ',
        'i': 'I',
        'j': 'ᒍ',
        'k': 'K',
        'l': 'ᒪ',
        'm': 'ᗰ',
        'n': 'ᑎ',
        'o': 'O',
        'p': 'ᑭ',
        'q': 'ᑫ',
        'r': 'ᖇ',
        's': 'ᔕ',
        't': 'T',
        'u': 'ᑌ',
        'v': 'ᐯ',
        'w': 'ᗯ',
        'x': '᙭',
        'y': 'Y',
        'z': 'ᘔ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑕ',
        'D': 'ᗪ',
        'E': 'E',
        'F': 'ᖴ',
        'G': 'G',
        'H': 'ᕼ',
        'I': 'I',
        'J': 'ᒍ',
        'K': 'K',
        'L': 'ᒪ',
        'M': 'ᗰ',
        'N': 'ᑎ',
        'O': 'O',
        'P': 'ᑭ',
        'Q': 'ᑫ',
        'R': 'ᖇ',
        'S': 'ᔕ',
        'T': 'T',
        'U': 'ᑌ',
        'V': 'ᐯ',
        'W': 'ᗯ',
        'X': '᙭',
        'Y': 'Y',
        'Z': 'ᘔ'
    },
    squiggle3CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ǟ',
        'b': 'ɮ',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɢ',
        'h': 'ɦ',
        'i': 'ɨ',
        'j': 'ʝ',
        'k': 'ӄ',
        'l': 'ʟ',
        'm': 'ʍ',
        'n': 'ռ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ʀ',
        's': 'ֆ',
        't': 'ȶ',
        'u': 'ʊ',
        'v': 'ʋ',
        'w': 'ա',
        'x': 'Ӽ',
        'y': 'ʏ',
        'z': 'ʐ',
        'A': 'ǟ',
        'B': 'ɮ',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɢ',
        'H': 'ɦ',
        'I': 'ɨ',
        'J': 'ʝ',
        'K': 'ӄ',
        'L': 'ʟ',
        'M': 'ʍ',
        'N': 'ռ',
        'O': 'օ',
        'P': 'ք',
        'Q': 'զ',
        'R': 'ʀ',
        'S': 'ֆ',
        'T': 'ȶ',
        'U': 'ʊ',
        'V': 'ʋ',
        'W': 'ա',
        'X': 'Ӽ',
        'Y': 'ʏ',
        'Z': 'ʐ'
    },
    monospaceCharMap = {
        0x0: '𝟶',
        0x1: '𝟷',
        0x2: '𝟸',
        0x3: '𝟹',
        0x4: '𝟺',
        0x5: '𝟻',
        0x6: '𝟼',
        0x7: '𝟽',
        0x8: '𝟾',
        0x9: '𝟿',
        'a': '𝚊',
        'b': '𝚋',
        'c': '𝚌',
        'd': '𝚍',
        'e': '𝚎',
        'f': '𝚏',
        'g': '𝚐',
        'h': '𝚑',
        'i': '𝚒',
        'j': '𝚓',
        'k': '𝚔',
        'l': '𝚕',
        'm': '𝚖',
        'n': '𝚗',
        'o': '𝚘',
        'p': '𝚙',
        'q': '𝚚',
        'r': '𝚛',
        's': '𝚜',
        't': '𝚝',
        'u': '𝚞',
        'v': '𝚟',
        'w': '𝚠',
        'x': '𝚡',
        'y': '𝚢',
        'z': '𝚣',
        'A': '𝙰',
        'B': '𝙱',
        'C': '𝙲',
        'D': '𝙳',
        'E': '𝙴',
        'F': '𝙵',
        'G': '𝙶',
        'H': '𝙷',
        'I': '𝙸',
        'J': '𝙹',
        'K': '𝙺',
        'L': '𝙻',
        'M': '𝙼',
        'N': '𝙽',
        'O': '𝙾',
        'P': '𝙿',
        'Q': '𝚀',
        'R': '𝚁',
        'S': '𝚂',
        'T': '𝚃',
        'U': '𝚄',
        'V': '𝚅',
        'W': '𝚆',
        'X': '𝚇',
        'Y': '𝚈',
        'Z': '𝚉'
    },
    boldItalicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝙖',
        'b': '𝙗',
        'c': '𝙘',
        'd': '𝙙',
        'e': '𝙚',
        'f': '𝙛',
        'g': '𝙜',
        'h': '𝙝',
        'i': '𝙞',
        'j': '𝙟',
        'k': '𝙠',
        'l': '𝙡',
        'm': '𝙢',
        'n': '𝙣',
        'o': '𝙤',
        'p': '𝙥',
        'q': '𝙦',
        'r': '𝙧',
        's': '𝙨',
        't': '𝙩',
        'u': '𝙪',
        'v': '𝙫',
        'w': '𝙬',
        'x': '𝙭',
        'y': '𝙮',
        'z': '𝙯',
        'A': '𝘼',
        'B': '𝘽',
        'C': '𝘾',
        'D': '𝘿',
        'E': '𝙀',
        'F': '𝙁',
        'G': '𝙂',
        'H': '𝙃',
        'I': '𝙄',
        'J': '𝙅',
        'K': '𝙆',
        'L': '𝙇',
        'M': '𝙈',
        'N': '𝙉',
        'O': '𝙊',
        'P': '𝙋',
        'Q': '𝙌',
        'R': '𝙍',
        'S': '𝙎',
        'T': '𝙏',
        'U': '𝙐',
        'V': '𝙑',
        'W': '𝙒',
        'X': '𝙓',
        'Y': '𝙔',
        'Z': '𝙕'
    },
    boldCharMap = {
        0x0: '𝟎',
        0x1: '𝟏',
        0x2: '𝟐',
        0x3: '𝟑',
        0x4: '𝟒',
        0x5: '𝟓',
        0x6: '𝟔',
        0x7: '𝟕',
        0x8: '𝟖',
        0x9: '𝟗',
        'a': '𝐚',
        'b': '𝐛',
        'c': '𝐜',
        'd': '𝐝',
        'e': '𝐞',
        'f': '𝐟',
        'g': '𝐠',
        'h': '𝐡',
        'i': '𝐢',
        'j': '𝐣',
        'k': '𝐤',
        'l': '𝐥',
        'm': '𝐦',
        'n': '𝐧',
        'o': '𝐨',
        'p': '𝐩',
        'q': '𝐪',
        'r': '𝐫',
        's': '𝐬',
        't': '𝐭',
        'u': '𝐮',
        'v': '𝐯',
        'w': '𝐰',
        'x': '𝐱',
        'y': '𝐲',
        'z': '𝐳',
        'A': '𝐀',
        'B': '𝐁',
        'C': '𝐂',
        'D': '𝐃',
        'E': '𝐄',
        'F': '𝐅',
        'G': '𝐆',
        'H': '𝐇',
        'I': '𝐈',
        'J': '𝐉',
        'K': '𝐊',
        'L': '𝐋',
        'M': '𝐌',
        'N': '𝐍',
        'O': '𝐎',
        'P': '𝐏',
        'Q': '𝐐',
        'R': '𝐑',
        'S': '𝐒',
        'T': '𝐓',
        'U': '𝐔',
        'V': '𝐕',
        'W': '𝐖',
        'X': '𝐗',
        'Y': '𝐘',
        'Z': '𝐙'
    },
    italicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝘢',
        'b': '𝘣',
        'c': '𝘤',
        'd': '𝘥',
        'e': '𝘦',
        'f': '𝘧',
        'g': '𝘨',
        'h': '𝘩',
        'i': '𝘪',
        'j': '𝘫',
        'k': '𝘬',
        'l': '𝘭',
        'm': '𝘮',
        'n': '𝘯',
        'o': '𝘰',
        'p': '𝘱',
        'q': '𝘲',
        'r': '𝘳',
        's': '𝘴',
        't': '𝘵',
        'u': '𝘶',
        'v': '𝘷',
        'w': '𝘸',
        'x': '𝘹',
        'y': '𝘺',
        'z': '𝘻',
        'A': '𝘈',
        'B': '𝘉',
        'C': '𝘊',
        'D': '𝘋',
        'E': '𝘌',
        'F': '𝘍',
        'G': '𝘎',
        'H': '𝘏',
        'I': '𝘐',
        'J': '𝘑',
        'K': '𝘒',
        'L': '𝘓',
        'M': '𝘔',
        'N': '𝘕',
        'O': '𝘖',
        'P': '𝘗',
        'Q': '𝘘',
        'R': '𝘙',
        'S': '𝘚',
        'T': '𝘛',
        'U': '𝘜',
        'V': '𝘝',
        'W': '𝘞',
        'X': '𝘟',
        'Y': '𝘠',
        'Z': '𝘡'
    },
    squiggle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'Ⴆ',
        'c': 'ƈ',
        'd': 'ԃ',
        'e': 'ҽ',
        'f': 'ϝ',
        'g': 'ɠ',
        'h': 'ԋ',
        'i': 'ι',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'ʅ',
        'm': 'ɱ',
        'n': 'ɳ',
        'o': 'σ',
        'p': 'ρ',
        'q': 'ϙ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'ƚ',
        'u': 'υ',
        'v': 'ʋ',
        'w': 'ɯ',
        'x': 'x',
        'y': 'ყ',
        'z': 'ȥ',
        'A': 'A',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'E',
        'F': 'F',
        'G': 'G',
        'H': 'H',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'N',
        'O': 'O',
        'P': 'P',
        'Q': 'Q',
        'R': 'R',
        'S': 'S',
        'T': 'T',
        'U': 'U',
        'V': 'V',
        'W': 'W',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    currencyCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '₳',
        'b': '฿',
        'c': '₵',
        'd': 'Đ',
        'e': 'Ɇ',
        'f': '₣',
        'g': '₲',
        'h': 'Ⱨ',
        'i': 'ł',
        'j': 'J',
        'k': '₭',
        'l': 'Ⱡ',
        'm': '₥',
        'n': '₦',
        'o': 'Ø',
        'p': '₱',
        'q': 'Q',
        'r': 'Ɽ',
        's': '₴',
        't': '₮',
        'u': 'Ʉ',
        'v': 'V',
        'w': '₩',
        'x': 'Ӿ',
        'y': 'Ɏ',
        'z': 'Ⱬ',
        'A': '₳',
        'B': '฿',
        'C': '₵',
        'D': 'Đ',
        'E': 'Ɇ',
        'F': '₣',
        'G': '₲',
        'H': 'Ⱨ',
        'I': 'ł',
        'J': 'J',
        'K': '₭',
        'L': 'Ⱡ',
        'M': '₥',
        'N': '₦',
        'O': 'Ø',
        'P': '₱',
        'Q': 'Q',
        'R': 'Ɽ',
        'S': '₴',
        'T': '₮',
        'U': 'Ʉ',
        'V': 'V',
        'W': '₩',
        'X': 'Ӿ',
        'Y': 'Ɏ',
        'Z': 'Ⱬ'
    },
    symbolsCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'å',
        'b': 'ß',
        'c': '¢',
        'd': 'Ð',
        'e': 'ê',
        'f': '£',
        'g': 'g',
        'h': 'h',
        'i': 'ï',
        'j': 'j',
        'k': 'k',
        'l': 'l',
        'm': 'm',
        'n': 'ñ',
        'o': 'ð',
        'p': 'þ',
        'q': 'q',
        'r': 'r',
        's': '§',
        't': '†',
        'u': 'µ',
        'v': 'v',
        'w': 'w',
        'x': 'x',
        'y': '¥',
        'z': 'z',
        'A': 'Ä',
        'B': 'ß',
        'C': 'Ç',
        'D': 'Ð',
        'E': 'È',
        'F': '£',
        'G': 'G',
        'H': 'H',
        'I': 'Ì',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'ñ',
        'O': 'Ö',
        'P': 'þ',
        'Q': 'Q',
        'R': 'R',
        'S': '§',
        'T': '†',
        'U': 'Ú',
        'V': 'V',
        'W': 'W',
        'X': '×',
        'Y': '¥',
        'Z': 'Z'
    },
    greekCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'в',
        'c': '¢',
        'd': '∂',
        'e': 'є',
        'f': 'ƒ',
        'g': 'g',
        'h': 'н',
        'i': 'ι',
        'j': 'נ',
        'k': 'к',
        'l': 'ℓ',
        'm': 'м',
        'n': 'η',
        'o': 'σ',
        'p': 'ρ',
        'q': 'q',
        'r': 'я',
        's': 'ѕ',
        't': 'т',
        'u': 'υ',
        'v': 'ν',
        'w': 'ω',
        'x': 'χ',
        'y': 'у',
        'z': 'z',
        'A': 'α',
        'B': 'в',
        'C': '¢',
        'D': '∂',
        'E': 'є',
        'F': 'ƒ',
        'G': 'g',
        'H': 'н',
        'I': 'ι',
        'J': 'נ',
        'K': 'к',
        'L': 'ℓ',
        'M': 'м',
        'N': 'η',
        'O': 'σ',
        'P': 'ρ',
        'Q': 'q',
        'R': 'я',
        'S': 'ѕ',
        'T': 'т',
        'U': 'υ',
        'V': 'ν',
        'W': 'ω',
        'X': 'χ',
        'Y': 'у',
        'Z': 'z'
    },
    bentTextCharMap = {
        0x0: '⊘',
        0x1: '𝟙',
        0x2: 'ϩ',
        0x3: 'Ӡ',
        0x4: '५',
        0x5: 'Ƽ',
        0x6: 'Ϭ',
        0x7: '7',
        0x8: '𝟠',
        0x9: '९',
        'a': 'ą',
        'b': 'ҍ',
        'c': 'ç',
        'd': 'ժ',
        'e': 'ҽ',
        'f': 'ƒ',
        'g': 'ց',
        'h': 'հ',
        'i': 'ì',
        'j': 'ʝ',
        'k': 'ҟ',
        'l': 'Ӏ',
        'm': 'ʍ',
        'n': 'ղ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'է',
        'u': 'մ',
        'v': 'ѵ',
        'w': 'ա',
        'x': '×',
        'y': 'վ',
        'z': 'Հ',
        'A': 'Ⱥ',
        'B': 'β',
        'C': '↻',
        'D': 'Ꭰ',
        'E': 'Ɛ',
        'F': 'Ƒ',
        'G': 'Ɠ',
        'H': 'Ƕ',
        'I': 'į',
        'J': 'ل',
        'K': 'Ҡ',
        'L': 'Ꝉ',
        'M': 'Ɱ',
        'N': 'ហ',
        'O': 'ට',
        'P': 'φ',
        'Q': 'Ҩ',
        'R': 'འ',
        'S': 'Ϛ',
        'T': 'Ͳ',
        'U': 'Ա',
        'V': 'Ỽ',
        'W': 'చ',
        'X': 'ჯ',
        'Y': 'Ӌ',
        'Z': 'ɀ'
    },
    upperAnglesCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Λ',
        'b': 'B',
        'c': 'ᄃ',
        'd': 'D',
        'e': 'Σ',
        'f': 'F',
        'g': 'G',
        'h': 'Ή',
        'i': 'I',
        'j': 'J',
        'k': 'K',
        'l': 'ᄂ',
        'm': 'M',
        'n': 'П',
        'o': 'Ө',
        'p': 'P',
        'q': 'Q',
        'r': 'Я',
        's': 'Ƨ',
        't': 'Ƭ',
        'u': 'Ц',
        'v': 'V',
        'w': 'Щ',
        'x': 'X',
        'y': 'Y',
        'z': 'Z',
        'A': 'Λ',
        'B': 'B',
        'C': 'ᄃ',
        'D': 'D',
        'E': 'Σ',
        'F': 'F',
        'G': 'G',
        'H': 'Ή',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'ᄂ',
        'M': 'M',
        'N': 'П',
        'O': 'Ө',
        'P': 'P',
        'Q': 'Q',
        'R': 'Я',
        'S': 'Ƨ',
        'T': 'Ƭ',
        'U': 'Ц',
        'V': 'V',
        'W': 'Щ',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    subscriptCharMap = {
        0x0: '₀',
        0x1: '₁',
        0x2: '₂',
        0x3: '₃',
        0x4: '₄',
        0x5: '₅',
        0x6: '₆',
        0x7: '₇',
        0x8: '₈',
        0x9: '₉',
        'a': 'ₐ',
        'b': 'b',
        'c': 'c',
        'd': 'd',
        'e': 'ₑ',
        'f': 'f',
        'g': 'g',
        'h': 'ₕ',
        'i': 'ᵢ',
        'j': 'ⱼ',
        'k': 'ₖ',
        'l': 'ₗ',
        'm': 'ₘ',
        'n': 'ₙ',
        'o': 'ₒ',
        'p': 'ₚ',
        'q': 'q',
        'r': 'ᵣ',
        's': 'ₛ',
        't': 'ₜ',
        'u': 'ᵤ',
        'v': 'ᵥ',
        'w': 'w',
        'x': 'ₓ',
        'y': 'y',
        'z': 'z',
        'A': 'ₐ',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'ₑ',
        'F': 'F',
        'G': 'G',
        'H': 'ₕ',
        'I': 'ᵢ',
        'J': 'ⱼ',
        'K': 'ₖ',
        'L': 'ₗ',
        'M': 'ₘ',
        'N': 'ₙ',
        'O': 'ₒ',
        'P': 'ₚ',
        'Q': 'Q',
        'R': 'ᵣ',
        'S': 'ₛ',
        'T': 'ₜ',
        'U': 'ᵤ',
        'V': 'ᵥ',
        'W': 'W',
        'X': 'ₓ',
        'Y': 'Y',
        'Z': 'Z',
        '+': '₊',
        '-': '₋',
        '=': '₌',
        '(': '₍',
        ')': '₎'
    },
    superscriptCharMap = {
        0x0: '⁰',
        0x1: '¹',
        0x2: '²',
        0x3: '³',
        0x4: '⁴',
        0x5: '⁵',
        0x6: '⁶',
        0x7: '⁷',
        0x8: '⁸',
        0x9: '⁹',
        'a': 'ᵃ',
        'b': 'ᵇ',
        'c': 'ᶜ',
        'd': 'ᵈ',
        'e': 'ᵉ',
        'f': 'ᶠ',
        'g': 'ᵍ',
        'h': 'ʰ',
        'i': 'ⁱ',
        'j': 'ʲ',
        'k': 'ᵏ',
        'l': 'ˡ',
        'm': 'ᵐ',
        'n': 'ⁿ',
        'o': 'ᵒ',
        'p': 'ᵖ',
        'q': 'q',
        'r': 'ʳ',
        's': 'ˢ',
        't': 'ᵗ',
        'u': 'ᵘ',
        'v': 'ᵛ',
        'w': 'ʷ',
        'x': 'ˣ',
        'y': 'ʸ',
        'z': 'ᶻ',
        'A': 'ᴬ',
        'B': 'ᴮ',
        'C': 'ᶜ',
        'D': 'ᴰ',
        'E': 'ᴱ',
        'F': 'ᶠ',
        'G': 'ᴳ',
        'H': 'ᴴ',
        'I': 'ᴵ',
        'J': 'ᴶ',
        'K': 'ᴷ',
        'L': 'ᴸ',
        'M': 'ᴹ',
        'N': 'ᴺ',
        'O': 'ᴼ',
        'P': 'ᴾ',
        'Q': 'Q',
        'R': 'ᴿ',
        'S': 'ˢ',
        'T': 'ᵀ',
        'U': 'ᵁ',
        'V': 'ⱽ',
        'W': 'ᵂ',
        'X': 'ˣ',
        'Y': 'ʸ',
        'Z': 'ᶻ',
        '+': '⁺',
        '-': '⁻',
        '=': '⁼',
        '(': '⁽',
        ')': '⁾'
    },
    squiggleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๒',
        'c': 'ς',
        'd': '๔',
        'e': 'є',
        'f': 'Ŧ',
        'g': 'ﻮ',
        'h': 'ђ',
        'i': 'เ',
        'j': 'ן',
        'k': 'к',
        'l': 'ɭ',
        'm': '๓',
        'n': 'ภ',
        'o': '๏',
        'p': 'ק',
        'q': 'ợ',
        'r': 'г',
        's': 'ร',
        't': 'Շ',
        'u': 'ย',
        'v': 'ש',
        'w': 'ฬ',
        'x': 'א',
        'y': 'ץ',
        'z': 'չ',
        'A': 'ค',
        'B': '๒',
        'C': 'ς',
        'D': '๔',
        'E': 'є',
        'F': 'Ŧ',
        'G': 'ﻮ',
        'H': 'ђ',
        'I': 'เ',
        'J': 'ן',
        'K': 'к',
        'L': 'ɭ',
        'M': '๓',
        'N': 'ภ',
        'O': '๏',
        'P': 'ק',
        'Q': 'ợ',
        'R': 'г',
        'S': 'ร',
        'T': 'Շ',
        'U': 'ย',
        'V': 'ש',
        'W': 'ฬ',
        'X': 'א',
        'Y': 'ץ',
        'Z': 'չ'
    },
    doubleStruckCharMap = {
        0x0: '𝟘',
        0x1: '𝟙',
        0x2: '𝟚',
        0x3: '𝟛',
        0x4: '𝟜',
        0x5: '𝟝',
        0x6: '𝟞',
        0x7: '𝟟',
        0x8: '𝟠',
        0x9: '𝟡',
        'a': '𝕒',
        'b': '𝕓',
        'c': '𝕔',
        'd': '𝕕',
        'e': '𝕖',
        'f': '𝕗',
        'g': '𝕘',
        'h': '𝕙',
        'i': '𝕚',
        'j': '𝕛',
        'k': '𝕜',
        'l': '𝕝',
        'm': '𝕞',
        'n': '𝕟',
        'o': '𝕠',
        'p': '𝕡',
        'q': '𝕢',
        'r': '𝕣',
        's': '𝕤',
        't': '𝕥',
        'u': '𝕦',
        'v': '𝕧',
        'w': '𝕨',
        'x': '𝕩',
        'y': '𝕪',
        'z': '𝕫',
        'A': '𝔸',
        'B': '𝔹',
        'C': 'ℂ',
        'D': '𝔻',
        'E': '𝔼',
        'F': '𝔽',
        'G': '𝔾',
        'H': 'ℍ',
        'I': '𝕀',
        'J': '𝕁',
        'K': '𝕂',
        'L': '𝕃',
        'M': '𝕄',
        'N': 'ℕ',
        'O': '𝕆',
        'P': 'ℙ',
        'Q': 'ℚ',
        'R': 'ℝ',
        'S': '𝕊',
        'T': '𝕋',
        'U': '𝕌',
        'V': '𝕍',
        'W': '𝕎',
        'X': '𝕏',
        'Y': '𝕐',
        'Z': 'ℤ'
    },
    medievalCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝖆',
        'b': '𝖇',
        'c': '𝖈',
        'd': '𝖉',
        'e': '𝖊',
        'f': '𝖋',
        'g': '𝖌',
        'h': '𝖍',
        'i': '𝖎',
        'j': '𝖏',
        'k': '𝖐',
        'l': '𝖑',
        'm': '𝖒',
        'n': '𝖓',
        'o': '𝖔',
        'p': '𝖕',
        'q': '𝖖',
        'r': '𝖗',
        's': '𝖘',
        't': '𝖙',
        'u': '𝖚',
        'v': '𝖛',
        'w': '𝖜',
        'x': '𝖝',
        'y': '𝖞',
        'z': '𝖟',
        'A': '𝕬',
        'B': '𝕭',
        'C': '𝕮',
        'D': '𝕯',
        'E': '𝕰',
        'F': '𝕱',
        'G': '𝕲',
        'H': '𝕳',
        'I': '𝕴',
        'J': '𝕵',
        'K': '𝕶',
        'L': '𝕷',
        'M': '𝕸',
        'N': '𝕹',
        'O': '𝕺',
        'P': '𝕻',
        'Q': '𝕼',
        'R': '𝕽',
        'S': '𝕾',
        'T': '𝕿',
        'U': '𝖀',
        'V': '𝖁',
        'W': '𝖂',
        'X': '𝖃',
        'Y': '𝖄',
        'Z': '𝖅'
    },
    invertedSquaresCharMap = {
        'q': '🆀',
        'w': '🆆',
        'e': '🅴',
        'r': '🆁',
        't': '🆃',
        'y': '🆈',
        'u': '🆄',
        'i': '🅸',
        'o': '🅾',
        'p': '🅿',
        'a': '🅰',
        's': '🆂',
        'd': '🅳',
        'f': '🅵',
        'g': '🅶',
        'h': '🅷',
        'j': '🅹',
        'k': '🅺',
        'l': '🅻',
        'z': '🆉',
        'x': '🆇',
        'c': '🅲',
        'v': '🆅',
        'b': '🅱',
        'n': '🅽',
        'm': '🅼'
    },
    cursiveCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝓪',
        'b': '𝓫',
        'c': '𝓬',
        'd': '𝓭',
        'e': '𝓮',
        'f': '𝓯',
        'g': '𝓰',
        'h': '𝓱',
        'i': '𝓲',
        'j': '𝓳',
        'k': '𝓴',
        'l': '𝓵',
        'm': '𝓶',
        'n': '𝓷',
        'o': '𝓸',
        'p': '𝓹',
        'q': '𝓺',
        'r': '𝓻',
        's': '𝓼',
        't': '𝓽',
        'u': '𝓾',
        'v': '𝓿',
        'w': '𝔀',
        'x': '𝔁',
        'y': '𝔂',
        'z': '𝔃',
        'A': '𝓐',
        'B': '𝓑',
        'C': '𝓒',
        'D': '𝓓',
        'E': '𝓔',
        'F': '𝓕',
        'G': '𝓖',
        'H': '𝓗',
        'I': '𝓘',
        'J': '𝓙',
        'K': '𝓚',
        'L': '𝓛',
        'M': '𝓜',
        'N': '𝓝',
        'O': '𝓞',
        'P': '𝓟',
        'Q': '𝓠',
        'R': '𝓡',
        'S': '𝓢',
        'T': '𝓣',
        'U': '𝓤',
        'V': '𝓥',
        'W': '𝓦',
        'X': '𝓧',
        'Y': '𝓨',
        'Z': '𝓩'
    },
    oldEnglishCharMap = {
        'a': '𝔞',
        'b': '𝔟',
        'c': '𝔠',
        'd': '𝔡',
        'e': '𝔢',
        'f': '𝔣',
        'g': '𝔤',
        'h': '𝔥',
        'i': '𝔦',
        'j': '𝔧',
        'k': '𝔨',
        'l': '𝔩',
        'm': '𝔪',
        'n': '𝔫',
        'o': '𝔬',
        'p': '𝔭',
        'q': '𝔮',
        'r': '𝔯',
        's': '𝔰',
        't': '𝔱',
        'u': '𝔲',
        'v': '𝔳',
        'w': '𝔴',
        'x': '𝔵',
        'y': '𝔶',
        'z': '𝔷',
        'A': '𝔄',
        'B': '𝔅',
        'C': 'ℭ',
        'D': '𝔇',
        'E': '𝔈',
        'F': '𝔉',
        'G': '𝔊',
        'H': 'ℌ',
        'I': 'ℑ',
        'J': '𝔍',
        'K': '𝔎',
        'L': '𝔏',
        'M': '𝔐',
        'N': '𝔑',
        'O': '𝔒',
        'P': '𝔓',
        'Q': '𝔔',
        'R': 'ℜ',
        'S': '𝔖',
        'T': '𝔗',
        'U': '𝔘',
        'V': '𝔙',
        'W': '𝔚',
        'X': '𝔛',
        'Y': '𝔜',
        'Z': 'ℨ'
    },
    wideTextCharMap = {
        '`': '`',
        0x1: '１',
        0x2: '２',
        0x3: '３',
        0x4: '４',
        0x5: '５',
        0x6: '６',
        0x7: '７',
        0x8: '８',
        0x9: '９',
        0x0: '０',
        '-': '－',
        '=': '＝',
        '~': '~',
        '!': '！',
        '@': '＠',
        '#': '＃',
        '$': '＄',
        '%': '％',
        '^': '^',
        '&': '＆',
        '*': '＊',
        '(': '（',
        ')': '）',
        '_': '_',
        '+': '＋',
        'q': 'ｑ',
        'w': 'ｗ',
        'e': 'ｅ',
        'r': 'ｒ',
        't': 'ｔ',
        'y': 'ｙ',
        'u': 'ｕ',
        'i': 'ｉ',
        'o': 'ｏ',
        'p': 'ｐ',
        '[': '[',
        ']': ']',
        '\x5c': '\x5c',
        'Q': 'Ｑ',
        'W': 'Ｗ',
        'E': 'Ｅ',
        'R': 'Ｒ',
        'T': 'Ｔ',
        'Y': 'Ｙ',
        'U': 'Ｕ',
        'I': 'Ｉ',
        'O': 'Ｏ',
        'P': 'Ｐ',
        '{': '{',
        '}': '}',
        '|': '|',
        'a': 'ａ',
        's': 'ｓ',
        'd': 'ｄ',
        'f': 'ｆ',
        'g': 'ｇ',
        'h': 'ｈ',
        'j': 'ｊ',
        'k': 'ｋ',
        'l': 'ｌ',
        ';': '；',
        '\x27': '＇',
        'A': 'Ａ',
        'S': 'Ｓ',
        'D': 'Ｄ',
        'F': 'Ｆ',
        'G': 'Ｇ',
        'H': 'Ｈ',
        'J': 'Ｊ',
        'K': 'Ｋ',
        'L': 'Ｌ',
        ':': '：',
        '\x22': '\x22',
        'z': 'ｚ',
        'x': 'ｘ',
        'c': 'ｃ',
        'v': 'ｖ',
        'b': 'ｂ',
        'n': 'ｎ',
        'm': 'ｍ',
        ',': '，',
        '.': '．',
        '/': '／',
        'Z': 'Ｚ',
        'X': 'Ｘ',
        'C': 'Ｃ',
        'V': 'Ｖ',
        'B': 'Ｂ',
        'N': 'Ｎ',
        'M': 'Ｍ',
        '<': '<',
        '>': '>',
        '?': '？'
    };

function Lunicode() {
    var _0x5ec664 = _0xf5fb9b;
    this[_0x5ec664(0x458)] = {
        'flip': {
            'init': function() {
                var _0x44822c = _0x5ec664;
                for (i in this['map']) this['map'][this[_0x44822c(0x29e)][i]] = i;
            },
            'encode': function(_0x5ca9ae) {
                var _0x13ece8 = _0x5ec664;
                for (var _0x5c3e86, _0x122461 = [], _0x416383 = 0x0, _0x2c7c29 = _0x5ca9ae['length']; _0x2c7c29 > _0x416383; _0x416383++) _0x5c3e86 = _0x5ca9ae['charAt'](_0x416383), _0x416383 > 0x0 && ('̤' == _0x5c3e86 || '̗' == _0x5c3e86 || '̖' == _0x5c3e86 || '̮' == _0x5c3e86) ? (_0x5c3e86 = this[_0x13ece8(0x29e)][_0x5ca9ae[_0x13ece8(0x4b9)](_0x416383 - 0x1) + _0x5c3e86], _0x122461[_0x13ece8(0x118)]()) : (_0x5c3e86 = this[_0x13ece8(0x29e)][_0x5c3e86], _0x13ece8(0x125) == typeof _0x5c3e86 && (_0x5c3e86 = _0x5ca9ae[_0x13ece8(0x4b9)](_0x416383))), _0x122461['push'](_0x5c3e86);
                return _0x122461[_0x13ece8(0x45c)]()[_0x13ece8(0x5c)]('');
            },
            'decode': function(_0x7f8ca3) {
                var _0x2f8857 = _0x5ec664;
                for (var _0x360161, _0x406f3d = [], _0x3a5096 = 0x0, _0x6ae794 = _0x7f8ca3[_0x2f8857(0x230)]; _0x6ae794 > _0x3a5096; _0x3a5096++) _0x360161 = _0x7f8ca3[_0x2f8857(0x4b9)](_0x3a5096), _0x3a5096 > 0x0 && ('̤' == _0x360161 || '̗' == _0x360161 || '̖' == _0x360161 || '̮' == _0x360161) ? (_0x360161 = this['map'][_0x7f8ca3[_0x2f8857(0x4b9)](_0x3a5096 - 0x1) + _0x360161], _0x406f3d[_0x2f8857(0x118)]()) : (_0x360161 = this[_0x2f8857(0x29e)][_0x360161], _0x2f8857(0x125) == typeof _0x360161 && (_0x360161 = _0x7f8ca3[_0x2f8857(0x4b9)](_0x3a5096))), _0x406f3d[_0x2f8857(0x34b)](_0x360161);
                return _0x406f3d[_0x2f8857(0x45c)]()[_0x2f8857(0x5c)]('');
            },
            'map': {
                'a': 'ɐ',
                'b': 'q',
                'c': 'ɔ',
                'd': 'p',
                'e': 'ǝ',
                'f': 'ɟ',
                'g': 'ɓ',
                'h': 'ɥ',
                'i': 'ı',
                'j': 'ɾ',
                'k': 'ʞ',
                'l': 'l',
                'm': 'ɯ',
                'n': 'u',
                'r': 'ɹ',
                't': 'ʇ',
                'v': 'ʌ',
                'w': 'ʍ',
                'y': 'ʎ',
                'A': '∀',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'Ⅎ',
                'G': '⅁',
                'J': 'ſ',
                'K': '⋊',
                'L': '˥',
                'M': 'W',
                'P': 'Ԁ',
                'Q': 'Ό',
                'R': 'ᴚ',
                'T': '⊥',
                'U': '∩',
                'V': 'Λ',
                'Y': '⅄',
                0x1: '⇂',
                0x2: 'ᄅ',
                0x3: 'Ɛ',
                0x4: 'ㄣ',
                0x5: 'ގ',
                0x6: '9',
                0x7: 'ㄥ',
                '&': '⅋',
                '.': '˙',
                '\x22': '„',
                ';': '؛',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '¿',
                '!': '¡',
                '\x27': ',',
                '<': '>',
                '‾': '_',
                '¯': '_',
                '‿': '⁀',
                '⁅': '⁆',
                '∴': '∵',
                '\x0d': '\x0a',
                'ß': 'ᙠ',
                '̈': '̤',
                'ä': 'ɐ̤',
                'ö': 'o̤',
                'ü': 'n̤',
                'Ä': '∀̤',
                'Ö': 'O̤',
                'Ü': '∩̤',
                '´': '\x20̗',
                'é': 'ǝ̗',
                'á': 'ɐ̗',
                'ó': 'o̗',
                'ú': 'n̗',
                'É': 'Ǝ̗',
                'Á': '∀̗',
                'Ó': 'O̗',
                'Ú': '∩̗',
                '`': '\x20̖',
                'è': 'ǝ̖',
                'à': 'ɐ̖',
                'ò': 'o̖',
                'ù': 'n̖',
                'È': 'Ǝ̖',
                'À': '∀̖',
                'Ò': 'O̖',
                'Ù': '∩̖',
                '^': '\x20̮',
                'ê': 'ǝ̮',
                'â': 'ɐ̮',
                'ô': 'o̮',
                'û': 'n̮',
                'Ê': 'Ǝ̮',
                'Â': '∀̮',
                'Ô': 'O̮',
                'Û': '∩̮'
            }
        },
        'mirror': {
            'init': function() {
                var _0x381afa = _0x5ec664;
                for (i in this[_0x381afa(0x29e)]) this[_0x381afa(0x29e)][this['map'][i]] = i;
            },
            'encode': function(_0x407143) {
                var _0xb1b373 = _0x5ec664;
                for (var _0x28bae3, _0x56bbd2 = [], _0x48004b = [], _0x4cc76b = 0x0, _0xd99b2a = _0x407143['length']; _0xd99b2a > _0x4cc76b; _0x4cc76b++) _0x28bae3 = _0x407143[_0xb1b373(0x4b9)](_0x4cc76b), _0x4cc76b > 0x0 && ('̈' == _0x28bae3 || '̀' == _0x28bae3 || '́' == _0x28bae3 || '̂' == _0x28bae3) ? (_0x28bae3 = this[_0xb1b373(0x29e)][_0x407143[_0xb1b373(0x4b9)](_0x4cc76b - 0x1) + _0x28bae3], _0x56bbd2[_0xb1b373(0x118)]()) : (_0x28bae3 = this[_0xb1b373(0x29e)][_0x28bae3], _0xb1b373(0x125) == typeof _0x28bae3 && (_0x28bae3 = _0x407143[_0xb1b373(0x4b9)](_0x4cc76b))), '\x0a' == _0x28bae3 ? (_0x48004b[_0xb1b373(0x34b)](_0x56bbd2[_0xb1b373(0x45c)]()['join']('')), _0x56bbd2 = []) : _0x56bbd2[_0xb1b373(0x34b)](_0x28bae3);
                return _0x48004b[_0xb1b373(0x34b)](_0x56bbd2['reverse']()[_0xb1b373(0x5c)]('')), _0x48004b[_0xb1b373(0x5c)]('\x0a');
            },
            'decode': function(_0x46803b) {
                var _0x1ac408 = _0x5ec664;
                for (var _0x269ec5, _0x4941c6 = [], _0x374b4c = [], _0x45533d = 0x0, _0x4a7d6e = _0x46803b[_0x1ac408(0x230)]; _0x4a7d6e > _0x45533d; _0x45533d++) _0x269ec5 = _0x46803b[_0x1ac408(0x4b9)](_0x45533d), _0x45533d > 0x0 && ('̈' == _0x269ec5 || '̀' == _0x269ec5 || '́' == _0x269ec5 || '̂' == _0x269ec5) ? (_0x269ec5 = this['map'][_0x46803b[_0x1ac408(0x4b9)](_0x45533d - 0x1) + _0x269ec5], _0x4941c6[_0x1ac408(0x118)]()) : (_0x269ec5 = this[_0x1ac408(0x29e)][_0x269ec5], _0x1ac408(0x125) == typeof _0x269ec5 && (_0x269ec5 = _0x46803b[_0x1ac408(0x4b9)](_0x45533d))), '\x0a' == _0x269ec5 ? (_0x374b4c[_0x1ac408(0x34b)](_0x4941c6['reverse']()[_0x1ac408(0x5c)]('')), _0x4941c6 = []) : _0x4941c6[_0x1ac408(0x34b)](_0x269ec5);
                return _0x374b4c[_0x1ac408(0x34b)](_0x4941c6['reverse']()[_0x1ac408(0x5c)]('')), _0x374b4c[_0x1ac408(0x5c)]('\x0a');
            },
            'map': {
                'a': 'ɒ',
                'b': 'd',
                'c': 'ɔ',
                'e': 'ɘ',
                'f': 'Ꮈ',
                'g': 'ǫ',
                'h': 'ʜ',
                'j': 'ꞁ',
                'k': 'ʞ',
                'l': '|',
                'n': 'ᴎ',
                'p': 'q',
                'r': 'ɿ',
                's': 'ꙅ',
                't': 'ƚ',
                'y': 'ʏ',
                'z': 'ƹ',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'ꟻ',
                'G': 'Ꭾ',
                'J': 'Ⴑ',
                'K': '⋊',
                'L': '⅃',
                'N': 'Ͷ',
                'P': 'ꟼ',
                'Q': 'Ọ',
                'R': 'Я',
                'S': 'Ꙅ',
                'Z': 'Ƹ',
                0x1: '',
                0x2: '',
                0x3: '',
                0x4: '',
                0x5: '',
                0x6: '',
                0x7: '',
                '&': '',
                ';': '',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '⸮',
                '<': '>',
                'ä': 'ɒ̈',
                'ß': 'ᙠ',
                '´': '`',
                'é': 'ɘ̀',
                'á': 'ɒ̀',
                'ó': 'ò',
                'ú': 'ù',
                'É': 'Ǝ̀',
                'Á': 'À',
                'Ó': 'Ò',
                'Ú': 'Ù',
                '`': '´',
                'è': 'ɘ́',
                'à': 'ɒ́',
                'È': 'Ǝ́',
                'ê': 'ɘ̂',
                'â': 'ɒ̂',
                'Ê': 'Ǝ̂',
                'Ø': 'ᴓ',
                'ø': 'ᴓ'
            }
        },
        'creepify': {
            'init': function() {
                var _0x2eef57 = _0x5ec664;
                for (var _0x4bb023 = 0x300; 0x315 >= _0x4bb023; _0x4bb023++) this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String['fromCharCode'](_0x4bb023));
                for (var _0x4bb023 = 0x316; 0x333 >= _0x4bb023; _0x4bb023++) 0x31a != _0x4bb023 && 0x31b != _0x4bb023 && this['diacriticsBottom'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](_0x4bb023));
                this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x31a)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x31b));
                for (var _0x4bb023 = 0x334; 0x338 >= _0x4bb023; _0x4bb023++) this[_0x2eef57(0x3ec)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](_0x4bb023));
                for (var _0x4bb023 = 0x339; 0x33c >= _0x4bb023; _0x4bb023++) this[_0x2eef57(0x26f)]['push'](String[_0x2eef57(0x3c8)](_0x4bb023));
                for (var _0x4bb023 = 0x33d; 0x344 >= _0x4bb023; _0x4bb023++) this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](_0x4bb023));
                this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x344)), this['diacriticsBottom']['push'](String[_0x2eef57(0x3c8)](0x345)), this['diacriticsTop'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x346)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x347)), this['diacriticsBottom'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x348)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x349)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x34a)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String['fromCharCode'](0x34b)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x34c)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String['fromCharCode'](0x34d)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x34e)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x350)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x351)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x352)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x353)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String['fromCharCode'](0x354)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x355)), this[_0x2eef57(0x26f)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x356)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x357)), this[_0x2eef57(0x425)]['push'](String['fromCharCode'](0x358)), this['diacriticsBottom'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x359)), this['diacriticsBottom'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x35a)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x35b)), this['diacriticsBottom'][_0x2eef57(0x34b)](String['fromCharCode'](0x35c)), this[_0x2eef57(0x425)]['push'](String[_0x2eef57(0x3c8)](0x35d)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x35d)), this['diacriticsBottom'][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x35f)), this[_0x2eef57(0x425)][_0x2eef57(0x34b)](String[_0x2eef57(0x3c8)](0x360)), this[_0x2eef57(0x425)]['push'](String[_0x2eef57(0x3c8)](0x361));
            },
            'encode': function(_0x575b32) {
                var _0x27730a = _0x5ec664,
                    _0x2afdab, _0x2c079f = '';
                for (i in _0x575b32) {
                    if (_0x2afdab = _0x575b32[i], this[_0x27730a(0x46a)][_0x27730a(0x4a2)] && (_0x2afdab += this['diacriticsMiddle'][Math[_0x27730a(0x27c)](Math[_0x27730a(0x267)]() * this['diacriticsMiddle']['length'])]), this[_0x27730a(0x46a)][_0x27730a(0x78)]) {
                        for (var _0x534112 = this[_0x27730a(0x425)][_0x27730a(0x230)] - 0x1, _0x922916 = 0x0, _0x3e9d47 = this['options'][_0x27730a(0x85)] - Math['random']() * (this[_0x27730a(0x46a)][_0x27730a(0x376)] / 0x64 * this[_0x27730a(0x46a)]['maxHeight']); _0x3e9d47 > _0x922916; _0x922916++) _0x2afdab += this[_0x27730a(0x425)][Math[_0x27730a(0x27c)](Math[_0x27730a(0x267)]() * _0x534112)];
                    }
                    if (this[_0x27730a(0x46a)]['bottom']) {
                        for (var _0x276710 = this[_0x27730a(0x26f)][_0x27730a(0x230)] - 0x1, _0x922916 = 0x0, _0x3e9d47 = this['options']['maxHeight'] - Math[_0x27730a(0x267)]() * (this[_0x27730a(0x46a)][_0x27730a(0x376)] / 0x64 * this[_0x27730a(0x46a)][_0x27730a(0x85)]); _0x3e9d47 > _0x922916; _0x922916++) _0x2afdab += this[_0x27730a(0x26f)][Math[_0x27730a(0x27c)](Math[_0x27730a(0x267)]() * _0x276710)];
                    }
                    _0x2c079f += _0x2afdab;
                }
                return _0x2c079f;
            },
            'decode': function(_0x4b6b0b) {
                var _0x23ae91 = _0x5ec664,
                    _0x4ec32b, _0x5b31ef = '';
                for (i in _0x4b6b0b) _0x4ec32b = _0x4b6b0b[i][_0x23ae91(0x47)](0x0), (0x300 > _0x4ec32b || _0x4ec32b > 0x361) && (_0x5b31ef += _0x4b6b0b[i]);
                return _0x5b31ef;
            },
            'diacriticsTop': [],
            'diacriticsMiddle': [],
            'diacriticsBottom': [],
            'options': {
                'top': !0x0,
                'middle': !0x0,
                'bottom': !0x0,
                'maxHeight': 0xf,
                'randomization': 0x64
            }
        },
        'bubbles': {
            'init': function() {
                var _0x5e931c = _0x5ec664;
                for (var _0x183c5c = 0x31; 0x39 >= _0x183c5c; _0x183c5c++) this[_0x5e931c(0x29e)][String[_0x5e931c(0x3c8)](_0x183c5c)] = String[_0x5e931c(0x3c8)](_0x183c5c + 0x242f);
                this[_0x5e931c(0x29e)][0x0] = '⓪';
                for (var _0x183c5c = 0x41; 0x5a >= _0x183c5c; _0x183c5c++) this[_0x5e931c(0x29e)][String[_0x5e931c(0x3c8)](_0x183c5c)] = String[_0x5e931c(0x3c8)](_0x183c5c + 0x2475);
                for (var _0x183c5c = 0x61; 0x7a >= _0x183c5c; _0x183c5c++) this[_0x5e931c(0x29e)][String[_0x5e931c(0x3c8)](_0x183c5c)] = String[_0x5e931c(0x3c8)](_0x183c5c + 0x246f);
                for (_0x183c5c in this['map']) this[_0x5e931c(0x6d)][this[_0x5e931c(0x29e)][_0x183c5c]] = _0x183c5c;
            },
            'encode': function(_0x112d09) {
                var _0xb1e62d = _0x5ec664,
                    _0x418845, _0x586c50 = '',
                    _0x125194 = !0x0;
                for (i in _0x112d09) _0x418845 = this['map'][_0x112d09[i]], _0xb1e62d(0x125) == typeof _0x418845 && (_0x112d09[i][_0xb1e62d(0x47)](0x0) >= 0x21 ? (_0x418845 = _0x112d09[i] + String[_0xb1e62d(0x3c8)](0x20dd), _0x125194 || (_0x418845 = String[_0xb1e62d(0x3c8)](0x202f) + String[_0xb1e62d(0x3c8)](0xa0) + String['fromCharCode'](0xa0) + String[_0xb1e62d(0x3c8)](0x202f) + _0x418845)) : _0x418845 = _0x112d09[i]), _0x586c50 += _0x418845, _0x125194 = '\x0a' == _0x418845;
                return _0x586c50;
            },
            'decode': function(_0x938ce2) {
                var _0x5f040c = _0x5ec664,
                    _0x29b5ba, _0x3219ff = '',
                    _0x277dab = '';
                for (i in _0x938ce2) _0x29b5ba = this[_0x5f040c(0x6d)][_0x938ce2[i]], _0x3219ff += _0x5f040c(0x125) == typeof _0x29b5ba ? _0x938ce2[i] : _0x29b5ba;
                for (i in _0x3219ff) _0x29b5ba = _0x3219ff[i][_0x5f040c(0x47)](0x0), 0xa0 != _0x29b5ba && 0x202f != _0x29b5ba && 0x20dd != _0x29b5ba && (_0x277dab += _0x3219ff[i]);
                return _0x277dab;
            },
            'map': {},
            'mapInverse': {}
        },
        'squares': {
            'init': function() {},
            'encode': function(_0x19b7aa) {
                var _0x4b0eb3 = _0x5ec664,
                    _0x5eb36b, _0x16ad7b = '',
                    _0x17e3ec = !0x0;
                for (i in _0x19b7aa) _0x19b7aa[i][_0x4b0eb3(0x47)](0x0) >= 0x21 ? (_0x5eb36b = _0x19b7aa[i] + String[_0x4b0eb3(0x3c8)](0x20de), _0x17e3ec || (_0x5eb36b = String['fromCharCode'](0x202f) + String[_0x4b0eb3(0x3c8)](0xa0) + String[_0x4b0eb3(0x3c8)](0xa0) + String['fromCharCode'](0x202f) + _0x5eb36b)) : _0x5eb36b = _0x19b7aa[i], _0x16ad7b += _0x5eb36b, _0x17e3ec = '\x0a' == _0x5eb36b;
                return _0x16ad7b;
            },
            'decode': function(_0x43e24f) {
                var _0x20a2c1 = _0x5ec664,
                    _0x65c5e0, _0x4709bb = '';
                for (i in _0x43e24f) _0x65c5e0 = _0x43e24f[i][_0x20a2c1(0x47)](0x0), 0xa0 != _0x65c5e0 && 0x202f != _0x65c5e0 && 0x20de != _0x65c5e0 && (_0x4709bb += _0x43e24f[i]);
                return _0x4709bb;
            }
        },
        'roundsquares': {
            'init': function() {},
            'encode': function(_0x14a84c) {
                var _0x5402a6 = _0x5ec664,
                    _0x4e9bfb, _0x346112 = '',
                    _0x11dee4 = !0x0;
                for (i in _0x14a84c) _0x14a84c[i][_0x5402a6(0x47)](0x0) >= 0x21 ? (_0x4e9bfb = _0x14a84c[i] + String[_0x5402a6(0x3c8)](0x20e3), _0x11dee4 || (_0x4e9bfb = String[_0x5402a6(0x3c8)](0xa0) + String[_0x5402a6(0x3c8)](0xa0) + String[_0x5402a6(0x3c8)](0xa0) + _0x4e9bfb)) : _0x4e9bfb = _0x14a84c[i], _0x346112 += _0x4e9bfb, _0x11dee4 = '\x0a' == _0x4e9bfb;
                return _0x346112;
            },
            'decode': function(_0x13da6c) {
                var _0x47bdab = _0x5ec664,
                    _0x54564a, _0x3a4256 = '';
                for (i in _0x13da6c) _0x54564a = _0x13da6c[i][_0x47bdab(0x47)](0x0), 0xa0 != _0x54564a && 0x202f != _0x54564a && 0x20e3 != _0x54564a && (_0x3a4256 += _0x13da6c[i]);
                return _0x3a4256;
            }
        },
        'bent': {
            'init': function() {
                var _0x514b07 = _0x5ec664;
                for (i in this[_0x514b07(0x29e)]) this[_0x514b07(0x29e)][this[_0x514b07(0x29e)][i]] = i;
            },
            'encode': function(_0x353bbd) {
                var _0x2123e3 = _0x5ec664;
                for (var _0x509159, _0x2bfbd6 = '', _0x5c52d5 = 0x0, _0x21262c = _0x353bbd[_0x2123e3(0x230)]; _0x21262c > _0x5c52d5; _0x5c52d5++) _0x509159 = this['map'][_0x353bbd[_0x2123e3(0x4b9)](_0x5c52d5)], _0x2123e3(0x125) == typeof _0x509159 && (_0x509159 = _0x353bbd[_0x2123e3(0x4b9)](_0x5c52d5)), _0x2bfbd6 += _0x509159;
                return _0x2bfbd6;
            },
            'decode': function(_0x4b9ef2) {
                var _0x2afc7e = _0x5ec664;
                for (var _0x244590, _0x4d560a = '', _0x1130b6 = 0x0, _0x226160 = _0x4b9ef2[_0x2afc7e(0x230)]; _0x226160 > _0x1130b6; _0x1130b6++) _0x244590 = this[_0x2afc7e(0x29e)][_0x4b9ef2[_0x2afc7e(0x4b9)](_0x1130b6)], _0x2afc7e(0x125) == typeof _0x244590 && (_0x244590 = _0x4b9ef2[_0x2afc7e(0x4b9)](_0x1130b6)), _0x4d560a += _0x244590;
                return _0x4d560a;
            },
            'map': {
                'a': 'ą',
                'b': 'ҍ',
                'c': 'ç',
                'd': 'ժ',
                'e': 'ҽ',
                'f': 'ƒ',
                'g': 'ց',
                'h': 'հ',
                'i': 'ì',
                'j': 'ʝ',
                'k': 'ҟ',
                'l': 'Ӏ',
                'm': 'ʍ',
                'n': 'ղ',
                'o': 'օ',
                'p': 'ք',
                'q': 'զ',
                'r': 'ɾ',
                's': 'ʂ',
                't': 'է',
                'u': 'մ',
                'v': 'ѵ',
                'w': 'ա',
                'x': '×',
                'y': 'վ',
                'z': 'Հ',
                'A': 'Ⱥ',
                'B': 'β',
                'C': '↻',
                'D': 'Ꭰ',
                'E': 'Ɛ',
                'F': 'Ƒ',
                'G': 'Ɠ',
                'H': 'Ƕ',
                'I': 'į',
                'J': 'ل',
                'K': 'Ҡ',
                'L': 'Ꝉ',
                'M': 'Ɱ',
                'N': 'ហ',
                'O': 'ට',
                'P': 'φ',
                'Q': 'Ҩ',
                'R': 'འ',
                'S': 'Ϛ',
                'T': 'Ͳ',
                'U': 'Ա',
                'V': 'Ỽ',
                'W': 'చ',
                'X': 'ჯ',
                'Y': 'Ӌ',
                'Z': 'ɀ',
                0x0: '⊘',
                0x1: _0x5ec664(0x331),
                0x2: 'ϩ',
                0x3: 'Ӡ',
                0x4: '५',
                0x5: 'Ƽ',
                0x6: 'Ϭ',
                0x7: '7',
                0x8: _0x5ec664(0x331),
                0x9: '९',
                '&': '⅋',
                '(': '{',
                ')': '}',
                '{': '(',
                '}': ')',
                'ä': 'ą̈',
                'ö': 'օ̈',
                'ü': 'մ̈',
                'Ä': 'Ⱥ̈',
                'Ö': 'ට̈',
                'Ü': 'Ա̈',
                'é': 'ҽ́',
                'á': 'ą́',
                'ó': 'օ́',
                'ú': 'մ́',
                'É': 'Ɛ́',
                'Á': 'Ⱥ́',
                'Ó': 'ට́',
                'Ú': 'Ա́',
                'è': 'ҽ̀',
                'à': 'ą̀',
                'ò': 'օ̀',
                'ù': 'մ̀',
                'È': 'Ɛ̀',
                'À': 'Ⱥ̀',
                'Ò': 'ට̀',
                'Ù': 'Ա̀',
                'ê': 'ҽ̂',
                'â': 'ą̂',
                'ô': 'օ̂',
                'û': 'մ̂',
                'Ê': 'Ɛ̂',
                'Â': 'Ⱥ̂',
                'Ô': 'ට̂',
                'Û': 'Ա̂'
            }
        },
        'tiny': {
            'init': function() {
                var _0x3427b3 = _0x5ec664;
                for (i in this[_0x3427b3(0x29e)]) this[_0x3427b3(0x29e)][this[_0x3427b3(0x29e)][i]] = i;
            },
            'encode': function(_0x4bacec) {
                var _0x532f69 = _0x5ec664,
                    _0x3c8daf, _0x2c7fa8 = '';
                _0x4bacec = _0x4bacec[_0x532f69(0x2f7)]();
                for (var _0x124bef = 0x0, _0x7b5811 = _0x4bacec[_0x532f69(0x230)]; _0x7b5811 > _0x124bef; _0x124bef++) _0x3c8daf = this['map'][_0x4bacec['charAt'](_0x124bef)], _0x532f69(0x125) == typeof _0x3c8daf && (_0x3c8daf = _0x4bacec[_0x532f69(0x4b9)](_0x124bef)), _0x2c7fa8 += _0x3c8daf;
                return _0x2c7fa8;
            },
            'decode': function(_0x539c4a) {
                var _0x4dad94 = _0x5ec664;
                for (var _0x34960a, _0x3fd596 = '', _0x2696b8 = 0x0, _0x3e3071 = _0x539c4a[_0x4dad94(0x230)]; _0x3e3071 > _0x2696b8; _0x2696b8++) _0x34960a = this[_0x4dad94(0x29e)][_0x539c4a[_0x4dad94(0x4b9)](_0x2696b8)], _0x4dad94(0x125) == typeof _0x34960a && (_0x34960a = _0x539c4a['charAt'](_0x2696b8)), _0x3fd596 += _0x34960a;
                return _0x3fd596;
            },
            'map': {
                'A': 'ᴀ',
                'B': 'ʙ',
                'C': 'ᴄ',
                'D': 'ᴅ',
                'E': 'ᴇ',
                'F': 'ꜰ',
                'G': 'ɢ',
                'H': 'ʜ',
                'I': 'ɪ',
                'J': 'ᴊ',
                'K': 'ᴋ',
                'L': 'ʟ',
                'M': 'ᴍ',
                'N': 'ɴ',
                'O': 'ᴏ',
                'P': 'ᴘ',
                'Q': 'Q',
                'R': 'ʀ',
                'S': 'ꜱ',
                'T': 'ᴛ',
                'U': 'ᴜ',
                'V': 'ᴠ',
                'W': 'ᴡ',
                'X': 'x',
                'Y': 'ʏ',
                'Z': 'ᴢ'
            }
        }
    };
    for (i in this[_0x5ec664(0x458)]) this['tools'][i][_0x5ec664(0x1c8)]();
    this[_0x5ec664(0x90)] = function(_0x3629ed) {
        var _0x1d6b92 = _0x5ec664;
        for (var _0x313901, _0x2b4d9c = '', _0x2c86d6 = !0x0, _0xbea58f = 0x0, _0xaa09a8 = 0x0, _0x58029b = 0x0, _0x114153 = _0x3629ed['length']; _0x114153 > _0x58029b; _0x58029b++) _0x313901 = _0x3629ed[_0x1d6b92(0x47)](_0x58029b), 0xa == _0x313901 || 0xd == _0x313901 ? (_0x2b4d9c += '<br>\x0a', _0x2c86d6 = !0x0) : 0x20 == _0x313901 ? _0x2c86d6 ? (_0x2b4d9c += '\x20', _0x2c86d6 = !0x1) : (_0x2b4d9c += '\x20', _0x2c86d6 = !0x0) : (_0x313901 >= 0xd800 && 0xdbff >= _0x313901 ? (_0xbea58f = _0x313901, _0xaa09a8 = 0x0) : _0xbea58f > 0x0 ? (_0x313901 >= 0xdc00 && 0xdfff >= _0x313901 && (_0xaa09a8 = 0x400 * (_0xbea58f - 0xd800) + (_0x313901 - 0xdc00) + 0x10000), _0xbea58f = 0x0) : _0xaa09a8 = _0x313901, 0x0 != _0xaa09a8 && (_0x2b4d9c += '&#x' + _0xaa09a8[_0x1d6b92(0x13e)](0x10) + ';', _0x2c86d6 = !0x0));
        return _0x2b4d9c;
    };
}

function cuteText(_0x549bba) {
    var _0x7e18ac = _0xf5fb9b;
    if (_0x549bba[_0x7e18ac(0x4b3)]() === '') return '';
    qi = -0x1;
    var _0x2950ae = boundingString(Math[_0x7e18ac(0x27c)](Math[_0x7e18ac(0x267)]() * 0x2) + 0x1);
    return _0x2950ae + _0x7e18ac(0x15f) + _0x549bba[_0x7e18ac(0x1c0)](/([!?.]+)/gi)['map'](cuteSentence)[_0x7e18ac(0x5c)]('') + _0x7e18ac(0x15f) + esrever['reverse'](_0x2950ae);
}

function cuteSentence(_0x284b75) {
    var _0x34f7ec = _0xf5fb9b;
    return _0x284b75[_0x34f7ec(0x1c0)](/([\s,]+)/gi)[_0x34f7ec(0x29e)](cuteWord)[_0x34f7ec(0x5c)]('');
}

function cuteWord(_0x3399fa) {
    var _0x215105 = _0xf5fb9b;
    if (_0x3399fa === '' || /[[!?.\s,]+]/gi [_0x215105(0x1b2)](_0x3399fa)) return _0x3399fa;
    return _0x3399fa = roundReplace(_0x3399fa), _0x3399fa = punctReplace(_0x3399fa), _0x3399fa = emojiReplace(_0x3399fa), scriptify(_0x3399fa);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x24a7c3) {
    var _0x392cd2 = _0xf5fb9b;
    return _0x24a7c3[_0x392cd2(0x1c0)]('')[_0x392cd2(0x29e)](function(_0x42adae) {
        if (_0x42adae === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x42adae === '?') return randomElement(['¿', '?']);
            else {
                if (_0x42adae === '\x22') return quotes();
                else return _0x42adae;
            }
        }
    })[_0x392cd2(0x5c)]('');
}

function emojiReplace(_0x28cfe5) {
    var _0x591754 = _0xf5fb9b;
    return _0x28cfe5[_0x591754(0x1b8)](':)', randomElement(emoji[':)']))[_0x591754(0x1b8)]('(:', randomElement(emoji[':)']))['replace']('^^', randomElement(emoji['^^']))['replace'](':P', randomElement(emoji[':p']))[_0x591754(0x1b8)](':p', randomElement(emoji[':p']))[_0x591754(0x1b8)](':D', randomElement(emoji[':D']))['replace']('<3', randomElement(emoji['<3']))['replace'](_0x591754(0x2d5), randomElement(emoji[_0x591754(0x2d5)]))[_0x591754(0x1b8)](_0x591754(0x116), randomElement(emoji[_0x591754(0x2d5)]));
}

function roundReplace(_0x51a672) {
    var _0x56531b = _0xf5fb9b;
    return _0x51a672['split']('')[_0x56531b(0x29e)](function(_0x578e3d) {
        var _0x4e8501 = _0x56531b;
        return _0x578e3d[_0x4e8501(0x1f7)]() === 'o' || _0x578e3d === '0' ? randomElement(round) : _0x578e3d;
    })[_0x56531b(0x5c)]('');
}
var emoji = {
        ':)': [_0xf5fb9b(0x417), '(•◡•)', _0xf5fb9b(0x159), _0xf5fb9b(0x143), '(｡◕‿◕｡)', _0xf5fb9b(0x261), _0xf5fb9b(0xdf), '😍', 'ツ', _0xf5fb9b(0x48c), _0xf5fb9b(0x1aa), _0xf5fb9b(0x10b), '(/◔◡◔)/', 's(^‿^)-b', _0xf5fb9b(0x2bb), _0xf5fb9b(0xb3), _0xf5fb9b(0x76)],
        '^^': [_0xf5fb9b(0xe), '(✿^▽^)', _0xf5fb9b(0x259), _0xf5fb9b(0x33b), _0xf5fb9b(0x46), _0xf5fb9b(0x240), _0xf5fb9b(0xfb), _0xf5fb9b(0x3d), _0xf5fb9b(0x274), _0xf5fb9b(0x2b4), ''],
        ':p': [':Þ', ''],
        ':D': [_0xf5fb9b(0x405), _0xf5fb9b(0x151), _0xf5fb9b(0x11b)],
        '<3': ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'],
        '(y)': ['👍', '👌']
    },
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0xf5fb9b(0x401), _0xf5fb9b(0xe3), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', _0xf5fb9b(0x214), _0xf5fb9b(0x3e8), _0xf5fb9b(0x11d), '•]••´º´•»\x20', _0xf5fb9b(0x5a), _0xf5fb9b(0x4f9), _0xf5fb9b(0x114), _0xf5fb9b(0x1df), _0xf5fb9b(0x25b), _0xf5fb9b(0x1eb), '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', _0xf5fb9b(0x35d), _0xf5fb9b(0x387), _0xf5fb9b(0xb2), _0xf5fb9b(0x28c), _0xf5fb9b(0x2ad), _0xf5fb9b(0x1f8), _0xf5fb9b(0x80), _0xf5fb9b(0x42), ',-*\x27^\x27~*-.,_,.-*~\x20', _0xf5fb9b(0x2d1), '—(••÷', _0xf5fb9b(0x16a), '••.•´¯`•.••\x20', _0xf5fb9b(0x1b), _0xf5fb9b(0x2c1), _0xf5fb9b(0x1d0), _0xf5fb9b(0x294), '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', _0xf5fb9b(0x44), _0xf5fb9b(0x3b7)];

function boundingString(_0x500e69) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x500e69);
}

function foodString(_0x160776) {
    var _0x4ade54 = _0xf5fb9b;
    return new Array(_0x160776 + 0x1)[_0x4ade54(0x5c)]('0')[_0x4ade54(0x1c0)]('')['map'](function(_0x2902af) {
        return randomElement(food);
    })[_0x4ade54(0x5c)]('\x20⋆\x20');
}

function twinkleString(_0x2bfc98) {
    var _0x1f7cf9 = _0xf5fb9b;
    return new Array(_0x2bfc98 + 0x1)['join']('0')['split']('')['map'](function() {
        return randomElement(twinkles);
    })[_0x1f7cf9(0x5c)]('');
}

function animalString(_0x33196a) {
    var _0x11615b = _0xf5fb9b;
    return new Array(_0x33196a + 0x1)['join']('0')['split']('')[_0x11615b(0x29e)](function(_0x2aac5a) {
        return randomElement(animals);
    })[_0x11615b(0x5c)]('\x20⋆\x20');
}

function flourishString(_0x43ba4a) {
    return randomElement(flourish);
}

function scriptify(_0x27ef5b) {
    var _0x454ee4 = _0xf5fb9b,
        _0x203d86 = {
            0x0: '𝟢',
            0x1: '𝟣',
            0x2: '𝟤',
            0x3: '𝟥',
            0x4: '𝟦',
            0x5: '𝟧',
            0x6: '𝟨',
            0x7: '𝟩',
            0x8: '𝟪',
            0x9: '𝟫',
            'a': '𝒶',
            'b': '𝒷',
            'c': '𝒸',
            'd': '𝒹',
            'e': '𝑒',
            'f': '𝒻',
            'g': '𝑔',
            'h': '𝒽',
            'i': '𝒾',
            'j': '𝒿',
            'k': '𝓀',
            'l': '𝓁',
            'm': '𝓂',
            'n': '𝓃',
            'o': '𝑜',
            'p': '𝓅',
            'q': '𝓆',
            'r': '𝓇',
            's': '𝓈',
            't': '𝓉',
            'u': '𝓊',
            'v': '𝓋',
            'w': '𝓌',
            'x': '𝓍',
            'y': '𝓎',
            'z': '𝓏',
            'A': '𝒜',
            'B': '𝐵',
            'C': '𝒞',
            'D': '𝒟',
            'E': '𝐸',
            'F': '𝐹',
            'G': '𝒢',
            'H': '𝐻',
            'I': '𝐼',
            'J': '𝒥',
            'K': '𝒦',
            'L': '𝐿',
            'M': '𝑀',
            'N': '𝒩',
            'O': '𝒪',
            'P': '𝒫',
            'Q': '𝒬',
            'R': '𝑅',
            'S': '𝒮',
            'T': '𝒯',
            'U': '𝒰',
            'V': '𝒱',
            'W': '𝒲',
            'X': '𝒳',
            'Y': '𝒴',
            'Z': '𝒵'
        },
        _0x5695a0 = _0x27ef5b[_0x454ee4(0x1c0)]('');
    for (var _0x52c587 = 0x0; _0x52c587 < _0x5695a0['length']; _0x52c587++) {
        _0x203d86[_0x5695a0[_0x52c587][_0x454ee4(0x1f7)]()] && (_0x5695a0[_0x52c587] = _0x203d86[_0x5695a0[_0x52c587]]);
    }
    return _0x27ef5b = _0x5695a0[_0x454ee4(0x5c)](''), _0x27ef5b;
}

function shuffleArray(_0x1895d3) {
    var _0x58571b = _0xf5fb9b,
        _0x5c7733 = _0x1895d3[_0x58571b(0x230)],
        _0x2eb22a, _0x7c8ea5;
    while (0x0 !== _0x5c7733) {
        _0x7c8ea5 = Math['floor'](Math[_0x58571b(0x267)]() * _0x5c7733), _0x5c7733 -= 0x1, _0x2eb22a = _0x1895d3[_0x5c7733], _0x1895d3[_0x5c7733] = _0x1895d3[_0x7c8ea5], _0x1895d3[_0x7c8ea5] = _0x2eb22a;
    }
    return _0x1895d3;
}

function randomElement(_0x382207) {
    var _0x19d3c6 = _0xf5fb9b;
    return _0x382207[Math[_0x19d3c6(0x27c)](Math['random']() * _0x382207[_0x19d3c6(0x230)])];
}! function(_0x21403b) {
    var _0x25994f = _0xf5fb9b,
        _0x6ba460 = 'object' == typeof exports && exports,
        _0x1e8b00 = _0x25994f(0x499) == typeof module && module && module[_0x25994f(0x2b7)] == _0x6ba460 && module,
        _0x58a9ab = _0x25994f(0x499) == typeof global && global;
    (_0x58a9ab[_0x25994f(0x47a)] === _0x58a9ab || _0x58a9ab[_0x25994f(0x3c7)] === _0x58a9ab) && (_0x21403b = _0x58a9ab);
    var _0x67b3b8 = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x24778b = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x5d72b9 = function(_0x4d3a33) {
            var _0x5a9346 = _0x25994f;
            _0x4d3a33 = _0x4d3a33[_0x5a9346(0x1b8)](_0x67b3b8, function(_0xe9c525, _0x2aaefc, _0x20069c) {
                return _0x5d72b9(_0x20069c) + _0x2aaefc;
            })[_0x5a9346(0x1b8)](_0x24778b, _0x5a9346(0x6c));
            for (var _0x81c2cc = '', _0x2d936b = _0x4d3a33['length']; _0x2d936b--;) _0x81c2cc += _0x4d3a33[_0x5a9346(0x4b9)](_0x2d936b);
            return _0x81c2cc;
        },
        _0x5f18af = {
            'version': _0x25994f(0x153),
            'reverse': _0x5d72b9
        };
    if (_0x25994f(0x28a) == typeof define && _0x25994f(0x499) == typeof define[_0x25994f(0x1c3)] && define[_0x25994f(0x1c3)]) define(function() {
        return _0x5f18af;
    });
    else {
        if (_0x6ba460 && !_0x6ba460[_0x25994f(0x3a1)]) {
            if (_0x1e8b00) _0x1e8b00[_0x25994f(0x2b7)] = _0x5f18af;
            else {
                for (var _0x18083f in _0x5f18af) _0x5f18af[_0x25994f(0xf9)](_0x18083f) && (_0x6ba460[_0x18083f] = _0x5f18af[_0x18083f]);
            }
        } else _0x21403b[_0x25994f(0x3f3)] = _0x5f18af;
    }
}(this);

function fullCrazy(_0x443dc3) {
    var _0x40280b = _0xf5fb9b;
    if (_0x443dc3[_0x40280b(0x4b3)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x443dc3) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x5f5790) {
    var _0x27022d = _0xf5fb9b;
    _0x5f5790 = _0x5f5790[_0x27022d(0x1c0)]('');
    for (var _0x137aa1 = 0x0; _0x137aa1 < _0x5f5790[_0x27022d(0x230)]; _0x137aa1++) {
        _0x5f5790[_0x137aa1] = crazifyCharacter(_0x5f5790[_0x137aa1]);
    }
    return _0x5f5790[_0x27022d(0x5c)]('');
}

function crazifyCharacter(_0xfdd1eb) {
    var _0x4584f6 = _0xf5fb9b;
    _0xfdd1eb = _0xfdd1eb['toLowerCase']();
    var _0x294b00 = {
        '&': '⅋',
        '%': ['⅍', '℀', '℁', '℆', '℅'],
        0x0: ['０', 'Ѳ', 'ʘ'],
        0x1: ['➀', '❶', '１'],
        0x2: ['２', '❷', '➁'],
        0x3: ['３', '❸', '➂'],
        0x4: ['４', '❹', '➃'],
        0x5: ['❺', '➄', '５'],
        0x6: ['６', '❻', '➅'],
        0x7: ['７', '❼', '➆'],
        0x8: ['８', '➇', '❽'],
        0x9: ['➈', '❾', '９'],
        '<': ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'],
        '>': _0x4584f6(0x63),
        '[': _0x4584f6(0x3ac),
        ']': _0x4584f6(0x378),
        '*': _0x4584f6(0x99),
        'a': ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'],
        'b': ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'],
        'c': ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'],
        'd': ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'],
        'e': ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'],
        'f': ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'],
        'g': ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'],
        'h': ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'],
        'i': ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'],
        'j': ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'],
        'k': ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'],
        'l': ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'],
        'm': ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'],
        'n': ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'],
        'o': ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'],
        'p': ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'],
        'q': ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'],
        'r': ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'],
        's': ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'],
        't': ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'],
        'u': ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'],
        'v': ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'],
        'w': ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'],
        'x': ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'],
        'y': ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'],
        'z': ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ']
    };
    return _0x294b00[_0xfdd1eb] ? randomElement(_0x294b00[_0xfdd1eb]) : _0xfdd1eb;
}

function randomElement(_0x4946b7) {
    var _0x5214ac = _0xf5fb9b;
    return _0x4946b7[Math[_0x5214ac(0x27c)](Math[_0x5214ac(0x267)]() * _0x4946b7['length'])];
}

function randomSymbols(_0xb03727) {
    var _0x47d0cf = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x4af42a = [];
    for (var _0x387aa4 = 0x0; _0x387aa4 < _0xb03727; _0x387aa4++) _0x4af42a['push'](randomElement(_0x47d0cf));
    return _0x4af42a['join']('');
}

function randInt(_0x5a98b2, _0x1f29bb) {
    var _0x53703b = _0xf5fb9b;
    return _0x5a98b2 + Math[_0x53703b(0x27c)](Math['random']() * (_0x1f29bb - _0x5a98b2 + 0x1));
}
$(document)[_0xf5fb9b(0x280)](function() {
    var _0x220d8f = _0xf5fb9b;
    $(_0x220d8f(0x4c8))[_0x220d8f(0x2a2)](_0x220d8f(0x124)), $(_0x220d8f(0xd4))['on'](_0x220d8f(0x505), function() {
        var _0x17f7f9 = _0x220d8f;
        $(_0x17f7f9(0x2ce) + $(this)[_0x17f7f9(0x2d3)]() + _0x17f7f9(0x422))[_0x17f7f9(0x2a2)](_0x17f7f9(0x124));
    }), _0x11413c(default_text), $(_0x220d8f(0x35c))['on'](_0x220d8f(0x181), function(_0x5e01a3) {
        var _0x33a860 = _0x220d8f;
        if ($(_0x33a860(0x3ff))[_0x33a860(0x2d3)]() < 0x1) _0x11413c(default_text);
        else {
            var _0x2b2c0e = $(_0x33a860(0x3ff))[_0x33a860(0x2d3)]();
            _0x11413c(_0x2b2c0e);
        }
    });
    var _0x443269 = window[_0x220d8f(0xb6)][_0x220d8f(0x49f)],
        _0x55401d = _0x443269[_0x220d8f(0x1c0)](_0x220d8f(0x38c));
    urltext = _0x55401d[0x1];
    urltext && (urltext = decodeURIComponent(urltext), $(_0x220d8f(0x2a3))['val'](urltext), _0x11413c(urltext));

    function _0x11413c(_0x55356b) {
        var _0x2be52b = _0x220d8f;
        _0x55356b = _0x55356b[_0x2be52b(0x4b3)](), $('.result-s1')[_0x2be52b(0x19)](Change(_0x55356b, 's1')), $(_0x2be52b(0x4df))[_0x2be52b(0x19)](Change(_0x55356b, 's2')), $(_0x2be52b(0x297))[_0x2be52b(0x19)](Change(_0x55356b, 's3')), $(_0x2be52b(0x5e))[_0x2be52b(0x19)](Change(_0x55356b, 's4')), $('.result-s5')[_0x2be52b(0x19)](Change(_0x55356b, 's5')), $(_0x2be52b(0x2f6))[_0x2be52b(0x19)](Change(_0x55356b, 's6')), $(_0x2be52b(0x2f0))[_0x2be52b(0x19)](Change(_0x55356b, 's7')), $(_0x2be52b(0x7))['html'](Change(_0x55356b, 's8')), $(_0x2be52b(0x2e8))[_0x2be52b(0x19)](Change(_0x55356b, 's9')), $(_0x2be52b(0x49b))['html'](Change(_0x55356b, _0x2be52b(0x1b5))), $('.result-s11')[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x1bc))), $(_0x2be52b(0x3f9))[_0x2be52b(0x19)](Change(_0x55356b, 's12')), $(_0x2be52b(0x22))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x2e9))), $(_0x2be52b(0xd5))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x283))), $(_0x2be52b(0x4fe))[_0x2be52b(0x19)](Change(_0x55356b, 's15')), $(_0x2be52b(0x52))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x10))), $(_0x2be52b(0x55))['html'](Change(_0x55356b, _0x2be52b(0x51))), $(_0x2be52b(0x443))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x13c))), $('.result-s19')[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x241))), $('.result-s20')['html'](Change(_0x55356b, _0x2be52b(0x3f6))), $(_0x2be52b(0x1c7))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x1e4))), $(_0x2be52b(0x129))['html'](Change(_0x55356b, _0x2be52b(0x319))), $(_0x2be52b(0x13d))[_0x2be52b(0x19)](Change(_0x55356b, 's23')), $(_0x2be52b(0xd2))[_0x2be52b(0x19)](Change(_0x55356b, 's24')), $(_0x2be52b(0x439))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x121))), $(_0x2be52b(0x3b5))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x434))), $(_0x2be52b(0x26b))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x311))), $(_0x2be52b(0x325))['html'](Change(_0x55356b, _0x2be52b(0x21d))), $(_0x2be52b(0x32b))['html'](Change(_0x55356b, _0x2be52b(0x2a7))), $(_0x2be52b(0x3a0))[_0x2be52b(0x19)](Change(_0x55356b, _0x2be52b(0x234))), $(_0x2be52b(0x4d1))[_0x2be52b(0x19)](luni[_0x2be52b(0x458)][_0x2be52b(0x38a)][_0x2be52b(0x293)](_0x55356b)), $(_0x2be52b(0x26e))[_0x2be52b(0x19)](applyCharMap(invertedSquaresCharMap, _0x55356b)), $(_0x2be52b(0x496))[_0x2be52b(0x19)](illuminati(_0x55356b)), $(_0x2be52b(0x110))['html'](textgun(_0x55356b)), $(_0x2be52b(0x200))[_0x2be52b(0x19)](minigame(_0x55356b)), $('.pubggame1')[_0x2be52b(0x19)](pubggame1(_0x55356b)), $(_0x2be52b(0x266))[_0x2be52b(0x19)](pubggame2(_0x55356b)), $('.pubggame3')[_0x2be52b(0x19)](pubggame3(_0x55356b)), $(_0x2be52b(0x472))[_0x2be52b(0x19)](bricks(_0x55356b)), $('.bigrus')[_0x2be52b(0x19)](bigrus(_0x55356b)), $('.wideTextCharMap')[_0x2be52b(0x19)](applyCharMap(wideTextCharMap, _0x55356b)), $(_0x2be52b(0x4c5))[_0x2be52b(0x19)](luni[_0x2be52b(0x458)][_0x2be52b(0x3d0)][_0x2be52b(0x293)](_0x55356b)), $('.lunitoolsflipencode')[_0x2be52b(0x19)](luni[_0x2be52b(0x458)][_0x2be52b(0x4c3)]['encode'](_0x55356b)), $(_0x2be52b(0x33a))[_0x2be52b(0x19)](applyCharMap(squaresCharMap, _0x55356b)), $('.lunitoolsmirrorencode')[_0x2be52b(0x19)](luni[_0x2be52b(0x458)][_0x2be52b(0x254)][_0x2be52b(0x293)](_0x55356b)), $('.subscriptCharMap')[_0x2be52b(0x19)](applyCharMap(subscriptCharMap, _0x55356b)), $(_0x2be52b(0x3f))[_0x2be52b(0x19)](applyCharMap(superscriptCharMap, _0x55356b)), $(_0x2be52b(0x381))[_0x2be52b(0x19)](applyCharMap(bentTextCharMap, _0x55356b)), $(_0x2be52b(0xa2))['html'](applyCharMap(neonCharMap, _0x55356b)), $(_0x2be52b(0x3a))[_0x2be52b(0x19)](applyCharMap(futureAlienCharMap, _0x55356b)), $('.strikeThrough')[_0x2be52b(0x19)](strikeThrough(_0x55356b)), $(_0x2be52b(0x13))[_0x2be52b(0x19)](tildeStrikeThrough(_0x55356b)), $(_0x2be52b(0x5d))['html'](slashThrough(_0x55356b)), $(_0x2be52b(0x257))[_0x2be52b(0x19)](underline(_0x55356b)), $(_0x2be52b(0x2cf))[_0x2be52b(0x19)](doubleUnderline(_0x55356b)), $('.lunicreepify')[_0x2be52b(0x19)](luni[_0x2be52b(0x458)][_0x2be52b(0x28b)][_0x2be52b(0x293)](_0x55356b)), $(_0x2be52b(0x176))[_0x2be52b(0x19)](applyCharMap(squiggleCharMap, _0x55356b)), $('.squiggle2CharMap')[_0x2be52b(0x19)](applyCharMap(squiggle2CharMap, _0x55356b)), $('.squiggle3CharMap')[_0x2be52b(0x19)](applyCharMap(squiggle3CharMap, _0x55356b)), $('.squiggle4CharMap')[_0x2be52b(0x19)](applyCharMap(squiggle4CharMap, _0x55356b)), $(_0x2be52b(0x2f2))[_0x2be52b(0x19)](applyCharMap(squiggle5CharMap, _0x55356b)), $(_0x2be52b(0x2b))[_0x2be52b(0x19)](applyCharMap(squiggle6CharMap, _0x55356b)), $(_0x2be52b(0x2dc))[_0x2be52b(0x19)](applyCharMap(boldCharMap, _0x55356b)), $(_0x2be52b(0x475))['html'](luni['tools'][_0x2be52b(0x34)][_0x2be52b(0x293)](_0x55356b)), $(_0x2be52b(0x196))[_0x2be52b(0x19)](luni[_0x2be52b(0x458)]['squares']['encode'](_0x55356b[_0x2be52b(0x2f7)]())), $(_0x2be52b(0xb7))[_0x2be52b(0x19)](applyCharMap(oldEnglishCharMap, _0x55356b)), $('.medievalCharMap')[_0x2be52b(0x19)](applyCharMap(medievalCharMap, _0x55356b)), $('.cursiveCharMap')[_0x2be52b(0x19)](applyCharMap(cursiveCharMap, _0x55356b)), $(_0x2be52b(0x508))[_0x2be52b(0x19)](scriptify(_0x55356b)), $(_0x2be52b(0x4e))[_0x2be52b(0x19)](applyCharMap(doubleStruckCharMap, _0x55356b)), $(_0x2be52b(0xae))[_0x2be52b(0x19)](applyCharMap(italicCharMap, _0x55356b)), $(_0x2be52b(0x246))[_0x2be52b(0x19)](applyCharMap(boldItalicCharMap, _0x55356b)), $(_0x2be52b(0x418))['html'](applyCharMap(monospaceCharMap, _0x55356b)), $('.upperAnglesCharMap')[_0x2be52b(0x19)](applyCharMap(upperAnglesCharMap, _0x55356b)), $(_0x2be52b(0x1d3))[_0x2be52b(0x19)](applyCharMap(greekCharMap, _0x55356b)), $(_0x2be52b(0x1ab))['html'](applyCharMap(symbolsCharMap, _0x55356b)), $(_0x2be52b(0x2be))[_0x2be52b(0x19)](applyCharMap(currencyCharMap, _0x55356b)), $('.asianStyleCharMap')[_0x2be52b(0x19)](applyCharMap(asianStyleCharMap, _0x55356b)), $(_0x2be52b(0x2c8))[_0x2be52b(0x19)](applyCharMap(asianStyle2CharMap, _0x55356b)), $(_0x2be52b(0x30a))[_0x2be52b(0x19)](thickBlockFramed(_0x55356b)), $('.diametricAngleFrame')['html'](diametricAngleFrame(_0x55356b)), $(_0x2be52b(0x46e))[_0x2be52b(0x19)](wavyJoiner(_0x55356b)), $(_0x2be52b(0x161))[_0x2be52b(0x19)](dottyJoiner(_0x55356b)), $(_0x2be52b(0x479))[_0x2be52b(0x19)](kirbyHug(_0x55356b)), $('.vaporwaveText')[_0x2be52b(0x19)](vaporwaveText(_0x55356b)), $(_0x2be52b(0x467))[_0x2be52b(0x19)](vaporwaveText1(_0x55356b)), $('.vaporwaveText2')[_0x2be52b(0x19)](vaporwaveText2(_0x55356b)), $(_0x2be52b(0x2c4))[_0x2be52b(0x19)](littleSparkles(_0x55356b)), $(_0x2be52b(0x113))[_0x2be52b(0x19)](weirdBox(_0x55356b)), $(_0x2be52b(0x18))['html'](thickBox(_0x55356b)), $(_0x2be52b(0x24))[_0x2be52b(0x19)](zigzagJoiner(_0x55356b)), $('.hashJoiner')[_0x2be52b(0x19)](hashJoiner(_0x55356b)), $(_0x2be52b(0x454))[_0x2be52b(0x19)](starJoiner(_0x55356b)), $(_0x2be52b(0x160))['html'](connectedJoiner(_0x55356b)), $(_0x2be52b(0x1c))[_0x2be52b(0x19)](arrowjoin(_0x55356b)), $(_0x2be52b(0xfc))['html'](dotBoxtwo(_0x55356b)), $(_0x2be52b(0x2e))['html'](dotBox(_0x55356b)), $(_0x2be52b(0xb8))[_0x2be52b(0x19)](diametricBox(_0x55356b)), $(_0x2be52b(0xda))[_0x2be52b(0x19)](arrowBox(_0x55356b)), $(_0x2be52b(0xc5))[_0x2be52b(0x19)](curlybrackets(_0x55356b)), $(_0x2be52b(0x1c5))['html'](singlewavyJoiner(_0x55356b)), $('.firework')['html'](firework(_0x55356b)), $('.stinky')[_0x2be52b(0x19)](stinky(_0x55356b)), $(_0x2be52b(0x457))['html'](heartsBetween(_0x55356b)), $('.arrowBelow')[_0x2be52b(0x19)](arrowBelow(_0x55356b)), $(_0x2be52b(0x66))[_0x2be52b(0x19)](crossAboveBelow(_0x55356b)), $(_0x2be52b(0x4bb))[_0x2be52b(0x19)](wingdings(_0x55356b)), $(_0x2be52b(0x2db))[_0x2be52b(0x19)](fullCrazy(_0x55356b)), $(_0x2be52b(0xd6))[_0x2be52b(0x19)](crazyWithFlourishOrSymbols(_0x55356b)), $('.cuteText')['html'](cuteText(_0x55356b)), $(_0x2be52b(0x1d1))[_0x2be52b(0x19)](star0(_0x55356b)), $('.star1')['html'](star1(_0x55356b)), $('.star2')['html'](star2(_0x55356b)), $(_0x2be52b(0x75))[_0x2be52b(0x19)](star3(_0x55356b)), $(_0x2be52b(0x371))[_0x2be52b(0x19)](star4(_0x55356b)), $('.star5')[_0x2be52b(0x19)](star5(_0x55356b)), $('.star6')[_0x2be52b(0x19)](star6(_0x55356b)), $(_0x2be52b(0x27b))[_0x2be52b(0x19)](star7(_0x55356b)), $('.star8')[_0x2be52b(0x19)](star8(_0x55356b)), $(_0x2be52b(0x138))[_0x2be52b(0x19)](star9(_0x55356b)), $(_0x2be52b(0x179))[_0x2be52b(0x19)](star10(_0x55356b)), $('.heart0')[_0x2be52b(0x19)](heart0(_0x55356b)), $(_0x2be52b(0x363))['html'](heart1(_0x55356b)), $(_0x2be52b(0x253))[_0x2be52b(0x19)](heart2(_0x55356b)), $(_0x2be52b(0x17))[_0x2be52b(0x19)](heart3(_0x55356b)), $(_0x2be52b(0x469))[_0x2be52b(0x19)](heart4(_0x55356b)), $('.heart5')[_0x2be52b(0x19)](heart5(_0x55356b)), $(_0x2be52b(0x304))[_0x2be52b(0x19)](heart6(_0x55356b)), $(_0x2be52b(0x39d))[_0x2be52b(0x19)](heart7(_0x55356b)), $(_0x2be52b(0x23c))[_0x2be52b(0x19)](emoticon0(_0x55356b)), $(_0x2be52b(0x384))['html'](emoticon1(_0x55356b)), $('.emoticon2')[_0x2be52b(0x19)](emoticon2(_0x55356b)), $(_0x2be52b(0x2f9))[_0x2be52b(0x19)](emoticon3(_0x55356b)), $(_0x2be52b(0x2d9))[_0x2be52b(0x19)](emoticon4(_0x55356b)), $(_0x2be52b(0x377))['html'](emoticon5(_0x55356b)), $(_0x2be52b(0x14a))[_0x2be52b(0x19)](emoticon6(_0x55356b)), $(_0x2be52b(0x3bd))[_0x2be52b(0x19)](emoticon7(_0x55356b)), $(_0x2be52b(0x421))[_0x2be52b(0x19)](thankyou0(_0x55356b)), $(_0x2be52b(0x62))['html'](thankyou1(_0x55356b)), $(_0x2be52b(0x149))[_0x2be52b(0x19)](thankyou2(_0x55356b)), $('.thankyou3')['html'](thankyou3(_0x55356b)), $(_0x2be52b(0x3a2))['html'](thankyou4(_0x55356b)), $(_0x2be52b(0x2d6))['html'](thankyou5(_0x55356b)), $(_0x2be52b(0x235))[_0x2be52b(0x19)](thankyou6(_0x55356b)), $(_0x2be52b(0x4be))[_0x2be52b(0x19)](thankyou7(_0x55356b)), $('.sad0')[_0x2be52b(0x19)](sad0(_0x55356b)), $('.sad1')['html'](sad1(_0x55356b)), $(_0x2be52b(0x32d))[_0x2be52b(0x19)](sad2(_0x55356b)), $(_0x2be52b(0x2d2))[_0x2be52b(0x19)](sad3(_0x55356b)), $('.sad4')[_0x2be52b(0x19)](sad4(_0x55356b)), $('.sad5')['html'](sad5(_0x55356b)), $(_0x2be52b(0x1ce))['html'](sad6(_0x55356b)), $(_0x2be52b(0x45e))[_0x2be52b(0x19)](sad7(_0x55356b)), $(_0x2be52b(0x3fc))['html'](cuteText1(_0x55356b)), $(_0x2be52b(0x1dc))[_0x2be52b(0x19)](cuteText2(_0x55356b)), $(_0x2be52b(0x38e))[_0x2be52b(0x19)](cuteText3(_0x55356b)), $(_0x2be52b(0x440))['html'](cuteText4(_0x55356b)), $(_0x2be52b(0x356))[_0x2be52b(0x19)](cuteText5(_0x55356b)), $(_0x2be52b(0x296))['html'](crazyWithFlourishOrSymbols1(_0x55356b)), $('.crazyWithFlourishOrSymbols2')[_0x2be52b(0x19)](crazyWithFlourishOrSymbols2(_0x55356b)), $(_0x2be52b(0x18c))['html'](crazyWithFlourishOrSymbols3(_0x55356b)), $(_0x2be52b(0x486))[_0x2be52b(0x19)](crazyWithFlourishOrSymbols4(_0x55356b)), $(_0x2be52b(0x2c3))[_0x2be52b(0x19)](crazyWithFlourishOrSymbols5(_0x55356b)), $(_0x2be52b(0x2ba))[_0x2be52b(0x19)](fullCrazy1(_0x55356b)), $(_0x2be52b(0xf5))[_0x2be52b(0x19)](fullCrazy2(_0x55356b)), $(_0x2be52b(0x89))[_0x2be52b(0x19)](fullCrazy3(_0x55356b)), $('.fullCrazy4')[_0x2be52b(0x19)](fullCrazy4(_0x55356b)), $(_0x2be52b(0x3a7))['html'](fullCrazy5(_0x55356b)), $('.wrap1')[_0x2be52b(0x19)](wrap1(_0x55356b)), $(_0x2be52b(0x345))[_0x2be52b(0x19)](wrap2(_0x55356b)), $(_0x2be52b(0xd1))[_0x2be52b(0x19)](wrap3(_0x55356b)), $(_0x2be52b(0x1d))[_0x2be52b(0x19)](wrap4(_0x55356b)), $('.wrap5')['html'](wrap5(_0x55356b));
    }
    $('.clear')[_0x220d8f(0x335)](function() {
        $('#Sk-text')['val']('');
    });

    function _0x451e93() {
        var _0x2ba60d = _0x220d8f,
            _0x65fdf8 = document[_0x2ba60d(0x12f)](_0x2ba60d(0x47e)),
            _0x5c4933 = _0x65fdf8[_0x2ba60d(0x12f)](_0x2ba60d(0x3b0));
        document['querySelectorAll'](_0x2ba60d(0x204))[_0x2ba60d(0x4e7)](_0x4aa086 => {
            var _0x5afa84 = _0x2ba60d;
            _0x4aa086[_0x5afa84(0xb1)]('click', () => {
                var _0x5f1263 = _0x5afa84;
                _0x5c4933[_0x5f1263(0x3d5)] = _0x4aa086[_0x5f1263(0x12f)]('p')[_0x5f1263(0x446)], _0x4b8c32(_0x5c4933), _0x65fdf8[_0x5f1263(0x45f)][_0x5f1263(0x8a)](_0x5f1263(0x4e1)), setTimeout(() => {
                    var _0x2cdcb7 = _0x5f1263;
                    _0x65fdf8[_0x2cdcb7(0x45f)][_0x2cdcb7(0x14)](_0x2cdcb7(0x4e1));
                }, 0x3e8);
            });
        });
    }
    _0x451e93();

    function _0x4b8c32(_0x594d14) {
        var _0x352753 = _0x220d8f,
            _0x1c3552 = document['createElement'](_0x352753(0xce));
        _0x1c3552[_0x352753(0x3d5)] = _0x594d14[_0x352753(0x446)] || _0x594d14[_0x352753(0x3d5)], document[_0x352753(0x124)][_0x352753(0x24d)](_0x1c3552), _0x1c3552[_0x352753(0x447)](), document[_0x352753(0x288)](_0x352753(0x368)), _0x1c3552[_0x352753(0x14)]();
    }
});
