var _0x3e3222 = _0x3576,
    _0x14d85 = (function() {
        var _0x1cc0d6 = !![];
        return function(_0x309db1, _0x54c724) {
            var _0x325832 = _0x1cc0d6 ? function() {
                var _0x40d38a = _0x3576;
                if (_0x54c724) {
                    var _0xec4b4b = _0x54c724[_0x40d38a(0x1b2)](_0x309db1, arguments);
                    return _0x54c724 = null, _0xec4b4b;
                }
            } : function() {};
            return _0x1cc0d6 = ![], _0x325832;
        };
    }()),
    _0x59bd37 = _0x14d85(this, function() {
        var _0x2ac285 = _0x3576,
            _0x58877f = function() {
                var _0x12392c = _0x3576,
                    _0x3d8bfc;
                try {
                    _0x3d8bfc = Function(_0x12392c(0x3a0) + '{}.constructor(\x22return\x20this\x22)(\x20)' + ');')();
                } catch (_0x3f67a5) {
                    _0x3d8bfc = window;
                }
                return _0x3d8bfc;
            },
            _0x57b03b = _0x58877f(),
            _0xdeedb0 = _0x57b03b[_0x2ac285(0x2cf)] = _0x57b03b[_0x2ac285(0x2cf)] || {},
            _0x468861 = ['log', _0x2ac285(0x3ba), _0x2ac285(0xb1), _0x2ac285(0x467), _0x2ac285(0x1bb), _0x2ac285(0x150), _0x2ac285(0x1d2)];
        for (var _0x391099 = 0x0; _0x391099 < _0x468861['length']; _0x391099++) {
            var _0x42b252 = _0x14d85[_0x2ac285(0x3cd)][_0x2ac285(0x45b)][_0x2ac285(0x2e)](_0x14d85),
                _0x8d4c14 = _0x468861[_0x391099],
                _0x5d7a36 = _0xdeedb0[_0x8d4c14] || _0x42b252;
            _0x42b252[_0x2ac285(0x51b)] = _0x14d85['bind'](_0x14d85), _0x42b252[_0x2ac285(0x4d2)] = _0x5d7a36['toString'][_0x2ac285(0x2e)](_0x5d7a36), _0xdeedb0[_0x8d4c14] = _0x42b252;
        }
    });
_0x59bd37();
var normal = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890',
    default_text = _0x3e3222(0x20d);

function applyCharMap(_0x12bc3c, _0x1a3ce7) {
    var _0x32f959 = _0x3e3222;
    let _0x3390ed = '';
    for (let _0x3f50d4 of _0x1a3ce7[_0x32f959(0x40c)]('')) {
        if (_0x12bc3c[_0x3f50d4] !== undefined) _0x3390ed += _0x12bc3c[_0x3f50d4];
        else {
            if (_0x12bc3c[_0x3f50d4[_0x32f959(0x287)]()] !== undefined) _0x3390ed += _0x12bc3c[_0x3f50d4[_0x32f959(0x287)]()];
            else _0x3390ed += _0x3f50d4;
        }
    }
    return _0x3390ed;
}

function invertedSquaresCharMapFun(_0xfd8a82) {
    return applyCharMap(invertedSquaresCharMap, _0xfd8a82);
}

function wideTextCharMapFun(_0x4e3be5) {
    return applyCharMap(wideTextCharMap, _0x4e3be5);
}

function squaresCharMapFun(_0x22e26b) {
    return applyCharMap(squaresCharMap, _0x22e26b);
}

function subscriptCharMapFun(_0x500235) {
    return applyCharMap(subscriptCharMap, _0x500235);
}

function bentTextCharMapFun(_0x2074d2) {
    return applyCharMap(bentTextCharMap, _0x2074d2);
}

function neonCharMapFun(_0x3c2346) {
    return applyCharMap(neonCharMap, _0x3c2346);
}

function futureAlienCharMapFun(_0x274499) {
    return applyCharMap(futureAlienCharMap, _0x274499);
}

function _0x2567() {
    var _0x263e4a = ['&#323;', '4&#846;', 'insertBefore', 's26', 'C&#838;', '.thickBox', '&ETH;', '&#545;', '.wideTextCharMap', '&#10122;', '&#372;', '0&#838;', 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科', '&#42128;', '★·.·´¯`·.·★\x20', '&#7918;', 'W&#826;', '&#1348;', '&#268;', '&#41007;', '★彡\x20[[text]]\x20彡★', '.kirbyHug', '&#120830;&#823;', '&#292;', '&#592;', '&#1352;', '&#7828;', 'h&#857;', '.arrowjoin', '&#41005;', '&#41042;', '&#42181;', 'm&#838;', '&#1031;', 'K&#829;&#851;', 'x&#830;', '♥࿐٭', '&#9791;', '&Xi;', '&#41079;', '°°°·.°·..·°¯°·._.·\x20', 'randomization', 'middle', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 'O&#826;', '.monospaceCharMap', 'bind', '╰☆☆\x20[[text]]\x20☆☆╮', 'z&#838;', 'L&#830;', 'v&#826;', '⚔️\x20[[text]]\x20⚔️', 'w&#826;', 'a&#838;', '3&#857;', '4&#857;', '&#5198;', 's27', 'test', 'T&#846;', '🏱︎', '.result-s21', '&rho;', '(っ◔◡◔)っ\x20♥\x20', 'length', '.illuminati', '&#409;', '&#2749;', '&#120445;&#823;', '&#1359;', ']彡★', 'd&#857;', '&#1052;', '&thorn;', '.sad0', 'B&#866;', '🕆︎', '༻༒۝', '🕚︎', '.bentTextCharMap', '8&#838;', '🗄︎', 'Y&#866;', '\x20(\x20◔\x20ʖ̯\x20◔\x20)', 'p&#799;', '&#41571;', '&#618;', 'J&#857;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '⟦$1⟧', 'ıllıllı\x20', '.emoticon7', '.thankyou4', 'h&#826;', '(人◕‿◕)', 'D&#857;', 'Y&#829;&#851;', 'i&#830;', '&#435;', '&forall;', 'E&#828;', 'd&#829;&#851;', '&#1333;', 'j&#828;', 'l&#828;', 'undefined', 'D&#830;', '&#423;', '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', '&#5610;', '.wingdings', 'K&#846;', '&#576;', '&#1008;', 'k&#826;', '&#1349;', 'r&#799;', '.superscriptCharMap', '5&#828;', 'N&#838;', 'w&#799;', 'x&#866;', '&psi;', 'floor', 'Y&#826;', '.cuteText3', 'q&#846;', 'u&#857;', '&#1074;', 'E&#799;', '&#41769;', 'p&#828;', '&#1139;', 'D&#838;', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '&#272;', 'L&#846;', '&#5597;', '&#10124;', 'z&#826;', '&#41203;', '&#120441;&#823;', '🎯🍧', '░▒▓█\x20[[text]]\x20█▓▒░', '★★•╯', 'y&#838;', 'Q&#838;', '.thankyou5', 'roundsquares', '&#41266;', '&#1180;', 'R&#866;', '彡(✿╹◡╹)\x20', '.result-s18', 'T&#857;', '.pubggame3', 'B&#826;', '.emoticon1', 'location', '.result-s5', 'L&#828;', 'I&#828;', 'd&#830;', '&#41141;', 'e&#866;', '2&#799;', '&#10127;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '&#41080;', 'e&#829;&#851;', 'i&#857;', '2&#846;', '&#2670;', 'p&#838;', '&Mu;', '&#340;', 'J&#830;', 'info', '•?((¯°·._.•\x20', '&#1047;', '&#120477;&#823;', '&#120465;&#823;', '(¯`·.¸¸.->\x20°º\x20', '.weirdBox', '.emoticon5', '𒆜𓊉꧂', '&#120444;&#823;', '&#381;', '&#12581;', '&#40983;', '.lunitoolsmirrorencode', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', 'B&#838;', 'F&#799;', '.result-s2', '◔◡◔', '&#1185;', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', 'H&#829;&#851;', 'hasOwnProperty', 'tiny', '.result-s1', '&#120446;&#823;', 'G&#829;&#851;', '&#394;', '**•.¸♥¸.•*´💖', 'e&#830;', '.wavyJoiner', 'S&#830;', '\x20(๑′°︿°๑)', '&dagger;', 't&#846;', 'o&#826;', '◦•●❤♡\x20', 'i&#846;', 'X&#857;', '&#x', 'w&#829;&#851;', 'l&#866;', '.greekCharMap', '2&#830;', 'l&#838;', '&#344;', '(ಥ\x20͜ʖಥ)\x20', 'o&#829;&#851;', '&#336;', '.underline', 'a&#826;', '\x20\x20🎀\x20\x20', '&upsilon;', '&#41346;', 'Z&#830;', '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»', '&#4325;', 'T&#799;', '&#646;', 'y&#857;', '&#41823;', 'p&#857;', '8&#829;&#851;', 'c&#857;', '&#1046;', '👎︎', '&#1071;', '&#10128;', '.heart2', 'init', 'u&#826;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '&#42148;', '&#1095;', 'N&#828;', 'T&#838;', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', 'I&#829;&#851;', '&#41296;', 'V&#826;', '٩(˘◡˘)۶', '◥꧁ད\x20[[text]]\x20ཌ꧂◤', '&#595;', 'px}\x20</style>', '.result-s15', '5&#846;', 'r&#857;', '&#2790;', '(✿ヘᴥヘ)', '&#1064;', '&#429;', '&#645;', 'c&#828;', '&#1356;', '<%=\x20version\x20%>', '&#286;', '.star7', '🕗︎', 'n&#846;', '&#120471;&#823;', '෴❤️෴\x20\x20', '7&#846;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20\x20', '&#291;', 'A&#826;', 'c&#829;&#851;', 'Q&#826;', 'I&#866;', '.lunitoolsbubbles', 'w&#828;', 'charCodeAt', 'H&#826;', 'reverse', '&#120442;&#823;', 'X&#826;', '&#9736;', 'ᕕ(ᐛ)ᕗ', '&#4335;', '^ㅂ^', '.emoticon4', 'C&#829;&#851;', '&#41246;', '.crazyWithFlourishOrSymbols4', 'F&#830;', '&#327;', '&#541;', 'l&#829;&#851;', '&#350;', '&#1506;', '¤¸¸.•´¯`•¸¸.•..>>\x20', 'I&#838;', '&#4317;', '.thankyou2', 'm&#828;', 'L&#829;&#851;', 'U&#828;', '\x20.o0×X×0o.\x20', 'E&#826;', 'O&#846;', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', 'pop', 'h&#829;&#851;', '••¤(`×[¤\x20', 'h&#846;', 'classList', '•´¯`•»\x20', '&oplus;', '👍︎', '&#377;', '.italicCharMap', '&#2794;', '&#41648;', 'maxHeight', 'c&#838;', 'addEventListener', '╚»★«╝\x20', '.neonCharMap', 'U&#826;', 'q&#829;&#851;', 'table', '&#5616;', '5&#857;', '🖲︎', '&omega;', '&#1048;', '.singlewavyJoiner', '4&#866;', '.cuteText1', '<(_\x20_*)>', 'D&#826;', 'bubbles', '5&#838;', 'M&#857;', '(′︿‵｡)', '&#120470;&#823;', '&#120472;&#823;', '5&#830;', 'g&#857;', '&#41045;', '1&#799;', '.thankyou6', 'V&#866;', 'K&#857;', 'l&#826;', '8&#866;', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', '4&#799;', '1&#846;', 'html', 's20', '.cuteText', 's31', 'p&#826;', 'f&#829;&#851;', '•]••´º´•»\x20', 'S&#829;&#851;', '&#4330;', '&#120464;&#823;', 'c&#799;', 's14', 'W&#838;', 'mapInverse', 'O&#829;&#851;', 's10', '7&#838;', 'y&#866;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', 'b&#829;&#851;', '⦚$1⦚', 'J&#838;', 'b&#826;', '&#8984;', '4&#830;', '&#1131;', '&#1193;', '🕮︎', 'W&#828;', '3&#846;', '꜍$1꜉', 'n&#829;&#851;', '&#1210;', 'X&#838;', 'S&#846;', 'top', '.result-s27', '&#1062;', '✰.｡.✵°✵,¸.•✵´', '&sigmaf;', '0&#829;&#851;', '5&#826;', '&#41707;', '&#653;', 'querySelector', '1&#828;', '&#638;', '&#5845;', 'I&#799;', 's21', '&Gamma;', '&#120437;&#823;', '.cuteText2', '&#120432;&#823;', '💜💘', 'v&#857;', '★⡀.•☆•.★', '&#1138;', '7&#866;', '\x20ıllıllı⭐🌟', '.thankyou1', '.heart1', '&#120469;&#823;', 'X&#828;', '.heartsBetween', 'Y&#799;', 'j&#830;', '&#974;', 'apply', '&#1028;', '◠◡◠', '&#41733;', 'H&#838;', '&#652;', '&#2799;', 'O&#857;', '.result-s13', 'exception', '.result-s23', 'options', 'n&#828;', 'P&#866;', '★⌒(●ゝω・)', '&#382;', 'ミミ◦❧◦°˚°◦.¸¸◦°´❤*•.¸♥\x20\x20', '&#41575;', '⁀‿⁀', '&#120479;&#823;', '8&#828;', 'I&#830;', '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', 'r&#846;', 'ᵔᴥᵔ', '&#5262;', '&#1063;', '.fullCrazy5', 'v&#828;', '(≧◡≦)', '&#943;', '🕖︎', 'trace', 'z&#866;', 'v&#830;', 'x&#846;', 'c&#826;', '9&#838;', '.crazyWithFlourishOrSymbols', '&#9761;', '&#8627;', '&#10081;', 'l&#846;', 'v&#846;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', 's&#799;', '1&#866;', 'r&#829;&#851;', '^ㅅ^', '&fnof;', 'V&#828;', '&#1179;', 's&#826;', 'getHTML', 'O&#828;', 'c&#846;', '.DiscordFonts', 'c&#866;', '🕙︎', '&#41991;', '—(••÷', 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', '】〗〙〛］', '❀◕‿◕❀', 's&#866;', '.oldEnglishCharMap', '&#1340;', '&#5623;', '.star10', '&#310;', '&#358;', '.lunitoolstinyencode', '⫷\x20\x20', 'e&#799;', '═─◄█▓▒░', '&#401;', 't&#828;', '.futureAlienCharMap', ']|I{•------»\x20', '.dottyJoiner', 'encode', 'D&#799;', '&#4308;', '(•◡•)', 'r&#866;', 'copied-show', '【｡_｡】\x20[[text]]\x20【｡_｡】', 'join', '.tildeStrikeThrough', 'V&#838;', '&beta;', 'Nick\x20Name\x20FF', 'M&#799;', '&#356;', '&#422;', '&chi;', '&#607;', '&#972;', '&#1097;', '&#654;', '&#41976;', '§.•´¨\x27°÷•..×\x20', '(*ゝω・)', '.fullCrazy3', 'val', '◕‿◕', '(⌒‿⌒)', 'ஜ۩۞۩ஜ\x20', 'b&#866;', 'round', '.emoticon2', '6&#799;', ']\x20𒆜𓊉꧂', 'C&#846;', 'max', '&#262;', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', '&#41706;', '\x20(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '.wrap2', '.heart5', '꧁༒☬\x20[[text]]\x20☬༒꧂', '💘🎀', 'input\x20change', '•´¯`•»\x20[[text]]\x20«•´¯`•', '&eta;', '&#387;', '&#120436;&#823;', 'g&#830;', '&#1141;', '🌟⭐ıllıllı', 't&#838;', 'replace', '.bricks', 'q&#838;', 'E&#866;', '(◕︿◕✿)\x20', '&#120467;&#823;', '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', '&#41922;', '.doubleUnderline', 'M&#838;', 'f&#826;', 'k&#830;', '&#270;', 'ღ⊱♥', '.asianStyleCharMap', '\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '&#1338;', '&#120451;&#823;', '&#1060;', '.Name-FF', '(Y)', 'G&#838;', '&#40984;', 'f&#838;', 'M&#829;&#851;', '&#120468;&#823;', '&#120480;&#823;', '&#5196;', 'toUpperCase', 'N&#857;', '⎝⎝✧GͥOͣDͫ✧⎠⎠', 'z&#828;', '&#996;', 'A&#838;', 's13', '📭︎', '.:｡+ﾟ', '.symbolsCharMap', '.arrowBox', 's&#846;', '&#120440;&#823;', '&#1351;', '\x20✿◉●•◦', 'f&#799;', '&#1092;', '9&#830;', '&#1337;', '&#120461;&#823;', '&#41949;', '🖳︎', '💣︎', '&#669;', '&#295;', '(◍•ᴗ•◍)\x20ミ💖\x20', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '&#120823;&#823;', '&#41731;', '&#120463;&#823;', '&#586;', '&#120435;&#823;', 'indexOf', 'F&#826;', 'A&#830;', '&#639;', '9&#829;&#851;', '&#41053;', 's18', '&#321;', '&otilde;', 'map', 'R&#829;&#851;', '&#41016;', 'B&#828;', '3&#866;', 'remove', 'h&#838;', '&#10126;', '&#7990;', 's11', 'z&#829;&#851;', 'toLowerCase', '(.﹒︠₋﹒︡.)\x20ﾟ😳☹', '&#41751;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', '8&#830;', '&#315;', 'w&#838;', '&ugrave;', '&#614;', 's29', '&#406;', '.heart7', 'Y&#838;', 's&#838;', 'I&#846;', 'A&#799;', '&#2792;', 'e&#826;', '.wrap5', '&#1050;', 's&#857;', '&part;', '.star5', 'P&#826;', 'k&#838;', '&#4329;', 'L&#799;', '¸♩·¯·ξξ(∵❤◡❤∵)ξξ🌸', 'Q&#857;', 'x&#826;', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', '.sad7', 'P&#846;', '&#41508;', '★·.·´¯`·.·★.·', '&#4327;', '🕿︎', 'h&#828;', 'a&#830;', 'a&#799;', '&#1051;', '&#391;', 'A&#866;', '.vaporwaveText1', '&#608;', '&#1073;', 'u&#866;', 'm&#829;&#851;', 'q&#828;', '8&#799;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '&#42180;', '&#5615;', 'R&#826;', 'Y&#828;', 'k&#799;', 'random', '.fullCrazy', '&#42130;', 'X&#799;', '\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '&#41754;', 'W&#846;', '(\x20◔\x20ʖ̯\x20◔\x20)\x20', '&#311;', 'i&#829;&#851;', '.arrowBelow', '&#420;', 'Z&#829;&#851;', 'x&#828;', 'g&#828;', '&#41126;', 'console', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '&#1347;', '&#434;', '.lunicreepify', 'M&#828;', '☞ó\x20͜つò☞\x20\x20', 'n&#799;', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', '🌸ξξ(∵❤◡❤∵)ξξ·¯·♩¸\x20', '&#308;', '&#5290;', '&#41120;', '.star1', '.diametricBox', 'x&#857;', '【$1】', '.slashThrough', 'O&#799;', '&#120825;&#823;', '&#1213;', 'z&#857;', 'O&#838;', '.star9', '&#41074;', '٭⊹¤.•⨳•.*☆✬\x20', '.firework', '&#3619;', '.result-s6', '4&#828;', '&#8355;', '\x20⋆\x20', '🗏︎', '&#627;', 'M&#846;', '&#9796;', '꧁•⊹٭', 'g&#829;&#851;', '&iota;', '&#20057;', '&#9739;', '&#120438;&#823;', '&#120456;&#823;', '&#41804;', '&#1111;', '&#5511;', '&#1056;', '&#613;', 'i&#826;', '&#1076;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '&#41686;', 'щ（ﾟДﾟщ）\x20<\x20', 'U&#830;', 'trim', '&#41081;', '(¯´•._.•\x20', 's&#830;', 'b&#838;', '5&#829;&#851;', 's&#829;&#851;', '<style>\x20//\x20Discord\x20Fonts\x20by\x20:DiscordFonts@gmail.com\x20</style>', '8&#846;', 'u&#829;&#851;', '🖮︎', '&#1192;', '6&#857;', '.stinky', '#fontSize', '&#3923;', '&#3182;', '&#823;', 'E&#857;', '.result-s7', '&#41295;', '&#1344;', '&#942;', '&#120478;&#823;', '📁︎', 'ᵔ⌣ᵔ', 'g&#846;', '(✿^▽^)', '&#41674;', 'f&#828;', '&#1223;', 'T&#829;&#851;', 'R&#846;', 'amd', '&#647;', '&#1291;', 'X&#829;&#851;', '•°¯`••\x20[[text]]\x20••´¯°•', '&#41555;', 'charAt', '&#355;', 'y&#799;', '\x20\x20█\x20▇\x20▆\x20▅\x20▄\x20▂▁', '[[text]]', 's12', 'm&#857;', 'e&#838;', '(づ｡◕‿‿◕｡)づ\x20', '&#4306;', '&#294;', '9&#846;', '6&#826;', 'tools', '⦑$1⦒', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '.clear', 'S&#828;', '&#2414;', '&#120433;&#823;', '.heart3', '&Lambda;', 'textarea', '&#1087;', 'Q&#829;&#851;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', '📫︎', ',-*\x27^\x27~*-.,_,.-*~\x20', '&#8023;', '˜”*°•.˜”*°•\x20', '&#7433;', '&#413;', '🕓︎', '&sigma;', 'x&#838;', '&#9835;', 'G&#828;', 'B&#830;', 'creepify', 'w&#866;', '۝༒༺', '3&#830;', 'value', 'Y&#846;', '&#41660;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', '`•.,¸¸,.•´¯\x20', '🖰︎', 's25', '9&#799;', 'F&#838;', '&#41037;', '×º°”˜`”°º×\x20', '1&#826;', '&#3648;', '&#12552;', 'D&#829;&#851;', 't&#799;', 'Z&#866;', '(*ˊᗜˋ*)', 'Q&#866;', '3&#799;', '•´¯`•.\x20', '&#351;', 'H&#828;', '&#120453;&#823;', '&phi;', 'F&#866;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', 'innerText', '&#438;', '&#41204;', '&#10130;', '꧁𓊈𒆜', '&szlig;', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', 'ﾟ･:,｡★＼(^-^\x20)♪', 'V&#830;', '&#408;', '2&#826;', '🕘︎', '꧁𒆜༒', '.copied', 'esrever', 'b&#799;', '&#41426;', 'body', '&#2798;', '&#404;', '&#9815;', '♡❤●•◦', '.result-s26', '.result-s29', '▌│█║▌║▌║\x20', '&#374;', '(|||❛︵❛.)', '&#4318;', 'N&#829;&#851;', '&#623;', '.star6', '&#1044;', 'x&#799;', 'W&#829;&#851;', '🖴︎', '👌︎', '🐿\x20🎀', '╰•★★\x20', '👻ൠ', 'c&#830;', '.crazyWithFlourishOrSymbols3', 'm&#866;', 'C&#866;', 'W&#799;', '&#41076;', '😐︎', 'return\x20(function()\x20', '♥⊱ღ', '&#9730;', '<style>\x20.DiscordFonts\x20p{font-size:', ']|I{•------»\x20[[text]]\x20«------•}I|[', 'o&#799;', '`•.¸¸.•´´¯`••._.•\x20', '&#120439;&#823;', 'https://www.nicknameffkeren.com/?=', 'K&#866;', 'L&#857;', '.asianStyle2CharMap', 'execCommand', 'b&#846;', 'H&#857;', '[̲̅$1]', 'p&#866;', '&#490;', '♥╣[-_-]╠♥', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '\x20»-(¯`v´¯)-»', 'q&#830;', '&#42159;', '🕯︎', '&#8857;', 'a&#829;&#851;', 'warn', 'C&#857;', '★¸.•☆•.¸★\x20', '🕐︎', 'q&#857;', 'k&#857;', 'z&#846;', 'i&#866;', '(oꆤ︵ꆤo)\x20', 'X&#846;', '🐣♖', '\x20🎀\x20🍒', '⫷\x20[[text]]\x20⫸', '.result-s20', '3&#838;', '&#41427;', '—(••÷[\x20', '&#1330;', '.result-s30', 'constructor', '&#40996;', 'h&#830;', 'K&#828;', 'y&#846;', '.result-s24', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', '.pubggame2', '&#120452;&#823;', '&#346;', 'W&#830;', '&#1331;', '.dotBoxtwo', '•._.••´¯``•.¸¸.•`\x20', '&#65434;', 'b&#828;', 'U&#866;', 'd&#838;', '¸„٭⊹✡•~⍣°”ˆ˜¨', '&#9442;', '&#1075;', '&#5167;', '.crossAboveBelow', '&#42171;', 'o&#828;', '🖬︎', 'F&#828;', 'a&#846;', '(y)', 'W&#857;', 'j&#826;', '&#5229;', '#Name-FF', 'T&#826;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', '5&#866;', 'P&#828;', '&#998;', '.textgun', 'b&#857;', 'C&#830;', '&#12425;', '.result-s11', '&#41532;', '&#4315;', '&#385;', '&#296;', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', 'diacriticsMiddle', '(｡◕‿◕｡)', '&#596;', '&#341;', '.result-s19', '『$1』', '&#1112;', '&#5397;', 'diacriticsTop', '&#3057;', '&iuml;', '(^▽^)\x20\x20', '7&#828;', 'q&#826;', '7&#826;', 'split', '&#940;', '2&#829;&#851;', '┏༼\x20◉\x20╭╮\x20◉༽┓\x20', '5&#799;', '&#41240;', '&#41708;', '3&#826;', '&#625;', 'u&#828;', 'r&#828;', '&#41029;', 'r&#838;', 'N&#799;', 't&#826;', 'i&#799;', '&#258;', 't&#866;', '&#5500;', '.star2', '.thankyou3', '&#1041;', 'D&#846;', '&#9687;', 'V&#846;', '&#120473;&#823;', 'L&#838;', '♪(\x20^-^)/★,｡･:･ﾟ', '.invertedSquaresCharMap', '4&#826;', '&#9773;', 'R&#828;', 'diacriticsBottom', '.bigrus', '&#313;', '.luniroundsquares', '&#1202;', 'P&#838;', '&#41105;', 'm&#799;', '🕑︎', '癶๑)ლ〜♡', 'href', '.boldItalicCharMap', 'ready', '.emoticon3', 'K&#799;', '&#120481;&#823;', '9&#866;', 'function', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '&#1360;', 'select', '&Omega;', 'l&#799;', '$2$1', '&#23610;', '&#1342;', '.zigzagJoiner', '&#412;', 'n&#857;', '1&#838;', '&#2797;', 'a&#866;', '.pubggame1', 'I&#826;', 'R&#799;', 'object', '.sad2', '&Oslash;', '&#1084;', 'J&#846;', 'W&#866;', '&#41008;', '🖂︎', '&#5620;', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', 'J&#829;&#851;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'prototype', '&#41863;', '·.★·.·´¯`·.·★', 'x&#829;&#851;', '&#403;', 'K&#830;', 'o&#830;', '&#1059;', '.vaporwaveText2', '.starJoiner', '&#65420;', '-漫~*\x27¨¯¨\x27*·舞~\x20', 'error', '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', 'j&#866;', '&#670;', 'J&#828;', '&#276;', 'fromCharCode', 'createElement', '&euro;', '&#10003;', '&#1397;', '&#42131;', '&#941;', '&#484;', '🌘‿🌘', 'F&#846;', 'D&#866;', 'exports', '&#120455;&#823;', 's17', 'm&#830;', 's22', 'j&#829;&#851;', '4&#838;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', 's16', '✬☆*.•⨳•.¤⊹٭', '.result-s14', '.emoticon6', '&#42014;', '&#1043;', '.thankyou0', '&#1065;', 'S&#826;', 'v&#838;', '&#120822;&#823;', 'U&#799;', '.squiggle2CharMap', 'q&#866;', '\x20•°*”˜.•°*”˜', 'P&#799;', '&#10125;', '&#447;', 'R&#830;', '—(••÷[\x20[[text]]\x20]÷••)—', '&#120447;&#823;', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', 'Y&#857;', '6&#828;', '&#1171;', '.result-s10', 'f&#830;', '7&#829;&#851;', '&#41712;', 'ミ★\x20', '╚»★«╝', '.wrap3', '&#4310;', 'l&#830;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '&#987;', 'Z&#799;', 'C&#826;', 's24', 'h&#866;', '★彡[', '💖彡', '&#416;', 'V&#799;', '&#548;', 'S&#857;', '6&#838;', '&#41807;', '3&#829;&#851;', '&#8467;', '&#4336;', '.heart0', '&#1090;', '&#42075;', 'h&#799;', '&#120466;&#823;', '&#41392;', 'w&#830;', 'U&#838;', '.result-s8', '&#41556;', 'n&#826;', '&#8134;', '.result-s22', '.strikeThrough', '&#651;', '&kappa;', 'n&#838;', 'A&#829;&#851;', 'I&#857;', '1&#857;', '������', '&#1140;', 'G&#857;', '&#5609;', '&#4357;', 'push', '&#1377;', '.doubleStruckCharMap', 'u&#799;', '&#407;', '2&#828;', 'toString', '2&#866;', '.hashJoiner', 'X&#830;', '♦👺\x20（（●´∧｀●））', 'U&#829;&#851;', '.heart4', '#Sk-text', 'a&#828;', '¸,ø¤º°`°º¤ø,¸\x20', 't&#857;', '&yen;', '&#549;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', 'V&#857;', 'S&#838;', '.emoticon0', '&#1488;', '&#428;', 'Q&#846;', '🕛︎', 'T&#828;', '&#41155;', 'C&#828;', '(-_-)\x20[[text]]\x20(-_-)', '&#42015;', 'j&#857;', '📄︎', '.wrap1', '&#411;', '&#400;', '٭⊹•꧂', '.crazyWithFlourishOrSymbols5', '♪(･ω･)ﾉ', 'X&#866;', 'Z&#828;', '&#12579;', 'Z&#857;', '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '&nu;', '&#3588;', '&#5029;', '&Uacute;', '.squiggle4CharMap', '.wrap4', '0&#826;', '(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', 'v&#866;', 'p&#846;', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', '7&#830;', 'M&#866;', '&#9812;', '&#19973;', 'copy', 'J&#799;', '&#633;', '&#120454;&#823;', '&#4331;', 's&#828;', 'N&#846;', 'g&#826;', '&alpha;', 'forEach', '9&#857;', '&#120443;&#823;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', '.star3', 'Q&#799;', '8&#826;', '\x20]÷••)—\x20', 'd&#846;', 'g&#838;', '__proto__', '&#5741;', '(^▽^)', '&#418;', '&epsilon;', '0&#866;', '2&#838;', 'j&#838;', '.upperAnglesCharMap', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', '&#477;', 'P&#857;', '&#9834;', '.thickBlockFramed', '&#1085;', '&#5205;'];
    _0x2567 = function() {
        return _0x263e4a;
    };
    return _0x2567();
}

function squiggleCharMapFun(_0x10a816) {
    return applyCharMap(squiggleCharMap, _0x10a816);
}

function squiggle2CharMapFun(_0x4b8061) {
    return applyCharMap(squiggle2CharMap, _0x4b8061);
}

function squiggle3CharMapFun(_0x3c41e6) {
    return applyCharMap(squiggle3CharMap, _0x3c41e6);
}

function squiggle4CharMapFun(_0x4e5cc4) {
    return applyCharMap(squiggle4CharMap, _0x4e5cc4);
}

function squiggle5CharMapFun(_0x100504) {
    return applyCharMap(squiggle5CharMap, _0x100504);
}

function squiggle6CharMapFun(_0x5cfee2) {
    return applyCharMap(squiggle6CharMap, _0x5cfee2);
}

function boldCharMapFun(_0x17aeba) {
    return applyCharMap(boldCharMap, _0x17aeba);
}

function oldEnglishCharMapFun(_0x2c46ec) {
    return applyCharMap(oldEnglishCharMap, _0x2c46ec);
}

function medievalCharMapFun(_0x2c2ee8) {
    return applyCharMap(medievalCharMap, _0x2c2ee8);
}

function cursiveCharMapFun(_0xe1d34) {
    return applyCharMap(cursiveCharMap, _0xe1d34);
}

function doubleStruckCharMapFun(_0x1b2ade) {
    return applyCharMap(doubleStruckCharMap, _0x1b2ade);
}

function italicCharMapFun(_0x1b0d72) {
    return applyCharMap(italicCharMap, _0x1b0d72);
}

function boldItalicCharMapFun(_0x29eee6) {
    return applyCharMap(boldItalicCharMap, _0x29eee6);
}

function monospaceCharMapFun(_0x40bd53) {
    return applyCharMap(monospaceCharMap, _0x40bd53);
}

function upperAnglesCharMapFun(_0x1e426e) {
    return applyCharMap(upperAnglesCharMap, _0x1e426e);
}

function greekCharMapFun(_0x4542e7) {
    return applyCharMap(greekCharMap, _0x4542e7);
}

function symbolsCharMapFun(_0x214387) {
    return applyCharMap(symbolsCharMap, _0x214387);
}

function currencyCharMapFun(_0x443b7c) {
    return applyCharMap(currencyCharMap, _0x443b7c);
}

function asianStyleCharMapFun(_0x45e0c3) {
    return applyCharMap(asianStyleCharMap, _0x45e0c3);
}

function asianStyle2CharMapFun(_0x54ab1e) {
    return applyCharMap(asianStyle2CharMap, _0x54ab1e);
}
var luni = new Lunicode();
luni['tools']['creepify']['options'][_0x3e3222(0x149)] = 0xa;

function crazyWithFlourishOrSymbols(_0x10cb66) {
    var _0xca6b14 = _0x3e3222;
    if (Math[_0xca6b14(0x2bf)]() < 0.7) return wrapInSymbols(crazifyText(_0x10cb66), 0x2);
    else return wrapInFlourish(crazifyText(_0x10cb66), 0x2);
}

function illuminati(_0x289028) {
    var _0x4c708d = _0x3e3222;
    return applyCharMap(squiggle5CharMap, _0x4c708d(0x37e) + _0x289028 + '𒆜꧂');
}

function textgun(_0x2dcfc2) {
    var _0x2d7801 = _0x3e3222;
    return '▄︻デ' + _0x2dcfc2[_0x2d7801(0x40c)]('')['join'](_0x2d7801(0x316)) + '══━一';
}

function minigame(_0x892874) {
    var _0x4e35f5 = _0x3e3222;
    return _0x4e35f5(0x4a8) + luni['tools'][_0x4e35f5(0xc8)][_0x4e35f5(0x202)](_0x892874) + _0x4e35f5(0x46);
}

function pubggame1(_0x59d11a) {
    return applyCharMap(cursiveCharMap, '༒☬' + _0x59d11a + '☬༒');
}

function pubggame2(_0x2ee683) {
    var _0x4537c5 = _0x3e3222;
    return applyCharMap(monospaceCharMap, _0x4537c5(0x354) + _0x2ee683 + _0x4537c5(0x4d));
}

function pubggame3(_0x83381a) {
    var _0x31e42c = _0x3e3222;
    return applyCharMap(invertedSquaresCharMap, _0x31e42c(0x376) + _0x83381a + _0x31e42c(0xb9));
}

function bricks(_0x5e8322) {
    var _0x3a2d06 = _0x3e3222;
    return applyCharMap(doubleStruckCharMap, _0x3a2d06(0x243) + _0x5e8322 + _0x3a2d06(0x3a1));
}

function bigrus(_0x375820) {
    var _0x5a0ace = _0x3e3222;
    return applyCharMap(boldItalicCharMap, '٭ᶦᶰᵈ᭄' + _0x375820 + _0x5a0ace(0x24));
}

function strikeThrough(_0x31e848) {
    var _0x3cb2fc = _0x3e3222;
    return _0x31e848['split']('')[_0x3cb2fc(0x209)]('̶') + '̶';
}

function tildeStrikeThrough(_0x75e8d1) {
    var _0xa643f6 = _0x3e3222;
    return _0x75e8d1[_0xa643f6(0x40c)]('')[_0xa643f6(0x209)]('̴') + '̴';
}

function underline(_0xe2c4e7) {
    var _0x140b18 = _0x3e3222;
    return _0xe2c4e7['split']('')[_0x140b18(0x209)]('̲') + '̲';
}

function doubleUnderline(_0x3926b4) {
    var _0x41d5d0 = _0x3e3222;
    return _0x3926b4[_0x41d5d0(0x40c)]('')[_0x41d5d0(0x209)]('̳') + '̳';
}

function slashThrough(_0x5327e2) {
    var _0x3e4117 = _0x3e3222;
    return _0x5327e2[_0x3e4117(0x40c)]('')['join']('̷') + '̷';
}

function stinky(_0x4ce72f) {
    var _0x29394e = _0x3e3222;
    return _0x4ce72f[_0x29394e(0x40c)]('')[_0x29394e(0x209)]('̾') + '̾';
}

function heartsBetween(_0x38ae97) {
    var _0x446a9b = _0x3e3222;
    return _0x38ae97[_0x446a9b(0x40c)]('')['join']('♥');
}

function arrowBelow(_0x35dc30) {
    var _0x325fbf = _0x3e3222;
    return _0x35dc30[_0x325fbf(0x40c)]('')[_0x325fbf(0x209)]('͎') + '͎';
}

function crossAboveBelow(_0x2a455f) {
    var _0x2303fb = _0x3e3222;
    return _0x2a455f['split']('')[_0x2303fb(0x209)]('͓̽') + '͓̽';
}
const wingdingsCharMap = {
    0x0: _0x3e3222(0x31d),
    0x1: '📂︎',
    0x2: _0x3e3222(0x4ed),
    0x3: _0x3e3222(0x2ef),
    0x4: '🗐︎',
    0x5: _0x3e3222(0x51),
    0x6: '⌛︎',
    0x7: _0x3e3222(0x30f),
    0x8: _0x3e3222(0x35b),
    0x9: _0x3e3222(0x153),
    '!': '✏︎',
    '\x22': '✂︎',
    '#': '✁︎',
    '$': '👓︎',
    '%': '🕭︎',
    '&': _0x3e3222(0x189),
    '\x27': _0x3e3222(0x3b7),
    '(': _0x3e3222(0x2ab),
    ')': '✆︎',
    '*': _0x3e3222(0x456),
    '+': '🖃︎',
    ',': '📪︎',
    '-': _0x3e3222(0x346),
    '.': '📬︎',
    '/': _0x3e3222(0x259),
    ':': _0x3e3222(0x267),
    ';': _0x3e3222(0x394),
    '<': '🖫︎',
    '=': _0x3e3222(0x3e6),
    '>': '✇︎',
    '?': '✍︎',
    'A': '✌︎',
    'B': _0x3e3222(0x395),
    'C': _0x3e3222(0x144),
    'D': _0x3e3222(0xf2),
    'E': '☜︎',
    'F': '☞︎',
    'G': '☝︎',
    'H': '☟︎',
    'I': '✋︎',
    'J': '☺︎',
    'K': _0x3e3222(0x39f),
    'L': '☹︎',
    'M': _0x3e3222(0x268),
    'N': '☠︎',
    'O': '⚐︎',
    'P': _0x3e3222(0x3c),
    'Q': '✈︎',
    'R': '☼︎',
    'S': '💧︎',
    'T': '❄︎',
    'U': _0x3e3222(0x4c),
    'V': '✞︎',
    'W': '🕈︎',
    'X': '✠︎',
    'Y': '✡︎',
    'Z': '☪︎',
    '[': '☯︎',
    '\x5c': 'ॐ︎',
    ']': '☸︎',
    '^': '♈︎',
    '_': '♉︎',
    '`': '♊︎',
    'a': '♋︎',
    'b': '♌︎',
    'c': '♍︎',
    'd': '♎︎',
    'e': '♏︎',
    'f': '♐︎',
    'g': '♑︎',
    'h': '♒︎',
    'i': '♓︎',
    'j': '🙰',
    'k': '🙵',
    'l': '●︎',
    'm': '❍︎',
    'n': '■︎',
    'o': '□︎',
    'p': '◻︎',
    'q': '❑︎',
    'r': '❒︎',
    's': '⬧︎',
    't': '⧫︎',
    'u': '◆︎',
    'v': '❖︎',
    'w': '⬥︎',
    'x': '⌧︎',
    'y': '⍓︎',
    'z': '⌘︎',
    '{': '❀︎',
    '|': '✿︎',
    '}': '❝︎',
    '~': '❞︎',
    '\x20': '▯︎',
    '€': '⓪︎',
    '\x20': '①︎',
    '‚': '②︎',
    'ƒ': '③︎',
    '„': '④︎',
    '…': '⑤︎',
    '†': '⑥︎',
    '‡': '⑦︎',
    'ˆ': '⑧︎',
    '‰': '⑨︎',
    'Š': '⑩︎',
    '‹': '⓿︎',
    'Œ': '❶︎',
    '\x20': '❷︎',
    'Ž': '❸︎',
    '\x20': '❹︎',
    '\x20': '❺︎',
    '‘': '❻︎',
    '’': '❼︎',
    '“': '❽︎',
    '”': '❾︎',
    '•': '❿︎',
    '–': '◻︎',
    '—': '◻︎',
    '˜': '◻︎',
    '™': '◻︎',
    'š': '◻︎',
    '›': '◻︎',
    'œ': '◻︎',
    '\x20': '◻︎',
    'ž': '·︎',
    'Ÿ': '•︎',
    '¡': '○︎',
    '¢': '⭕︎',
    '£': '◻︎',
    '¤': '◉︎',
    '¥': '◎︎',
    '¦': '◻︎',
    '§': '▪︎',
    '¨': '◻︎',
    '©': '◻︎',
    'ª': '✦︎',
    '«': '★︎',
    '¬': '✶︎',
    '®': '✹︎',
    '¯': '✵︎',
    '°': '◻︎',
    '±': '⌖︎',
    '²': '⟡︎',
    '³': '⌑︎',
    '´': '◻︎',
    'µ': '✪︎',
    '¶': '✰︎',
    '·': _0x3e3222(0x3bd),
    '¸': _0x3e3222(0x434),
    '¹': '🕒︎',
    'º': _0x3e3222(0x34c),
    '»': '🕔︎',
    '¼': '🕕︎',
    '½': _0x3e3222(0x1d1),
    '¾': _0x3e3222(0x112),
    '¿': _0x3e3222(0x37d),
    'À': _0x3e3222(0x1ec),
    'Á': _0x3e3222(0x4e),
    'Â': _0x3e3222(0x4e6),
    'Ã': '◻︎',
    'Ä': '◻︎',
    'Å': '◻︎',
    'Æ': '◻︎',
    'Ç': '◻︎',
    'È': '◻︎',
    'É': '◻︎',
    'Ê': '◻︎',
    'Ë': '◻︎',
    'Ì': '◻︎',
    'Í': '◻︎',
    'Î': '◻︎',
    'Ï': '◻︎',
    'Ð': '◻︎',
    'Ñ': '◻︎',
    'Ò': '◻︎',
    'Ó': '◻︎',
    'Ô': '◻︎',
    'Õ': '⌫︎',
    'Ö': '⌦︎',
    '×': '◻︎',
    'Ø': '➢︎',
    'Ù': '◻︎',
    'Ú': '◻︎',
    'Û': '◻︎',
    'Ü': '➲︎',
    'Ý': '◻︎',
    'Þ': '◻︎',
    'ß': '◻︎',
    'à': '◻︎',
    'á': '◻︎',
    'â': '◻︎',
    'ã': '◻︎',
    'ä': '◻︎',
    'å': '◻︎',
    'æ': '◻︎',
    'ç': '◻︎',
    'è': '➔︎',
    'é': '◻︎',
    'ê': '◻︎',
    'ë': '◻︎',
    'ì': '◻︎',
    'í': '◻︎',
    'î': '◻︎',
    'ï': '⇦︎',
    'ð': '⇨︎',
    'ñ': '⇧︎',
    'ò': '⇩︎',
    'ó': '⬄︎',
    'ô': '⇳︎',
    'õ': '⬀︎',
    'ö': '⬁︎',
    '÷': '⬃︎',
    'ø': '⬂︎',
    'ù': '▭︎',
    'ú': '▫︎',
    'û': '✗︎',
    'ü': '✓︎',
    'ý': '☒︎',
    'þ': '☑︎',
    'ÿ': '◻︎'
};

function wingdings(_0x1d500b) {
    var _0x30b941 = _0x3e3222;
    return _0x1d500b[_0x30b941(0x40c)]('')[_0x30b941(0x27c)](function(_0x2b9fe4) {
        return wingdingsCharMap[_0x2b9fe4] ? wingdingsCharMap[_0x2b9fe4] : _0x2b9fe4;
    })[_0x30b941(0x209)]('');
}
const vaporwaveCharMap = {
    '\x20': '\u3000',
    '`': '`',
    0x1: '１',
    0x2: '２',
    0x3: '３',
    0x4: '４',
    0x5: '５',
    0x6: '６',
    0x7: '７',
    0x8: '８',
    0x9: '９',
    0x0: '０',
    '-': '－',
    '=': '＝',
    '~': '~',
    '!': '！',
    '@': '＠',
    '#': '＃',
    '$': '＄',
    '%': '％',
    '^': '^',
    '&': '＆',
    '*': '＊',
    '(': '（',
    ')': '）',
    '_': '_',
    '+': '＋',
    'q': 'ｑ',
    'w': 'ｗ',
    'e': 'ｅ',
    'r': 'ｒ',
    't': 'ｔ',
    'y': 'ｙ',
    'u': 'ｕ',
    'i': 'ｉ',
    'o': 'ｏ',
    'p': 'ｐ',
    '[': '[',
    ']': ']',
    '\x5c': '\x5c',
    'Q': 'Ｑ',
    'W': 'Ｗ',
    'E': 'Ｅ',
    'R': 'Ｒ',
    'T': 'Ｔ',
    'Y': 'Ｙ',
    'U': 'Ｕ',
    'I': 'Ｉ',
    'O': 'Ｏ',
    'P': 'Ｐ',
    '{': '{',
    '}': '}',
    '|': '|',
    'a': 'ａ',
    's': 'ｓ',
    'd': 'ｄ',
    'f': 'ｆ',
    'g': 'ｇ',
    'h': 'ｈ',
    'j': 'ｊ',
    'k': 'ｋ',
    'l': 'ｌ',
    ';': '；',
    '\x27': '＇',
    'A': 'Ａ',
    'S': 'Ｓ',
    'D': 'Ｄ',
    'F': 'Ｆ',
    'G': 'Ｇ',
    'H': 'Ｈ',
    'J': 'Ｊ',
    'K': 'Ｋ',
    'L': 'Ｌ',
    ':': '：',
    '\x22': '\x22',
    'z': 'ｚ',
    'x': 'ｘ',
    'c': 'ｃ',
    'v': 'ｖ',
    'b': 'ｂ',
    'n': 'ｎ',
    'm': 'ｍ',
    ',': '，',
    '.': '．',
    '/': '／',
    'Z': 'Ｚ',
    'X': 'Ｘ',
    'C': 'Ｃ',
    'V': 'Ｖ',
    'B': 'Ｂ',
    'N': 'Ｎ',
    'M': 'Ｍ',
    '<': '<',
    '>': '>',
    '?': '？'
};

function vaporwaveText(_0x460f28) {
    var _0x46fa46 = _0x3e3222,
        _0x24e2ff = _0x460f28[_0x46fa46(0x40c)]('\x20')[_0x46fa46(0x40)];
    _0x460f28 = applyCharMap(vaporwaveCharMap, _0x460f28);
    var _0x251ce = getAsianChars(Math['max'](0x3, _0x24e2ff));
    if (_0x24e2ff > 0x6) _0x251ce = _0x251ce[_0x46fa46(0x40c)]('')[_0x46fa46(0x27c)](_0x44a786 => _0x44a786 + ['', ''][Math['round'](Math[_0x46fa46(0x2bf)]() * 0.6)])[_0x46fa46(0x209)]('');
    var _0x3f9ffb = [];
    return _0x3f9ffb[_0x46fa46(0x4cc)](_0x460f28), _0x3f9ffb[_0x46fa46(0x209)]();
}

function vaporwaveText1(_0x25bcbe) {
    var _0x45b733 = _0x3e3222,
        _0x32d3a9 = _0x25bcbe['split']('\x20')[_0x45b733(0x40)];
    _0x25bcbe = applyCharMap(vaporwaveCharMap, _0x25bcbe);
    var _0x423819 = getAsianChars(Math[_0x45b733(0x224)](0x3, _0x32d3a9));
    if (_0x32d3a9 > 0x6) _0x423819 = _0x423819['split']('')[_0x45b733(0x27c)](_0x1f0a4b => _0x1f0a4b + ['', ''][Math['round'](Math['random']() * 0.6)])[_0x45b733(0x209)]('');
    var _0x3b266d = [];
    return _0x3b266d[_0x45b733(0x4cc)](_0x25bcbe[_0x45b733(0x236)](/　/g, '░')['replace'](/ａｅ/, 'æ')['replace'](/Ａ/g, 'Λ')[_0x45b733(0x236)](/Ｅ/g, function() {
        var _0x196c43 = _0x45b733;
        return Math[_0x196c43(0x2bf)]() > 0.5 ? 'Ξ' : 'Σ';
    })['replace'](/Ｏ/g, '♢')), _0x3b266d[_0x45b733(0x209)]();
}

function vaporwaveText2(_0xeac474) {
    var _0x5d0fc5 = _0x3e3222,
        _0x204840 = _0xeac474[_0x5d0fc5(0x40c)]('\x20')[_0x5d0fc5(0x40)];
    _0xeac474 = applyCharMap(vaporwaveCharMap, _0xeac474);
    var _0x380dd7 = getAsianChars(Math['max'](0x3, _0x204840));
    if (_0x204840 > 0x6) _0x380dd7 = _0x380dd7[_0x5d0fc5(0x40c)]('')['map'](_0x4f7f26 => _0x4f7f26 + ['', ''][Math[_0x5d0fc5(0x21f)](Math[_0x5d0fc5(0x2bf)]() * 0.6)])[_0x5d0fc5(0x209)]('');
    var _0x2e2484 = [];
    return _0x2e2484[_0x5d0fc5(0x4cc)]('【\ufeff' + _0xeac474 + '】'), _0x2e2484[_0x5d0fc5(0x209)]();
}

function getAsianChars(_0xce5ee) {
    var _0x125581 = _0x3e3222;
    if (!_0xce5ee) _0xce5ee = 0x1;
    var _0x56c3d1 = _0x125581(0xc),
        _0x5bdd93 = '';
    for (var _0x559dd3 = 0x0; _0x559dd3 < _0xce5ee; _0x559dd3++) {
        _0x5bdd93 += _0x56c3d1[Math[_0x125581(0x7b)](Math[_0x125581(0x2bf)]() * _0x56c3d1[_0x125581(0x40)])];
    }
    return _0x5bdd93;
}
const flourishArray = [_0x3e3222(0x22b), _0x3e3222(0x102), _0x3e3222(0x503), _0x3e3222(0x33), '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', _0x3e3222(0x371), _0x3e3222(0x23c), _0x3e3222(0x495), _0x3e3222(0x1ef), '[[text]]\x20☜(`o´)', _0x3e3222(0x3fc), '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', _0x3e3222(0x26c), _0x3e3222(0x2b9), _0x3e3222(0xf8), _0x3e3222(0x3d3), _0x3e3222(0x4a2), _0x3e3222(0x28a), 'ıllıllı\x20[[text]]\x20ıllıllı', _0x3e3222(0x301), _0x3e3222(0x1de), _0x3e3222(0xc5), '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '*•.¸♡\x20[[text]]\x20♡¸.•*', _0x3e3222(0x2f), _0x3e3222(0x524), _0x3e3222(0x378), _0x3e3222(0x359), _0x3e3222(0x8f), _0x3e3222(0x26d), _0x3e3222(0x14), '•´¯`•.\x20[[text]]\x20.•´¯`•', _0x3e3222(0x468), _0x3e3222(0x32a), '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|', _0x3e3222(0x2a5), _0x3e3222(0x359), _0x3e3222(0x378), _0x3e3222(0x4f8), _0x3e3222(0x22e), _0x3e3222(0x17f), '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', _0x3e3222(0x493), _0x3e3222(0x3ef), _0x3e3222(0x58), ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', _0x3e3222(0x13c), _0x3e3222(0x226), _0x3e3222(0x47f), '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', _0x3e3222(0x208), _0x3e3222(0x3a4), _0x3e3222(0x2d0), _0x3e3222(0x4ea), '•´¯`•.\x20[[text]]\x20.•´¯`•', _0x3e3222(0x1c8), _0x3e3222(0x16a), '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', _0x3e3222(0x6c), _0x3e3222(0xa7), _0x3e3222(0x514), _0x3e3222(0x33b), '╚»★«╝\x20[[text]]\x20╚»★«╝', _0x3e3222(0x3c6), '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', _0x3e3222(0x2d7), _0x3e3222(0x4df), 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', _0x3e3222(0x180), _0x3e3222(0xbf), _0x3e3222(0x86), _0x3e3222(0xe8)];

function wrapInFlourish(_0x50b2f0) {
    var _0x44a50f = _0x3e3222;
    return flourishArray[Math[_0x44a50f(0x7b)](Math[_0x44a50f(0x2bf)]() * flourishArray[_0x44a50f(0x40)])][_0x44a50f(0x236)]('[[text]]', _0x50b2f0);
}

function Flourishlist(_0x1b6a3a, _0x11048c) {
    var _0x4d7861 = _0x3e3222;
    return flourishArray[_0x1b6a3a][_0x4d7861(0x236)](_0x4d7861(0x330), _0x11048c);
}

function _0x3576(_0x2c1471, _0x59bd37) {
    var _0x14d85 = _0x2567();
    return _0x3576 = function(_0x4953c9, _0x25672e) {
        _0x4953c9 = _0x4953c9 - 0x0;
        var _0x35764c = _0x14d85[_0x4953c9];
        return _0x35764c;
    }, _0x3576(_0x2c1471, _0x59bd37);
}

function wrapInSymbols(_0x532786, _0x25ccfd) {
    return randomSymbols(_0x25ccfd) + '\x20\x20' + _0x532786 + '\x20\x20' + randomSymbols(_0x25ccfd);
}

function firework(_0x2545ff) {
    var _0x49e61e = _0x3e3222;
    return _0x2545ff[_0x49e61e(0x40c)]('')[_0x49e61e(0x209)]('҉') + '҉';
}

function weirdBox(_0x4a0ebb) {
    var _0x24c54e = _0x3e3222;
    return _0x4a0ebb['replace'](/([^\s])/g, _0x24c54e(0x3af));
}

function curlybrackets(_0xb599f3) {
    return _0xb599f3['replace'](/([^\s])/g, '⧼$1&#828;⧽');
}

function singlewavyJoiner(_0x56c89a) {
    var _0xff61d0 = _0x3e3222;
    return '〜' + _0x56c89a['split']('')[_0xff61d0(0x209)]('∿') + '〜';
}

function thickBox(_0x2d2ef6) {
    var _0x43d718 = _0x3e3222;
    return _0x2d2ef6[_0x43d718(0x236)](/([^\s])/g, _0x43d718(0x59));
}

function zigzagJoiner(_0x12cff5) {
    var _0x218e91 = _0x3e3222;
    return _0x12cff5[_0x218e91(0x236)](/([^\s])/g, _0x218e91(0x182));
}

function hashJoiner(_0x345ba4) {
    var _0x9eaab5 = _0x3e3222;
    return _0x345ba4[_0x9eaab5(0x40c)]('')[_0x9eaab5(0x209)]('⨳');
}

function starJoiner(_0x5a2f08) {
    var _0x2b2a13 = _0x3e3222;
    return _0x5a2f08[_0x2b2a13(0x236)](/([^\s])/g, _0x2b2a13(0x182));
}

function connectedJoiner(_0x4fc726) {
    var _0x19405f = _0x3e3222;
    return _0x4fc726[_0x19405f(0x40c)]('')[_0x19405f(0x209)]('⊶');
}

function arrowjoin(_0x3633cd) {
    var _0x253a5a = _0x3e3222;
    return _0x3633cd[_0x253a5a(0x236)](/([^\s])/g, '⦏$1&#x302;⦎');
}

function dotBoxtwo(_0xf5b054) {
    var _0x4f89e9 = _0x3e3222;
    return _0xf5b054['split']('')[_0x4f89e9(0x209)]('&#778;\x20⫶');
}

function dotBox(_0x4e9890) {
    var _0x1d8b22 = _0x3e3222;
    return _0x4e9890['replace'](/([^\s])/g, _0x1d8b22(0x18c));
}

function diametricBox(_0x4c04d1) {
    var _0x45688d = _0x3e3222;
    return _0x4c04d1[_0x45688d(0x236)](/([^\s])/g, _0x45688d(0x33a));
}

function arrowBox(_0x2ec9b1) {
    return _0x2ec9b1['replace'](/([^\s])/g, '⦏$1⦎');
}

function littleSparkles(_0x382a7c) {
    var _0x2bdbbf = _0x3e3222;
    return _0x2bdbbf(0x349) + _0x382a7c + _0x2bdbbf(0x48e);
}

function kirbyHug(_0x49715e) {
    var _0x5a6a40 = _0x3e3222;
    return _0x5a6a40(0x3f) + _0x49715e + '\x20♥';
}

function dottyJoiner(_0x34020f) {
    var _0x2774b1 = _0x3e3222;
    return '░' + _0x34020f[_0x2774b1(0x40c)]('')[_0x2774b1(0x209)]('░') + '░';
}

function wavyJoiner(_0x453e66) {
    var _0x311938 = _0x3e3222;
    return '≋' + _0x453e66[_0x311938(0x40c)]('')['join']('≋') + '≋';
}

function diametricAngleFrame(_0x2a8f86) {
    var _0x185abf = _0x3e3222;
    return _0x2a8f86[_0x185abf(0x236)](/([^\s])/g, _0x185abf(0x402));
}

function thickBlockFramed(_0x395662) {
    var _0x494e19 = _0x3e3222;
    return _0x395662['replace'](/([^\s])/g, _0x494e19(0x2df));
}

function star0(_0x2529b1) {
    var _0x46c5ae = _0x3e3222;
    return applyCharMap(italicCharMap, _0x46c5ae(0x49d) + _0x2529b1 + '★彡');
}

function star1(_0x428293) {
    var _0x4bd21c = _0x3e3222;
    return applyCharMap(monospaceCharMap, _0x4bd21c(0x2f3) + _0x428293 + _0x4bd21c(0x4f1));
}

function star2(_0x58956b) {
    var _0x191525 = _0x3e3222;
    return applyCharMap(currencyCharMap, _0x191525(0x1a9) + _0x58956b + _0x191525(0x234));
}

function star3(_0xa27942) {
    var _0x15aaec = _0x3e3222;
    return applyCharMap(monospaceCharMap, _0x15aaec(0x397) + _0xa27942 + _0x15aaec(0x90));
}

function star4(_0x4378de) {
    var _0x176e4f = _0x3e3222;
    return applyCharMap(squaresCharMap, '`✵•.¸,✵°✵.｡.✰\x20\x20' + _0x4378de + _0x176e4f(0x194));
}

function star5(_0x26c27f) {
    var _0xba26e7 = _0x3e3222;
    return applyCharMap(doubleStruckCharMap, _0xba26e7(0x45d) + _0x26c27f + _0xba26e7(0x2a9));
}

function star6(_0x3d82c7) {
    var _0x4d2d9f = _0x3e3222;
    return applyCharMap(invertedSquaresCharMap, '¨˜ˆ”°⍣~•✡⊹٭„¸\x20\x20' + _0x3d82c7 + _0x4d2d9f(0x3df));
}

function star7(_0x44d142) {
    var _0x3a0d49 = _0x3e3222;
    return applyCharMap(asianStyleCharMap, _0x3a0d49(0x3df) + _0x44d142 + '¨˜ˆ”°⍣~•✡⊹٭„¸');
}

function star8(_0x510260) {
    var _0x319fa1 = _0x3e3222;
    return applyCharMap(asianStyle2CharMap, _0x319fa1(0x3bc) + _0x510260 + _0x319fa1(0x1a6));
}

function star9(_0x3cbb2a) {
    var _0x5018c3 = _0x3e3222;
    return applyCharMap(neonCharMap, _0x5018c3(0x2e8) + _0x3cbb2a + _0x5018c3(0x481));
}

function star10(_0x42c6c0) {
    var _0x251844 = _0x3e3222;
    return applyCharMap(squiggle6CharMap, _0x251844(0x2e8) + _0x42c6c0 + _0x251844(0x481));
}

function heart0(_0x5126bf) {
    var _0x38a32f = _0x3e3222;
    return applyCharMap(squiggle5CharMap, _0x38a32f(0x26b) + _0x5126bf + _0x38a32f(0x4a9));
}

function heart1(_0x27ccb9) {
    var _0x12f11f = _0x3e3222;
    return applyCharMap(futureAlienCharMap, _0x12f11f(0x115) + _0x27ccb9 + '෴❤️෴');
}

function heart2(_0xafbd56) {
    var _0x1983f5 = _0x3e3222;
    return applyCharMap(boldCharMap, '💖´\x20*•.¸♥¸.•**\x20' + _0xafbd56 + _0x1983f5(0xcd));
}

function heart3(_0x1db694) {
    var _0x572c01 = _0x3e3222;
    return applyCharMap(firework, '♡〜ლ(๑癶\x20' + _0x1db694 + _0x572c01(0x435));
}

function heart4(_0x43a925) {
    var _0x3a40d8 = _0x3e3222;
    return applyCharMap(symbolsCharMap, _0x3a40d8(0xd5) + _0x43a925 + _0x3a40d8(0x387));
}

function heart5(_0x5c13ab) {
    var _0x3baf5b = _0x3e3222;
    return applyCharMap(bentTextCharMap, _0x3baf5b(0x2d8) + _0x5c13ab + _0x3baf5b(0x2a2));
}

function heart6(_0x64516b) {
    var _0x28de49 = _0x3e3222;
    return applyCharMap(upperAnglesCharMap, '♥╣[-_-]╠♥' + _0x64516b + _0x28de49(0x3b2));
}

function heart7(_0x5918b1) {
    var _0x2d41df = _0x3e3222;
    return applyCharMap(boldCharMap, _0x2d41df(0x1c2) + _0x5918b1 + '♥¸.•*❤´°◦¸¸.◦°˚°◦☙◦彡彡');
}

function emoticon0(_0x3b16a1) {
    var _0x16c4d0 = _0x3e3222;
    return applyCharMap(oldEnglishCharMap, _0x16c4d0(0x98) + _0x3b16a1 + '(｀∀´)Ψ');
}

function emoticon1(_0x513c85) {
    var _0x2a50ea = _0x3e3222;
    return applyCharMap(squiggle6CharMap, _0x2a50ea(0x303) + _0x513c85 + ')');
}

function emoticon2(_0x39ccbe) {
    var _0x40c62e = _0x3e3222;
    return applyCharMap(boldCharMap, _0x40c62e(0x2d5) + _0x39ccbe + '');
}

function emoticon3(_0x2f4a77) {
    return applyCharMap(squiggle5CharMap, '(☝◞‸◟)☞' + _0x2f4a77 + '');
}

function emoticon4(_0x12af32) {
    var _0xa77577 = _0x3e3222;
    return applyCharMap(cursiveCharMap, _0xa77577(0x334) + _0x12af32 + '\x20٩(˘◡˘)۶');
}

function emoticon5(_0x49b0f0) {
    var _0x4ed05f = _0x3e3222;
    return applyCharMap(squiggle3CharMap, '🌘‿🌘\x20\x20' + _0x49b0f0 + _0x4ed05f(0x109));
}

function emoticon6(_0x352f2a) {
    var _0x4d0004 = _0x3e3222;
    return applyCharMap(wideTextCharMap, _0x4d0004(0x408) + _0x352f2a + _0x4d0004(0x320));
}

function emoticon7(_0x1366ca) {
    var _0x1682eb = _0x3e3222;
    return applyCharMap(squiggle2CharMap, _0x1682eb(0x5e) + _0x1366ca + '(•◡•)');
}

function thankyou0(_0x15c691) {
    var _0x1a0e7e = _0x3e3222;
    return applyCharMap(doubleStruckCharMap, '(･ω･)♪' + _0x15c691 + _0x1a0e7e(0x4f3));
}

function thankyou1(_0x477d40) {
    var _0x39f69a = _0x3e3222;
    return applyCharMap(cursiveCharMap, '(*ˊᗜˋ*)' + _0x477d40 + _0x39f69a(0x367));
}

function thankyou2(_0x252487) {
    return applyCharMap(doubleStruckCharMap, '(*ゝω・)' + _0x252487 + '(ω・*ゝ)');
}

function thankyou3(_0x3b99ee) {
    var _0x2c47c7 = _0x3e3222;
    return applyCharMap(upperAnglesCharMap, _0x2c47c7(0x159) + _0x3b99ee + '');
}

function thankyou4(_0xb17897) {
    var _0x151e38 = _0x3e3222;
    return applyCharMap(squiggle2CharMap, _0x151e38(0x1c0) + _0xb17897 + '');
}

function thankyou5(_0xf1548e) {
    var _0x1dd2b3 = _0x3e3222;
    return applyCharMap(asianStyleCharMap, _0x1dd2b3(0x379) + _0xf1548e + _0x1dd2b3(0x427));
}

function thankyou6(_0x54c0f7) {
    var _0x41249b = _0x3e3222;
    return applyCharMap(medievalCharMap, '+｡:.ﾟヽ(*´∀)ﾉﾟ' + _0x54c0f7 + _0x41249b(0x25a));
}

function thankyou7(_0x17ff68) {
    var _0x4780c8 = _0x3e3222;
    return applyCharMap(neonCharMap, _0x4780c8(0x218) + _0x17ff68 + _0x4780c8(0x218));
}

function sad0(_0x50b60c) {
    var _0x4456f9 = _0x3e3222;
    return applyCharMap(squiggle5CharMap, _0x4456f9(0x23a) + _0x50b60c + _0x4456f9(0xd1));
}

function sad1(_0xea748e) {
    var _0x565055 = _0x3e3222;
    return applyCharMap(monospaceCharMap, _0x565055(0x40f) + _0xea748e + '\x20(︶︹︺)');
}

function sad2(_0x26d286) {
    var _0x21dbe0 = _0x3e3222;
    return applyCharMap(squiggleCharMap, _0x21dbe0(0x500) + _0x26d286 + _0x21dbe0(0x228));
}

function sad3(_0x20b549) {
    var _0x50d76e = _0x3e3222;
    return applyCharMap(italicCharMap, _0x50d76e(0x2c6) + _0x20b549 + _0x50d76e(0x53));
}

function sad4(_0x395050) {
    var _0x6f2eeb = _0x3e3222;
    return applyCharMap(squiggle3CharMap, _0x6f2eeb(0xdf) + _0x395050 + '\x20٩꒰´·⌢•｀꒱۶⁼³₌₃');
}

function sad5(_0x29ea1) {
    var _0x56a914 = _0x3e3222;
    return applyCharMap(bentTextCharMap, _0x56a914(0x3c2) + _0x29ea1 + '\x20●︿●');
}

function sad6(_0x2828cf) {
    var _0x4996d2 = _0x3e3222;
    return applyCharMap(medievalCharMap, _0x4996d2(0x15e) + _0x2828cf + _0x4996d2(0x38c));
}

function sad7(_0x57304c) {
    var _0x1e26c2 = _0x3e3222;
    return applyCharMap(symbolsCharMap, _0x1e26c2(0x288) + _0x57304c + _0x1e26c2(0x4d6));
}

function cuteText1(_0x213239) {
    var _0x112638 = _0x3e3222;
    return applyCharMap(italicCharMap, _0x112638(0x22c) + _0x213239 + _0x112638(0x22c));
}

function cuteText2(_0x288eef) {
    var _0x23ba2e = _0x3e3222;
    return applyCharMap(squiggle5CharMap, _0x23ba2e(0x396) + _0x288eef + '\x20🎀\x20🐿');
}

function cuteText3(_0x4ccba4) {
    var _0x9f0eff = _0x3e3222;
    return applyCharMap(oldEnglishCharMap, _0x9f0eff(0x3c4) + _0x4ccba4 + _0x9f0eff(0x3c5));
}

function cuteText4(_0x3a492f) {
    var _0x373ce2 = _0x3e3222;
    return applyCharMap(squiggleCharMap, _0x373ce2(0x398) + _0x3a492f + '★｡\x20🎀');
}

function cuteText5(_0x213e0e) {
    var _0x56d590 = _0x3e3222;
    return applyCharMap(cursiveCharMap, _0x56d590(0x8e) + _0x213e0e + _0x56d590(0x1a4));
}

function fullCrazy1(_0x2e9513) {
    return applyCharMap(boldCharMap, '◥꧁ད\x20ॐ卐' + _0x2e9513 + '\x20卐ॐ\x20ཌ꧂◤');
}

function fullCrazy2(_0x1169b7) {
    var _0x203a4a = _0x3e3222;
    return applyCharMap(squiggleCharMap, _0x203a4a(0x13f) + _0x1169b7 + '\x20¤]×´)¤••');
}

function fullCrazy3(_0x41fc78) {
    var _0x33ac69 = _0x3e3222;
    return applyCharMap(doubleStruckCharMap, _0x33ac69(0x3ca) + _0x41fc78 + _0x33ac69(0x518));
}

function fullCrazy4(_0xa73a22) {
    var _0x5c9522 = _0x3e3222;
    return applyCharMap(currencyCharMap, '.o0×X×0o.\x20' + _0xa73a22 + _0x5c9522(0x139));
}

function fullCrazy5(_0x220eb3) {
    var _0x1b6c42 = _0x3e3222;
    return applyCharMap(wideTextCharMap, '•●◉✿\x20' + _0x220eb3 + _0x1b6c42(0x260));
}

function crazyWithFlourishOrSymbols3(_0x360274) {
    var _0x7e8ff9 = _0x3e3222;
    return applyCharMap(italicCharMap, _0x7e8ff9(0x254) + _0x360274 + _0x7e8ff9(0x245));
}

function crazyWithFlourishOrSymbols4(_0x37eb7b) {
    var _0x166c77 = _0x3e3222;
    return applyCharMap(asianStyle2CharMap, _0x166c77(0x117) + _0x37eb7b + _0x166c77(0x345));
}

function crazyWithFlourishOrSymbols1(_0x354f2c) {
    var _0x57a7cc = _0x3e3222;
    return applyCharMap(italicCharMap, _0x57a7cc(0x1fa) + _0x354f2c + '\x20⫸');
}

function crazyWithFlourishOrSymbols2(_0x387ed8) {
    var _0xeb4f39 = _0x3e3222;
    return applyCharMap(boldItalicCharMap, '«-(¯`v´¯)-«\x20' + _0x387ed8 + _0xeb4f39(0x3b4));
}

function crazyWithFlourishOrSymbols5(_0xdb4dd8) {
    var _0x5f01e6 = _0x3e3222;
    return applyCharMap(squaresCharMap, _0x5f01e6(0x21d) + _0xdb4dd8 + 'ஜ۩۞۩ஜ');
}

function wrap1(_0x2b351a) {
    var _0x2fff89 = _0x3e3222;
    return applyCharMap(boldCharMap, '░▒▓█►─═' + [_0x2b351a] + _0x2fff89(0x1fc));
}

function wrap2(_0x460a8a) {
    var _0x204249 = _0x3e3222;
    return applyCharMap(cursiveCharMap, _0x204249(0x2c3) + [_0x460a8a] + _0x204249(0x32f));
}

function wrap3(_0x7e3d43) {
    var _0x7e2bd9 = _0x3e3222;
    return applyCharMap(boldItalicCharMap, _0x7e2bd9(0x38a) + [_0x7e3d43] + '\x20║▌║▌║█│▌');
}

function wrap4(_0x26730c) {
    var _0x1630fb = _0x3e3222;
    return applyCharMap(neonCharMap, '꧁𓊈𒆜' + [_0x26730c] + _0x1630fb(0x222));
}

function wrap5(_0x247ac8) {
    var _0x107c81 = _0x3e3222;
    return applyCharMap(boldItalicCharMap, _0x107c81(0x14c) + [_0x247ac8] + _0x107c81(0x49e));
}
var newtext = {
    's1': {
        0x1: _0x3e3222(0x510),
        0x2: _0x3e3222(0x4a0),
        0x3: '&#392;',
        0x4: '&#1283;',
        0x5: _0x3e3222(0x2e3),
        0x6: '&#989;',
        0x7: _0x3e3222(0x2b3),
        0x8: _0x3e3222(0x328),
        0x9: _0x3e3222(0x2f5),
        0xa: '&#669;',
        0xb: _0x3e3222(0x42),
        0xc: _0x3e3222(0x10c),
        0xd: _0x3e3222(0x414),
        0xe: _0x3e3222(0x2f0),
        0xf: _0x3e3222(0x34d),
        0x10: _0x3e3222(0x3e),
        0x11: '&#985;',
        0x12: _0x3e3222(0x19c),
        0x13: '&#642;',
        0x14: '&#410;',
        0x15: _0x3e3222(0xe5),
        0x16: _0x3e3222(0x4c1),
        0x17: '&#623;',
        0x18: 'x',
        0x19: '&#4327;',
        0x1a: _0x3e3222(0x4de),
        0x1b: 'A',
        0x1c: 'B',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: 'E',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: 'K',
        0x26: 'L',
        0x27: 'M',
        0x28: 'N',
        0x29: 'O',
        0x2a: 'P',
        0x2b: 'Q',
        0x2c: 'R',
        0x2d: 'S',
        0x2e: 'T',
        0x2f: 'U',
        0x30: 'V',
        0x31: 'W',
        0x32: 'X',
        0x33: 'Y',
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's2': {
        0x1: _0x3e3222(0x4af),
        0x2: '&#9837;',
        0x3: '&#9790;',
        0x4: _0x3e3222(0x423),
        0x5: '&euro;',
        0x6: '&#988;',
        0x7: '&#10081;',
        0x8: _0x3e3222(0x2f2),
        0x9: _0x3e3222(0x386),
        0xa: _0x3e3222(0x527),
        0xb: _0x3e3222(0x71),
        0xc: _0x3e3222(0x1da),
        0xd: _0x3e3222(0x506),
        0xe: '&#9835;',
        0xf: '&#8857;',
        0x10: '&rho;',
        0x11: _0x3e3222(0x42a),
        0x12: _0x3e3222(0x124),
        0x13: _0x3e3222(0x3e0),
        0x14: '&#9730;',
        0x15: _0x3e3222(0x2f7),
        0x16: _0x3e3222(0x470),
        0x17: _0x3e3222(0x154),
        0x18: _0x3e3222(0x185),
        0x19: '&#9791;',
        0x1a: _0x3e3222(0x1d9),
        0x1b: _0x3e3222(0x4af),
        0x1c: '&#9837;',
        0x1d: '&#9790;',
        0x1e: _0x3e3222(0x423),
        0x1f: '&euro;',
        0x20: '&#988;',
        0x21: _0x3e3222(0x1db),
        0x22: _0x3e3222(0x2f2),
        0x23: _0x3e3222(0x386),
        0x24: _0x3e3222(0x527),
        0x25: _0x3e3222(0x71),
        0x26: _0x3e3222(0x1da),
        0x27: _0x3e3222(0x506),
        0x28: _0x3e3222(0x34f),
        0x29: _0x3e3222(0x3b8),
        0x2a: '&rho;',
        0x2b: '&#9773;',
        0x2c: _0x3e3222(0x124),
        0x2d: _0x3e3222(0x3e0),
        0x2e: _0x3e3222(0x3a2),
        0x2f: _0x3e3222(0x2f7),
        0x30: '&#10003;',
        0x31: _0x3e3222(0x154),
        0x32: '&#8984;',
        0x33: _0x3e3222(0x25),
        0x34: _0x3e3222(0x1d9),
        0x35: _0x3e3222(0x9),
        0x36: '&#10123;',
        0x37: _0x3e3222(0x8a),
        0x38: _0x3e3222(0x490),
        0x39: _0x3e3222(0x283),
        0x3a: _0x3e3222(0xa6),
        0x3b: _0x3e3222(0xf4),
        0x3c: '&#10129;',
        0x3d: _0x3e3222(0x375),
        0x3e: '&#9450;'
    },
    's3': {
        0x1: _0x3e3222(0x41c),
        0x2: _0x3e3222(0x20c),
        0x3: _0x3e3222(0x12),
        0x4: _0x3e3222(0x242),
        0x5: _0x3e3222(0x46c),
        0x6: _0x3e3222(0x1f8),
        0x7: _0x3e3222(0x110),
        0x8: '&#292;',
        0x9: _0x3e3222(0x3fb),
        0xa: _0x3e3222(0x2d9),
        0xb: _0x3e3222(0x1f7),
        0xc: '&#313;',
        0xd: _0x3e3222(0x48),
        0xe: _0x3e3222(0x0),
        0xf: '&#336;',
        0x10: _0x3e3222(0x2fd),
        0x11: 'Q',
        0x12: '&#340;',
        0x13: _0x3e3222(0x3d6),
        0x14: '&#356;',
        0x15: '&Uacute;',
        0x16: 'V',
        0x17: _0x3e3222(0xa),
        0x18: _0x3e3222(0xf1),
        0x19: _0x3e3222(0x38b),
        0x1a: _0x3e3222(0x145),
        0x1b: _0x3e3222(0x41c),
        0x1c: _0x3e3222(0x20c),
        0x1d: _0x3e3222(0x12),
        0x1e: _0x3e3222(0x242),
        0x1f: _0x3e3222(0x46c),
        0x20: _0x3e3222(0x1f8),
        0x21: _0x3e3222(0x110),
        0x22: _0x3e3222(0x17),
        0x23: _0x3e3222(0x3fb),
        0x24: _0x3e3222(0x2d9),
        0x25: _0x3e3222(0x1f7),
        0x26: _0x3e3222(0x42e),
        0x27: _0x3e3222(0x48),
        0x28: _0x3e3222(0x0),
        0x29: _0x3e3222(0xe1),
        0x2a: _0x3e3222(0x2fd),
        0x2b: 'Q',
        0x2c: _0x3e3222(0xaf),
        0x2d: _0x3e3222(0x3d6),
        0x2e: _0x3e3222(0x20f),
        0x2f: _0x3e3222(0x4fc),
        0x30: 'V',
        0x31: _0x3e3222(0xa),
        0x32: _0x3e3222(0xf1),
        0x33: _0x3e3222(0x38b),
        0x34: _0x3e3222(0x145),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's4': {
        0x1: _0x3e3222(0x18),
        0x2: 'q',
        0x3: _0x3e3222(0x3ff),
        0x4: 'p',
        0x5: _0x3e3222(0x525),
        0x6: '&#607;',
        0x7: _0x3e3222(0x230),
        0x8: '&#613;',
        0x9: _0x3e3222(0x34a),
        0xa: _0x3e3222(0x19c),
        0xb: _0x3e3222(0x46a),
        0xc: 'l',
        0xd: _0x3e3222(0x38f),
        0xe: 'u',
        0xf: 'o',
        0x10: 'd',
        0x11: 'b',
        0x12: _0x3e3222(0x50a),
        0x13: 's',
        0x14: _0x3e3222(0x327),
        0x15: 'n',
        0x16: '&#652;',
        0x17: _0x3e3222(0x199),
        0x18: 'x',
        0x19: _0x3e3222(0x215),
        0x1a: 'z',
        0x1b: _0x3e3222(0x18),
        0x1c: 'q',
        0x1d: '&#596;',
        0x1e: 'p',
        0x1f: _0x3e3222(0x525),
        0x20: _0x3e3222(0x212),
        0x21: _0x3e3222(0x230),
        0x22: _0x3e3222(0x2fe),
        0x23: _0x3e3222(0x34a),
        0x24: _0x3e3222(0x19c),
        0x25: _0x3e3222(0x46a),
        0x26: 'l',
        0x27: '&#623;',
        0x28: 'u',
        0x29: 'o',
        0x2a: 'd',
        0x2b: 'b',
        0x2c: _0x3e3222(0x50a),
        0x2d: 's',
        0x2e: _0x3e3222(0x327),
        0x2f: 'n',
        0x30: _0x3e3222(0x1b7),
        0x31: '&#653;',
        0x32: 'x',
        0x33: _0x3e3222(0x215),
        0x34: 'z',
        0x35: _0x3e3222(0x291),
        0x36: _0x3e3222(0x4cb),
        0x37: _0x3e3222(0x4f0),
        0x38: _0x3e3222(0x4f6),
        0x39: _0x3e3222(0x4a3),
        0x3a: '9',
        0x3b: _0x3e3222(0xbc),
        0x3c: '8',
        0x3d: '6',
        0x3e: '0'
    },
    's5': {
        0x1: '&Delta;',
        0x2: _0x3e3222(0x20c),
        0x3: _0x3e3222(0x225),
        0x4: _0x3e3222(0x87),
        0x5: _0x3e3222(0x46f),
        0x6: _0x3e3222(0x2ed),
        0x7: _0x3e3222(0x474),
        0x8: _0x3e3222(0x336),
        0x9: '&#407;',
        0xa: _0x3e3222(0x2d9),
        0xb: _0x3e3222(0x96),
        0xc: _0x3e3222(0x27a),
        0xd: '&Mu;',
        0xe: _0x3e3222(0x12d),
        0xf: _0x3e3222(0x451),
        0x10: _0x3e3222(0x2ca),
        0x11: _0x3e3222(0x441),
        0x12: _0x3e3222(0xde),
        0x13: _0x3e3222(0x130),
        0x14: '&#358;',
        0x15: _0x3e3222(0xf),
        0x16: 'V',
        0x17: '&#372;',
        0x18: '&#1046;',
        0x19: _0x3e3222(0x4dd),
        0x1a: _0x3e3222(0xbb),
        0x1b: '&Delta;',
        0x1c: _0x3e3222(0x20c),
        0x1d: _0x3e3222(0x225),
        0x1e: '&#272;',
        0x1f: _0x3e3222(0x46f),
        0x20: _0x3e3222(0x2ed),
        0x21: _0x3e3222(0x474),
        0x22: _0x3e3222(0x336),
        0x23: _0x3e3222(0x4d0),
        0x24: _0x3e3222(0x2d9),
        0x25: _0x3e3222(0x96),
        0x26: _0x3e3222(0x27a),
        0x27: _0x3e3222(0xae),
        0x28: '&#327;',
        0x29: _0x3e3222(0x451),
        0x2a: _0x3e3222(0x2ca),
        0x2b: _0x3e3222(0x441),
        0x2c: _0x3e3222(0xde),
        0x2d: _0x3e3222(0x130),
        0x2e: _0x3e3222(0x1f8),
        0x2f: '&#7918;',
        0x30: 'V',
        0x31: _0x3e3222(0xa),
        0x32: '&#1046;',
        0x33: _0x3e3222(0x4dd),
        0x34: _0x3e3222(0xbb),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's6': {
        0x1: '&alpha;',
        0x2: _0x3e3222(0x103),
        0x3: '&#2798;',
        0x4: _0x3e3222(0x29c),
        0x5: _0x3e3222(0x51f),
        0x6: _0x3e3222(0x1e3),
        0x7: '&#608;',
        0x8: _0x3e3222(0x28f),
        0x9: _0x3e3222(0x362),
        0xa: _0x3e3222(0x269),
        0xb: '&#1185;',
        0xc: _0x3e3222(0x4b1),
        0xd: _0x3e3222(0x414),
        0xe: _0x3e3222(0x2f0),
        0xf: '&sigma;',
        0x10: '&rho;',
        0x11: _0x3e3222(0x36e),
        0x12: _0x3e3222(0x297),
        0x13: _0x3e3222(0x2ea),
        0x14: _0x3e3222(0x10b),
        0x15: '&micro;',
        0x16: _0x3e3222(0x233),
        0x17: '&omega;',
        0x18: _0x3e3222(0x4e3),
        0x19: _0x3e3222(0x2aa),
        0x1a: _0x3e3222(0x373),
        0x1b: _0x3e3222(0x510),
        0x1c: _0x3e3222(0x103),
        0x1d: _0x3e3222(0x384),
        0x1e: _0x3e3222(0x29c),
        0x1f: _0x3e3222(0x51f),
        0x20: _0x3e3222(0x1e3),
        0x21: '&#608;',
        0x22: _0x3e3222(0x28f),
        0x23: _0x3e3222(0x362),
        0x24: '&#669;',
        0x25: _0x3e3222(0xc4),
        0x26: _0x3e3222(0x4b1),
        0x27: _0x3e3222(0x414),
        0x28: _0x3e3222(0x2f0),
        0x29: '&sigma;',
        0x2a: _0x3e3222(0x3e),
        0x2b: _0x3e3222(0x36e),
        0x2c: '&#2792;',
        0x2d: _0x3e3222(0x2ea),
        0x2e: _0x3e3222(0x10b),
        0x2f: '&micro;',
        0x30: _0x3e3222(0x233),
        0x31: '&omega;',
        0x32: _0x3e3222(0x4e3),
        0x33: '&#4327;',
        0x34: _0x3e3222(0x373),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's7': {
        0x1: '&#5609;',
        0x2: _0x3e3222(0x1f5),
        0x3: '&#5205;',
        0x4: _0x3e3222(0x6d),
        0x5: _0x3e3222(0x457),
        0x6: '&#5556;',
        0x7: '&#484;',
        0x8: '&#5500;',
        0x9: _0x3e3222(0x4fb),
        0xa: _0x3e3222(0x1cb),
        0xb: _0x3e3222(0x19d),
        0xc: _0x3e3222(0x2da),
        0xd: _0x3e3222(0x151),
        0xe: '&#5198;',
        0xf: _0x3e3222(0x89),
        0x10: _0x3e3222(0x3ec),
        0x11: _0x3e3222(0x271),
        0x12: _0x3e3222(0x2fc),
        0x13: _0x3e3222(0x404),
        0x14: '&#19973;',
        0x15: '&#5196;',
        0x16: '&#5167;',
        0x17: _0x3e3222(0x2bb),
        0x18: '&#5741;',
        0x19: '&#435;',
        0x1a: _0x3e3222(0x2f6),
        0x1b: _0x3e3222(0x4ca),
        0x1c: _0x3e3222(0x1f5),
        0x1d: _0x3e3222(0x52a),
        0x1e: _0x3e3222(0x6d),
        0x1f: _0x3e3222(0x457),
        0x20: '&#5556;',
        0x21: _0x3e3222(0x474),
        0x22: _0x3e3222(0x41e),
        0x23: _0x3e3222(0x4fb),
        0x24: '&#5262;',
        0x25: _0x3e3222(0x19d),
        0x26: _0x3e3222(0x2da),
        0x27: _0x3e3222(0x151),
        0x28: _0x3e3222(0x38),
        0x29: _0x3e3222(0x89),
        0x2a: '&#5229;',
        0x2b: _0x3e3222(0x271),
        0x2c: _0x3e3222(0x2fc),
        0x2d: _0x3e3222(0x404),
        0x2e: _0x3e3222(0x507),
        0x2f: _0x3e3222(0x251),
        0x30: _0x3e3222(0x3e2),
        0x31: '&#5615;',
        0x32: _0x3e3222(0x51c),
        0x33: _0x3e3222(0x62),
        0x34: _0x3e3222(0x2f6),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's8': {
        0x1: _0x3e3222(0x3f9),
        0x2: '&#4329;',
        0x3: _0x3e3222(0x204),
        0x4: _0x3e3222(0x50c),
        0x5: '&#4318;',
        0x6: 'f',
        0x7: '&#4330;',
        0x8: 'h',
        0x9: _0x3e3222(0x284),
        0xa: _0x3e3222(0xe9),
        0xb: _0x3e3222(0x4c2),
        0xc: 'l',
        0xd: _0x3e3222(0x134),
        0xe: '&#8134;',
        0xf: _0x3e3222(0x27b),
        0x10: _0x3e3222(0x3e),
        0x11: _0x3e3222(0x335),
        0x12: _0x3e3222(0x1a0),
        0x13: _0x3e3222(0x4b2),
        0x14: _0x3e3222(0x314),
        0x15: '&upsilon;',
        0x16: _0x3e3222(0x348),
        0x17: 'w',
        0x18: '&#4335;',
        0x19: _0x3e3222(0x2aa),
        0x1a: _0x3e3222(0x70),
        0x1b: _0x3e3222(0x3f9),
        0x1c: _0x3e3222(0x2a0),
        0x1d: '&#4308;',
        0x1e: _0x3e3222(0x50c),
        0x1f: _0x3e3222(0x38d),
        0x20: 'f',
        0x21: _0x3e3222(0x175),
        0x22: 'h',
        0x23: _0x3e3222(0x284),
        0x24: _0x3e3222(0xe9),
        0x25: _0x3e3222(0x4c2),
        0x26: 'l',
        0x27: _0x3e3222(0x134),
        0x28: _0x3e3222(0x4be),
        0x29: _0x3e3222(0x27b),
        0x2a: _0x3e3222(0x3e),
        0x2b: _0x3e3222(0x335),
        0x2c: _0x3e3222(0x1a0),
        0x2d: _0x3e3222(0x4b2),
        0x2e: '&#3923;',
        0x2f: _0x3e3222(0xe5),
        0x30: '&#8023;',
        0x31: 'w',
        0x32: _0x3e3222(0x126),
        0x33: _0x3e3222(0x2aa),
        0x34: '&#576;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's9': {
        0x1: _0x3e3222(0x40d),
        0x2: _0x3e3222(0x80),
        0x3: _0x3e3222(0x195),
        0x4: _0x3e3222(0x7),
        0x5: _0x3e3222(0x473),
        0x6: '&#1171;',
        0x7: _0x3e3222(0x118),
        0x8: _0x3e3222(0x26a),
        0x9: _0x3e3222(0x1d0),
        0xa: '&#1112;',
        0xb: '&#311;',
        0xc: _0x3e3222(0x28c),
        0xd: _0x3e3222(0x452),
        0xe: _0x3e3222(0x31b),
        0xf: _0x3e3222(0x213),
        0x10: _0x3e3222(0x3e),
        0x11: 'q',
        0x12: _0x3e3222(0x400),
        0x13: _0x3e3222(0x36b),
        0x14: _0x3e3222(0x32d),
        0x15: _0x3e3222(0x28e),
        0x16: _0x3e3222(0x4f9),
        0x17: _0x3e3222(0x1b1),
        0x18: 'x',
        0x19: _0x3e3222(0xfa),
        0x1a: _0x3e3222(0x1c1),
        0x1b: _0x3e3222(0x40d),
        0x1c: _0x3e3222(0x80),
        0x1d: '&sigmaf;',
        0x1e: _0x3e3222(0x7),
        0x1f: '&#941;',
        0x20: _0x3e3222(0x498),
        0x21: '&#291;',
        0x22: _0x3e3222(0x26a),
        0x23: _0x3e3222(0x1d0),
        0x24: _0x3e3222(0x403),
        0x25: _0x3e3222(0x2c7),
        0x26: _0x3e3222(0x28c),
        0x27: _0x3e3222(0x452),
        0x28: _0x3e3222(0x31b),
        0x29: _0x3e3222(0x213),
        0x2a: _0x3e3222(0x3e),
        0x2b: 'q',
        0x2c: _0x3e3222(0x400),
        0x2d: _0x3e3222(0x36b),
        0x2e: '&#355;',
        0x2f: '&ugrave;',
        0x30: _0x3e3222(0x4f9),
        0x31: '&#974;',
        0x32: 'x',
        0x33: _0x3e3222(0xfa),
        0x34: _0x3e3222(0x1c1),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's10': {
        0x1: '&#41707;',
        0x2: _0x3e3222(0x4e8),
        0x3: _0x3e3222(0x216),
        0x4: _0x3e3222(0x163),
        0x5: _0x3e3222(0xed),
        0x6: _0x3e3222(0x411),
        0x7: _0x3e3222(0x35f),
        0x8: _0x3e3222(0x4b5),
        0x9: '&#41105;',
        0xa: _0x3e3222(0x1d),
        0xb: _0x3e3222(0xbd),
        0xc: _0x3e3222(0x2c1),
        0xd: '&#41042;',
        0xe: '&#41081;',
        0xf: '&#41346;',
        0x10: _0x3e3222(0x55),
        0x11: _0x3e3222(0xa8),
        0x12: _0x3e3222(0x472),
        0x13: _0x3e3222(0x2c4),
        0x14: '&#42181;',
        0x15: _0x3e3222(0x1ed),
        0x16: _0x3e3222(0x266),
        0x17: _0x3e3222(0xff),
        0x18: _0x3e3222(0x3c9),
        0x19: '&#42015;',
        0x1a: '&#41076;',
        0x1b: _0x3e3222(0x198),
        0x1c: _0x3e3222(0x4e8),
        0x1d: '&#41976;',
        0x1e: _0x3e3222(0x163),
        0x1f: _0x3e3222(0xed),
        0x20: _0x3e3222(0x411),
        0x21: _0x3e3222(0x35f),
        0x22: _0x3e3222(0x4b5),
        0x23: _0x3e3222(0x432),
        0x24: _0x3e3222(0x1d),
        0x25: _0x3e3222(0xbd),
        0x26: _0x3e3222(0x2c1),
        0x27: _0x3e3222(0x1e),
        0x28: _0x3e3222(0x306),
        0x29: _0x3e3222(0xe6),
        0x2a: _0x3e3222(0x55),
        0x2b: _0x3e3222(0xa8),
        0x2c: '&#42131;',
        0x2d: '&#41754;',
        0x2e: _0x3e3222(0x1f),
        0x2f: '&#41991;',
        0x30: _0x3e3222(0x266),
        0x31: _0x3e3222(0xff),
        0x32: _0x3e3222(0x3c9),
        0x33: _0x3e3222(0x4eb),
        0x34: _0x3e3222(0x39e),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's11': {
        0x1: _0x3e3222(0x391),
        0x2: _0x3e3222(0x421),
        0x3: 'C',
        0x4: 'D',
        0x5: _0x3e3222(0x26),
        0x6: 'F',
        0x7: 'G',
        0x8: 'H',
        0x9: 'I',
        0xa: 'J',
        0xb: '&#1180;',
        0xc: 'L',
        0xd: 'M',
        0xe: '&#1048;',
        0xf: '&#1060;',
        0x10: 'P',
        0x11: '&#490;',
        0x12: '&#1071;',
        0x13: 'S',
        0x14: _0x3e3222(0x1a0),
        0x15: _0x3e3222(0x193),
        0x16: 'V',
        0x17: _0x3e3222(0x487),
        0x18: '&#1046;',
        0x19: _0x3e3222(0x462),
        0x1a: 'Z',
        0x1b: '&#1044;',
        0x1c: _0x3e3222(0x421),
        0x1d: 'C',
        0x1e: 'D',
        0x1f: _0x3e3222(0x26),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: _0x3e3222(0x96),
        0x26: 'L',
        0x27: 'M',
        0x28: _0x3e3222(0x155),
        0x29: _0x3e3222(0x248),
        0x2a: 'P',
        0x2b: _0x3e3222(0x3b1),
        0x2c: _0x3e3222(0xf3),
        0x2d: 'S',
        0x2e: _0x3e3222(0x1a0),
        0x2f: _0x3e3222(0x193),
        0x30: 'V',
        0x31: _0x3e3222(0x487),
        0x32: _0x3e3222(0xf1),
        0x33: _0x3e3222(0x462),
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's12': {
        0x1: '&#41807;',
        0x2: '&#41731;',
        0x3: '&#41555;',
        0x4: _0x3e3222(0x27e),
        0x5: _0x3e3222(0xed),
        0x6: '&#41863;',
        0x7: _0x3e3222(0x417),
        0x8: '&#41157;',
        0x9: '&#40996;',
        0xa: _0x3e3222(0x1d),
        0xb: '&#40984;',
        0xc: _0x3e3222(0x2c1),
        0xd: _0x3e3222(0xa3),
        0xe: _0x3e3222(0x2a8),
        0xf: '&#41126;',
        0x10: _0x3e3222(0x55),
        0x11: _0x3e3222(0x4b8),
        0x12: _0x3e3222(0x227),
        0x13: _0x3e3222(0x289),
        0x14: _0x3e3222(0x2ba),
        0x15: '&#40974;',
        0x16: _0x3e3222(0x374),
        0x17: _0x3e3222(0x319),
        0x18: '&#41660;',
        0x19: _0x3e3222(0x82),
        0x1a: _0x3e3222(0x39e),
        0x1b: _0x3e3222(0x4af),
        0x1c: _0x3e3222(0x26f),
        0x1d: _0x3e3222(0x32b),
        0x1e: '&#41016;',
        0x1f: '&#41823;',
        0x20: _0x3e3222(0x45c),
        0x21: _0x3e3222(0x417),
        0x22: '&#41157;',
        0x23: _0x3e3222(0x3ce),
        0x24: '&#41005;',
        0x25: '&#40984;',
        0x26: _0x3e3222(0x2c1),
        0x27: '&#41141;',
        0x28: _0x3e3222(0x2a8),
        0x29: _0x3e3222(0x2ce),
        0x2a: _0x3e3222(0x55),
        0x2b: _0x3e3222(0x4b8),
        0x2c: _0x3e3222(0x227),
        0x2d: _0x3e3222(0x289),
        0x2e: _0x3e3222(0x2ba),
        0x2f: '&#40974;',
        0x30: _0x3e3222(0x374),
        0x31: _0x3e3222(0x319),
        0x32: _0x3e3222(0x358),
        0x33: _0x3e3222(0x82),
        0x34: '&#41076;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's13': {
        0x1: '&#41708;',
        0x2: '&#41203;',
        0x3: _0x3e3222(0x4bc),
        0x4: _0x3e3222(0x3b6),
        0x5: '&#41922;',
        0x6: _0x3e3222(0x148),
        0x7: '&#41804;',
        0x8: '&#41053;',
        0x9: _0x3e3222(0xd),
        0xa: _0x3e3222(0x3e4),
        0xb: '&#40984;',
        0xc: _0x3e3222(0x2c1),
        0xd: _0x3e3222(0xa3),
        0xe: _0x3e3222(0x321),
        0xf: _0x3e3222(0x95),
        0x10: '&#41571;',
        0x11: '&#41392;',
        0x12: _0x3e3222(0x227),
        0x13: '&#41433;',
        0x14: _0x3e3222(0x2ba),
        0x15: _0x3e3222(0xf9),
        0x16: '&#42150;',
        0x17: '&#41296;',
        0x18: _0x3e3222(0x1c3),
        0x19: '&#41766;',
        0x1a: _0x3e3222(0x39e),
        0x1b: _0x3e3222(0x412),
        0x1c: _0x3e3222(0x8c),
        0x1d: _0x3e3222(0x4bc),
        0x1e: _0x3e3222(0x3b6),
        0x1f: _0x3e3222(0x23d),
        0x20: '&#41648;',
        0x21: _0x3e3222(0x2fa),
        0x22: _0x3e3222(0x278),
        0x23: _0x3e3222(0xd),
        0x24: _0x3e3222(0x3e4),
        0x25: _0x3e3222(0x24c),
        0x26: '&#42130;',
        0x27: _0x3e3222(0xa3),
        0x28: _0x3e3222(0x321),
        0x29: _0x3e3222(0x95),
        0x2a: _0x3e3222(0x55),
        0x2b: _0x3e3222(0x4b8),
        0x2c: _0x3e3222(0x227),
        0x2d: '&#41433;',
        0x2e: _0x3e3222(0x2ba),
        0x2f: _0x3e3222(0xf9),
        0x30: '&#42150;',
        0x31: _0x3e3222(0xff),
        0x32: _0x3e3222(0x1c3),
        0x33: '&#41766;',
        0x34: _0x3e3222(0x39e),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's14': {
        0x1: _0x3e3222(0x341),
        0x2: '&#998;',
        0x3: '&#12552;',
        0x4: _0x3e3222(0x6),
        0x5: _0x3e3222(0x4f0),
        0x6: 'F',
        0x7: _0x3e3222(0x45f),
        0x8: '&#1085;',
        0x9: _0x3e3222(0x56),
        0xa: _0x3e3222(0x465),
        0xb: '&#1178;',
        0xc: _0x3e3222(0x27a),
        0xd: _0x3e3222(0x406),
        0xe: '&#1051;',
        0xf: '&Oslash;',
        0x10: _0x3e3222(0x49),
        0x11: _0x3e3222(0x310),
        0x12: _0x3e3222(0x444),
        0x13: _0x3e3222(0x3f6),
        0x14: _0x3e3222(0x20f),
        0x15: _0x3e3222(0x193),
        0x16: '&#404;',
        0x17: '&#412;',
        0x18: _0x3e3222(0x211),
        0x19: _0x3e3222(0x256),
        0x1a: _0x3e3222(0x1a),
        0x1b: '&Lambda;',
        0x1c: _0x3e3222(0x3f2),
        0x1d: _0x3e3222(0x363),
        0x1e: _0x3e3222(0x6),
        0x1f: _0x3e3222(0x4f0),
        0x20: 'F',
        0x21: '&#403;',
        0x22: _0x3e3222(0x529),
        0x23: _0x3e3222(0x56),
        0x24: '&#65420;',
        0x25: '&#1178;',
        0x26: _0x3e3222(0x27a),
        0x27: _0x3e3222(0x406),
        0x28: _0x3e3222(0x2af),
        0x29: _0x3e3222(0x451),
        0x2a: _0x3e3222(0x49),
        0x2b: '&#1192;',
        0x2c: _0x3e3222(0x444),
        0x2d: _0x3e3222(0x3f6),
        0x2e: _0x3e3222(0x20f),
        0x2f: _0x3e3222(0x193),
        0x30: _0x3e3222(0x385),
        0x31: _0x3e3222(0x447),
        0x32: '&chi;',
        0x33: _0x3e3222(0x256),
        0x34: _0x3e3222(0x1a),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's15': {
        0x1: '&#411;',
        0x2: _0x3e3222(0x3fa),
        0x3: _0x3e3222(0x2b0),
        0x4: '&#394;',
        0x5: _0x3e3222(0x1b3),
        0x6: _0x3e3222(0x1fd),
        0x7: '&#403;',
        0x8: _0x3e3222(0x323),
        0x9: '&#406;',
        0xa: _0x3e3222(0xeb),
        0xb: _0x3e3222(0x37b),
        0xc: _0x3e3222(0x1f4),
        0xd: 'M',
        0xe: _0x3e3222(0x34b),
        0xf: _0x3e3222(0x4aa),
        0x10: _0x3e3222(0x2ca),
        0x11: _0x3e3222(0x51e),
        0x12: _0x3e3222(0x210),
        0x13: '&#423;',
        0x14: '&#428;',
        0x15: '&#434;',
        0x16: _0x3e3222(0x385),
        0x17: _0x3e3222(0x447),
        0x18: '&#1202;',
        0x19: '&#435;',
        0x1a: _0x3e3222(0x4ac),
        0x1b: _0x3e3222(0x4ef),
        0x1c: _0x3e3222(0x3fa),
        0x1d: _0x3e3222(0x2b0),
        0x1e: _0x3e3222(0xcc),
        0x1f: _0x3e3222(0x1b3),
        0x20: _0x3e3222(0x1fd),
        0x21: _0x3e3222(0x45f),
        0x22: _0x3e3222(0x323),
        0x23: _0x3e3222(0x291),
        0x24: '&#646;',
        0x25: _0x3e3222(0x37b),
        0x26: _0x3e3222(0x1f4),
        0x27: 'M',
        0x28: _0x3e3222(0x34b),
        0x29: _0x3e3222(0x4aa),
        0x2a: _0x3e3222(0x2ca),
        0x2b: _0x3e3222(0x51e),
        0x2c: _0x3e3222(0x210),
        0x2d: _0x3e3222(0x6b),
        0x2e: _0x3e3222(0x4e4),
        0x2f: _0x3e3222(0x2d2),
        0x30: _0x3e3222(0x385),
        0x31: '&#412;',
        0x32: _0x3e3222(0x430),
        0x33: _0x3e3222(0x62),
        0x34: '&#548;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's16': {
        0x1: _0x3e3222(0x2e7),
        0x2: _0x3e3222(0x49c),
        0x3: _0x3e3222(0x13),
        0x4: _0x3e3222(0x2db),
        0x5: _0x3e3222(0x3f8),
        0x6: _0x3e3222(0x12a),
        0x7: _0x3e3222(0x417),
        0x8: '&#41833;',
        0x9: _0x3e3222(0x432),
        0xa: '&#42171;',
        0xb: _0x3e3222(0xbd),
        0xc: _0x3e3222(0x2c1),
        0xd: _0x3e3222(0xa3),
        0xe: _0x3e3222(0x321),
        0xf: _0x3e3222(0x2ce),
        0x10: _0x3e3222(0x55),
        0x11: _0x3e3222(0x27),
        0x12: _0x3e3222(0x1b5),
        0x13: '&#41754;',
        0x14: _0x3e3222(0x302),
        0x15: _0x3e3222(0x1ed),
        0x16: _0x3e3222(0x455),
        0x17: _0x3e3222(0x319),
        0x18: _0x3e3222(0x382),
        0x19: _0x3e3222(0x484),
        0x1a: _0x3e3222(0x39e),
        0x1b: _0x3e3222(0x2e7),
        0x1c: _0x3e3222(0x49c),
        0x1d: _0x3e3222(0x13),
        0x1e: _0x3e3222(0x2db),
        0x1f: '&#41532;',
        0x20: _0x3e3222(0x12a),
        0x21: _0x3e3222(0x417),
        0x22: '&#41833;',
        0x23: _0x3e3222(0x432),
        0x24: _0x3e3222(0x3e4),
        0x25: _0x3e3222(0xbd),
        0x26: _0x3e3222(0x2c1),
        0x27: _0x3e3222(0xa3),
        0x28: _0x3e3222(0x321),
        0x29: _0x3e3222(0x2ce),
        0x2a: _0x3e3222(0x55),
        0x2b: _0x3e3222(0x27),
        0x2c: _0x3e3222(0x1b5),
        0x2d: _0x3e3222(0x2c4),
        0x2e: '&#41686;',
        0x2f: _0x3e3222(0x1ed),
        0x30: _0x3e3222(0x455),
        0x31: _0x3e3222(0x319),
        0x32: _0x3e3222(0x382),
        0x33: _0x3e3222(0x484),
        0x34: _0x3e3222(0x39e),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's17': {
        0x1: _0x3e3222(0x264),
        0x2: _0x3e3222(0x73),
        0x3: _0x3e3222(0x25f),
        0x4: _0x3e3222(0x246),
        0x5: _0x3e3222(0x12e),
        0x6: _0x3e3222(0x3cb),
        0x7: _0x3e3222(0x3d8),
        0x8: '&#615;',
        0x9: _0x3e3222(0x276),
        0xa: _0x3e3222(0x269),
        0xb: '&#409;',
        0xc: _0x3e3222(0x10c),
        0xd: _0x3e3222(0x199),
        0xe: _0x3e3222(0x10e),
        0xf: _0x3e3222(0x445),
        0x10: _0x3e3222(0x3e),
        0x11: _0x3e3222(0x36e),
        0x12: '&#1360;',
        0x13: '&#1359;',
        0x14: _0x3e3222(0x66),
        0x15: _0x3e3222(0x11),
        0x16: '&#1506;',
        0x17: _0x3e3222(0x4cd),
        0x18: _0x3e3222(0x2d1),
        0x19: '&#1358;',
        0x1a: _0x3e3222(0x31a),
        0x1b: _0x3e3222(0x264),
        0x1c: '&#1349;',
        0x1d: '&#1351;',
        0x1e: '&#1338;',
        0x1f: '&#541;',
        0x20: _0x3e3222(0x3cb),
        0x21: _0x3e3222(0x3d8),
        0x22: '&#615;',
        0x23: _0x3e3222(0x276),
        0x24: '&#669;',
        0x25: _0x3e3222(0x42),
        0x26: _0x3e3222(0x10c),
        0x27: _0x3e3222(0x199),
        0x28: _0x3e3222(0x10e),
        0x29: _0x3e3222(0x445),
        0x2a: _0x3e3222(0x3e),
        0x2b: _0x3e3222(0x36e),
        0x2c: _0x3e3222(0x43f),
        0x2d: _0x3e3222(0x45),
        0x2e: _0x3e3222(0x66),
        0x2f: '&#1348;',
        0x30: _0x3e3222(0x131),
        0x31: '&#1377;',
        0x32: '&#1347;',
        0x33: '&#1358;',
        0x34: _0x3e3222(0x31a),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's18': {
        0x1: _0x3e3222(0x510),
        0x2: '&szlig;',
        0x3: '&sigmaf;',
        0x4: 'd',
        0x5: _0x3e3222(0x51f),
        0x6: _0x3e3222(0x1e3),
        0x7: 'g',
        0x8: 'h',
        0x9: '&iuml;',
        0xa: _0x3e3222(0x471),
        0xb: '&kappa;',
        0xc: _0x3e3222(0x3db),
        0xd: 'm',
        0xe: _0x3e3222(0x22f),
        0xf: _0x3e3222(0x143),
        0x10: 'p',
        0x11: _0x3e3222(0x441),
        0x12: 'r',
        0x13: '&scaron;',
        0x14: _0x3e3222(0xd2),
        0x15: 'u',
        0x16: _0x3e3222(0x63),
        0x17: _0x3e3222(0x154),
        0x18: 'x',
        0x19: _0x3e3222(0x7a),
        0x1a: 'z',
        0x1b: '&alpha;',
        0x1c: _0x3e3222(0x377),
        0x1d: '&sigmaf;',
        0x1e: 'd',
        0x1f: _0x3e3222(0x51f),
        0x20: '&fnof;',
        0x21: 'g',
        0x22: 'h',
        0x23: _0x3e3222(0x407),
        0x24: _0x3e3222(0x471),
        0x25: _0x3e3222(0x4c2),
        0x26: _0x3e3222(0x3db),
        0x27: 'm',
        0x28: _0x3e3222(0x22f),
        0x29: _0x3e3222(0x143),
        0x2a: 'p',
        0x2b: _0x3e3222(0x441),
        0x2c: 'r',
        0x2d: '&scaron;',
        0x2e: '&dagger;',
        0x2f: 'u',
        0x30: _0x3e3222(0x63),
        0x31: _0x3e3222(0x154),
        0x32: 'x',
        0x33: _0x3e3222(0x7a),
        0x34: 'z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's19': {
        0x1: _0x3e3222(0x4fa),
        0x2: '&#4330;',
        0x3: _0x3e3222(0x33e),
        0x4: _0x3e3222(0x50c),
        0x5: _0x3e3222(0x1b8),
        0x6: _0x3e3222(0x3cb),
        0x7: '&#2797;',
        0x8: _0x3e3222(0x18e),
        0x9: _0x3e3222(0x276),
        0xa: '&#646;',
        0xb: _0x3e3222(0x1e5),
        0xc: '&#1350;',
        0xd: _0x3e3222(0x414),
        0xe: _0x3e3222(0x19),
        0xf: _0x3e3222(0x108),
        0x10: _0x3e3222(0x491),
        0x11: _0x3e3222(0x188),
        0x12: '&#1360;',
        0x13: '&sigmaf;',
        0x14: _0x3e3222(0xac),
        0x15: _0x3e3222(0xe5),
        0x16: '&#3182;',
        0x17: '&omega;',
        0x18: _0x3e3222(0x147),
        0x19: '&#1506;',
        0x1a: _0x3e3222(0x43),
        0x1b: '&#3588;',
        0x1c: _0x3e3222(0x175),
        0x1d: '&#2414;',
        0x1e: _0x3e3222(0x50c),
        0x1f: _0x3e3222(0x1b8),
        0x20: '&#1330;',
        0x21: _0x3e3222(0x44a),
        0x22: _0x3e3222(0x18e),
        0x23: '&#639;',
        0x24: _0x3e3222(0xeb),
        0x25: _0x3e3222(0x1e5),
        0x26: '&#1350;',
        0x27: '&#625;',
        0x28: _0x3e3222(0x19),
        0x29: _0x3e3222(0x108),
        0x2a: '&#447;',
        0x2b: _0x3e3222(0x188),
        0x2c: _0x3e3222(0x43f),
        0x2d: _0x3e3222(0x195),
        0x2e: _0x3e3222(0xac),
        0x2f: _0x3e3222(0xe5),
        0x30: _0x3e3222(0x315),
        0x31: _0x3e3222(0x154),
        0x32: _0x3e3222(0x147),
        0x33: _0x3e3222(0x131),
        0x34: _0x3e3222(0x43),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's20': {
        0x1: '&#1072;',
        0x2: _0x3e3222(0x2b4),
        0x3: 'c',
        0x4: _0x3e3222(0x300),
        0x5: '&#1105;',
        0x6: 'f',
        0x7: 'g',
        0x8: _0x3e3222(0x529),
        0x9: _0x3e3222(0x2fb),
        0xa: 'j',
        0xb: '&#1082;',
        0xc: _0x3e3222(0x3e1),
        0xd: _0x3e3222(0x187),
        0xe: _0x3e3222(0x343),
        0xf: _0x3e3222(0x84),
        0x10: 'p',
        0x11: _0x3e3222(0x262),
        0x12: '&#1103;',
        0x13: '$',
        0x14: _0x3e3222(0x4b4),
        0x15: '&#1094;',
        0x16: _0x3e3222(0x233),
        0x17: _0x3e3222(0x214),
        0x18: '&#1078;',
        0x19: _0x3e3222(0xfa),
        0x1a: '&#1079;',
        0x1b: '&#1040;',
        0x1c: _0x3e3222(0x421),
        0x1d: 'C',
        0x1e: _0x3e3222(0x391),
        0x1f: _0x3e3222(0x1b3),
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: _0x3e3222(0x21),
        0x24: 'J',
        0x25: _0x3e3222(0x29a),
        0x26: _0x3e3222(0x485),
        0x27: '&#1130;',
        0x28: '&#1049;',
        0x29: _0x3e3222(0x1a7),
        0x2a: 'P',
        0x2b: '&#1060;',
        0x2c: '&#1071;',
        0x2d: '$',
        0x2e: 'T',
        0x2f: '&#1062;',
        0x30: _0x3e3222(0x4c8),
        0x31: _0x3e3222(0x10a),
        0x32: _0x3e3222(0xf1),
        0x33: _0x3e3222(0x1cc),
        0x34: _0x3e3222(0xb3),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's21': {
        0x1: _0x3e3222(0x2ad),
        0x2: 'b&#830;',
        0x3: _0x3e3222(0x399),
        0x4: _0x3e3222(0xa2),
        0x5: _0x3e3222(0xce),
        0x6: _0x3e3222(0x49a),
        0x7: _0x3e3222(0x232),
        0x8: _0x3e3222(0x3cf),
        0x9: _0x3e3222(0x61),
        0xa: _0x3e3222(0x1b0),
        0xb: _0x3e3222(0x241),
        0xc: _0x3e3222(0x4a1),
        0xd: _0x3e3222(0x47b),
        0xe: 'n&#830;',
        0xf: _0x3e3222(0x461),
        0x10: 'p&#830;',
        0x11: _0x3e3222(0x3b5),
        0x12: 'r&#830;',
        0x13: _0x3e3222(0x308),
        0x14: 't&#830;',
        0x15: 'u&#830;',
        0x16: _0x3e3222(0x1d4),
        0x17: _0x3e3222(0x4b9),
        0x18: _0x3e3222(0x23),
        0x19: 'y&#830;',
        0x1a: 'z&#830;',
        0x1b: _0x3e3222(0x275),
        0x1c: _0x3e3222(0x351),
        0x1d: _0x3e3222(0x3f5),
        0x1e: _0x3e3222(0x6a),
        0x1f: 'E&#830;',
        0x20: _0x3e3222(0x12c),
        0x21: 'G&#830;',
        0x22: 'H&#830;',
        0x23: _0x3e3222(0x1c7),
        0x24: _0x3e3222(0xb0),
        0x25: _0x3e3222(0x460),
        0x26: _0x3e3222(0x31),
        0x27: 'M&#830;',
        0x28: 'N&#830;',
        0x29: 'O&#830;',
        0x2a: 'P&#830;',
        0x2b: 'Q&#830;',
        0x2c: _0x3e3222(0x492),
        0x2d: _0x3e3222(0xd0),
        0x2e: 'T&#830;',
        0x2f: _0x3e3222(0x304),
        0x30: _0x3e3222(0x37a),
        0x31: _0x3e3222(0x3d7),
        0x32: _0x3e3222(0x4d5),
        0x33: 'Y&#830;',
        0x34: _0x3e3222(0xe7),
        0x35: '1&#830;',
        0x36: _0x3e3222(0xdc),
        0x37: _0x3e3222(0x355),
        0x38: _0x3e3222(0x186),
        0x39: _0x3e3222(0x161),
        0x3a: '6&#830;',
        0x3b: _0x3e3222(0x504),
        0x3c: _0x3e3222(0x28b),
        0x3d: _0x3e3222(0x263),
        0x3e: '0&#830;'
    },
    's22': {
        0x1: _0x3e3222(0x35),
        0x2: _0x3e3222(0x309),
        0x3: _0x3e3222(0x14a),
        0x4: _0x3e3222(0x3de),
        0x5: _0x3e3222(0x333),
        0x6: _0x3e3222(0x24d),
        0x7: _0x3e3222(0x51a),
        0x8: _0x3e3222(0x282),
        0x9: 'i&#838;',
        0xa: _0x3e3222(0x522),
        0xb: _0x3e3222(0x29f),
        0xc: _0x3e3222(0xdd),
        0xd: _0x3e3222(0x20),
        0xe: _0x3e3222(0x4c3),
        0xf: 'o&#838;',
        0x10: _0x3e3222(0xad),
        0x11: _0x3e3222(0x238),
        0x12: _0x3e3222(0x418),
        0x13: _0x3e3222(0x294),
        0x14: _0x3e3222(0x235),
        0x15: 'u&#838;',
        0x16: _0x3e3222(0x489),
        0x17: _0x3e3222(0x28d),
        0x18: _0x3e3222(0x34e),
        0x19: _0x3e3222(0x91),
        0x1a: _0x3e3222(0x30),
        0x1b: _0x3e3222(0x257),
        0x1c: _0x3e3222(0xc0),
        0x1d: _0x3e3222(0x4),
        0x1e: _0x3e3222(0x85),
        0x1f: 'E&#838;',
        0x20: _0x3e3222(0x35e),
        0x21: _0x3e3222(0x24b),
        0x22: _0x3e3222(0x1b6),
        0x23: _0x3e3222(0x133),
        0x24: _0x3e3222(0x183),
        0x25: 'K&#838;',
        0x26: _0x3e3222(0x426),
        0x27: _0x3e3222(0x23f),
        0x28: _0x3e3222(0x77),
        0x29: _0x3e3222(0x2e5),
        0x2a: _0x3e3222(0x431),
        0x2b: _0x3e3222(0x92),
        0x2c: 'R&#838;',
        0x2d: _0x3e3222(0x4e1),
        0x2e: _0x3e3222(0xfc),
        0x2f: _0x3e3222(0x4ba),
        0x30: _0x3e3222(0x20b),
        0x31: _0x3e3222(0x179),
        0x32: _0x3e3222(0x18f),
        0x33: _0x3e3222(0x293),
        0x34: 'Z&#838;',
        0x35: _0x3e3222(0x449),
        0x36: _0x3e3222(0x521),
        0x37: _0x3e3222(0x3c8),
        0x38: _0x3e3222(0x47e),
        0x39: _0x3e3222(0x15c),
        0x3a: _0x3e3222(0x4ae),
        0x3b: _0x3e3222(0x17d),
        0x3c: _0x3e3222(0x50),
        0x3d: _0x3e3222(0x1d7),
        0x3e: _0x3e3222(0xb)
    },
    's23': {
        0x1: _0x3e3222(0xe3),
        0x2: _0x3e3222(0x184),
        0x3: _0x3e3222(0x1d6),
        0x4: 'd&#826;',
        0x5: _0x3e3222(0x298),
        0x6: _0x3e3222(0x240),
        0x7: _0x3e3222(0x50f),
        0x8: _0x3e3222(0x5d),
        0x9: _0x3e3222(0x2ff),
        0xa: _0x3e3222(0x3eb),
        0xb: _0x3e3222(0x72),
        0xc: _0x3e3222(0x168),
        0xd: 'm&#826;',
        0xe: _0x3e3222(0x4bd),
        0xf: _0x3e3222(0xd4),
        0x10: _0x3e3222(0x171),
        0x11: _0x3e3222(0x40a),
        0x12: 'r&#826;',
        0x13: _0x3e3222(0x1e6),
        0x14: _0x3e3222(0x41a),
        0x15: _0x3e3222(0xf7),
        0x16: _0x3e3222(0x32),
        0x17: _0x3e3222(0x34),
        0x18: _0x3e3222(0x2a4),
        0x19: 'y&#826;',
        0x1a: _0x3e3222(0x8b),
        0x1b: _0x3e3222(0x119),
        0x1c: _0x3e3222(0x9c),
        0x1d: _0x3e3222(0x4a5),
        0x1e: _0x3e3222(0x15a),
        0x1f: _0x3e3222(0x13a),
        0x20: _0x3e3222(0x274),
        0x21: 'G&#826;',
        0x22: _0x3e3222(0x120),
        0x23: _0x3e3222(0x44d),
        0x24: 'J&#826;',
        0x25: 'K&#826;',
        0x26: 'L&#826;',
        0x27: 'M&#826;',
        0x28: 'N&#826;',
        0x29: _0x3e3222(0x2c),
        0x2a: _0x3e3222(0x29e),
        0x2b: _0x3e3222(0x11b),
        0x2c: _0x3e3222(0x2bc),
        0x2d: _0x3e3222(0x488),
        0x2e: _0x3e3222(0x3ee),
        0x2f: _0x3e3222(0x14e),
        0x30: _0x3e3222(0x100),
        0x31: _0x3e3222(0x10),
        0x32: _0x3e3222(0x123),
        0x33: _0x3e3222(0x7c),
        0x34: 'Z&#826;',
        0x35: _0x3e3222(0x361),
        0x36: _0x3e3222(0x37c),
        0x37: _0x3e3222(0x413),
        0x38: _0x3e3222(0x429),
        0x39: _0x3e3222(0x197),
        0x3a: _0x3e3222(0x338),
        0x3b: _0x3e3222(0x40b),
        0x3c: _0x3e3222(0x517),
        0x3d: '9&#826;',
        0x3e: _0x3e3222(0x4ff)
    },
    's24': {
        0x1: 'a&#857;',
        0x2: _0x3e3222(0x3f4),
        0x3: _0x3e3222(0xf0),
        0x4: _0x3e3222(0x47),
        0x5: 'e&#857;',
        0x6: 'f&#857;',
        0x7: _0x3e3222(0x162),
        0x8: _0x3e3222(0x1b),
        0x9: _0x3e3222(0xaa),
        0xa: _0x3e3222(0x4ec),
        0xb: _0x3e3222(0x3bf),
        0xc: 'l&#857;',
        0xd: _0x3e3222(0x332),
        0xe: _0x3e3222(0x448),
        0xf: 'o&#857;',
        0x10: _0x3e3222(0xee),
        0x11: _0x3e3222(0x3be),
        0x12: _0x3e3222(0x107),
        0x13: _0x3e3222(0x29b),
        0x14: _0x3e3222(0x4dc),
        0x15: _0x3e3222(0x7f),
        0x16: _0x3e3222(0x1a5),
        0x17: 'w&#857;',
        0x18: _0x3e3222(0x2de),
        0x19: _0x3e3222(0xec),
        0x1a: _0x3e3222(0x2e4),
        0x1b: 'A&#857;',
        0x1c: 'B&#857;',
        0x1d: _0x3e3222(0x3bb),
        0x1e: _0x3e3222(0x5f),
        0x1f: _0x3e3222(0x317),
        0x20: 'F&#857;',
        0x21: _0x3e3222(0x4c9),
        0x22: _0x3e3222(0x3ae),
        0x23: _0x3e3222(0x4c5),
        0x24: _0x3e3222(0x57),
        0x25: _0x3e3222(0x167),
        0x26: _0x3e3222(0x3aa),
        0x27: _0x3e3222(0x15d),
        0x28: _0x3e3222(0x253),
        0x29: _0x3e3222(0x1b9),
        0x2a: _0x3e3222(0x526),
        0x2b: _0x3e3222(0x2a3),
        0x2c: 'R&#857;',
        0x2d: _0x3e3222(0x4ad),
        0x2e: _0x3e3222(0x9a),
        0x2f: 'U&#857;',
        0x30: _0x3e3222(0x4e0),
        0x31: _0x3e3222(0x3ea),
        0x32: _0x3e3222(0xd7),
        0x33: _0x3e3222(0x496),
        0x34: _0x3e3222(0x4f7),
        0x35: _0x3e3222(0x4c6),
        0x36: '2&#857;',
        0x37: _0x3e3222(0x36),
        0x38: _0x3e3222(0x37),
        0x39: _0x3e3222(0x152),
        0x3a: _0x3e3222(0x311),
        0x3b: '7&#857;',
        0x3c: '8&#857;',
        0x3d: _0x3e3222(0x512),
        0x3e: '0&#857;'
    },
    's25': {
        0x1: _0x3e3222(0x2ae),
        0x2: _0x3e3222(0x381),
        0x3: _0x3e3222(0x177),
        0x4: 'd&#799;',
        0x5: _0x3e3222(0x1fb),
        0x6: _0x3e3222(0x261),
        0x7: 'g&#799;',
        0x8: _0x3e3222(0x4b6),
        0x9: _0x3e3222(0x41b),
        0xa: 'j&#799;',
        0xb: _0x3e3222(0x2be),
        0xc: _0x3e3222(0x442),
        0xd: _0x3e3222(0x433),
        0xe: _0x3e3222(0x2d6),
        0xf: _0x3e3222(0x3a5),
        0x10: _0x3e3222(0x54),
        0x11: 'q&#799;',
        0x12: _0x3e3222(0x74),
        0x13: _0x3e3222(0x1df),
        0x14: _0x3e3222(0x365),
        0x15: _0x3e3222(0x4cf),
        0x16: 'v&#799;',
        0x17: _0x3e3222(0x78),
        0x18: _0x3e3222(0x392),
        0x19: _0x3e3222(0x32e),
        0x1a: 'z&#799;',
        0x1b: _0x3e3222(0x296),
        0x1c: 'B&#799;',
        0x1d: 'C&#799;',
        0x1e: _0x3e3222(0x203),
        0x1f: _0x3e3222(0x81),
        0x20: _0x3e3222(0xc1),
        0x21: 'G&#799;',
        0x22: 'H&#799;',
        0x23: _0x3e3222(0x19e),
        0x24: _0x3e3222(0x509),
        0x25: _0x3e3222(0x43a),
        0x26: _0x3e3222(0x2a1),
        0x27: _0x3e3222(0x20e),
        0x28: _0x3e3222(0x419),
        0x29: _0x3e3222(0x2e1),
        0x2a: _0x3e3222(0x48f),
        0x2b: _0x3e3222(0x516),
        0x2c: _0x3e3222(0x44e),
        0x2d: 'S&#799;',
        0x2e: _0x3e3222(0xea),
        0x2f: _0x3e3222(0x48b),
        0x30: _0x3e3222(0x4ab),
        0x31: _0x3e3222(0x39d),
        0x32: _0x3e3222(0x2c2),
        0x33: _0x3e3222(0x1af),
        0x34: _0x3e3222(0x4a4),
        0x35: _0x3e3222(0x164),
        0x36: _0x3e3222(0xa5),
        0x37: _0x3e3222(0x369),
        0x38: _0x3e3222(0x16b),
        0x39: _0x3e3222(0x410),
        0x3a: _0x3e3222(0x221),
        0x3b: '7&#799;',
        0x3c: _0x3e3222(0x2b8),
        0x3d: _0x3e3222(0x35d),
        0x3e: '0&#799;'
    },
    's26': {
        0x1: _0x3e3222(0x3e8),
        0x2: _0x3e3222(0x3ad),
        0x3: _0x3e3222(0x1e9),
        0x4: _0x3e3222(0x519),
        0x5: 'e&#846;',
        0x6: 'f&#846;',
        0x7: _0x3e3222(0x31f),
        0x8: _0x3e3222(0x140),
        0x9: _0x3e3222(0xd6),
        0xa: 'j&#846;',
        0xb: 'k&#846;',
        0xc: _0x3e3222(0x1dc),
        0xd: 'm&#846;',
        0xe: _0x3e3222(0x113),
        0xf: 'o&#846;',
        0x10: _0x3e3222(0x502),
        0x11: _0x3e3222(0x7e),
        0x12: _0x3e3222(0x1c9),
        0x13: _0x3e3222(0x25d),
        0x14: _0x3e3222(0xd3),
        0x15: 'u&#846;',
        0x16: _0x3e3222(0x1dd),
        0x17: 'w&#846;',
        0x18: _0x3e3222(0x1d5),
        0x19: _0x3e3222(0x3d1),
        0x1a: _0x3e3222(0x3c0),
        0x1b: 'A&#846;',
        0x1c: 'B&#846;',
        0x1d: _0x3e3222(0x223),
        0x1e: _0x3e3222(0x422),
        0x1f: 'E&#846;',
        0x20: _0x3e3222(0x476),
        0x21: 'G&#846;',
        0x22: 'H&#846;',
        0x23: _0x3e3222(0x295),
        0x24: _0x3e3222(0x453),
        0x25: _0x3e3222(0x6f),
        0x26: _0x3e3222(0x88),
        0x27: _0x3e3222(0x2f1),
        0x28: _0x3e3222(0x50e),
        0x29: _0x3e3222(0x13b),
        0x2a: _0x3e3222(0x2a7),
        0x2b: _0x3e3222(0x4e5),
        0x2c: _0x3e3222(0x325),
        0x2d: _0x3e3222(0x190),
        0x2e: _0x3e3222(0x3b),
        0x2f: 'U&#846;',
        0x30: _0x3e3222(0x424),
        0x31: _0x3e3222(0x2c5),
        0x32: _0x3e3222(0x3c3),
        0x33: _0x3e3222(0x357),
        0x34: 'Z&#846;',
        0x35: _0x3e3222(0x16c),
        0x36: _0x3e3222(0xab),
        0x37: _0x3e3222(0x18b),
        0x38: _0x3e3222(0x1),
        0x39: _0x3e3222(0x106),
        0x3a: '6&#846;',
        0x3b: _0x3e3222(0x116),
        0x3c: _0x3e3222(0x30d),
        0x3d: _0x3e3222(0x337),
        0x3e: '0&#846;'
    },
    's27': {
        0x1: _0x3e3222(0x3b9),
        0x2: _0x3e3222(0x181),
        0x3: _0x3e3222(0x11a),
        0x4: _0x3e3222(0x65),
        0x5: _0x3e3222(0xa9),
        0x6: _0x3e3222(0x172),
        0x7: _0x3e3222(0x2f4),
        0x8: _0x3e3222(0x13e),
        0x9: _0x3e3222(0x2c8),
        0xa: _0x3e3222(0x47d),
        0xb: 'k&#829;&#851;',
        0xc: _0x3e3222(0x12f),
        0xd: _0x3e3222(0x2b6),
        0xe: _0x3e3222(0x18d),
        0xf: _0x3e3222(0xe0),
        0x10: 'p&#829;&#851;',
        0x11: _0x3e3222(0x14f),
        0x12: _0x3e3222(0x1e1),
        0x13: _0x3e3222(0x30b),
        0x14: 't&#829;&#851;',
        0x15: _0x3e3222(0x30e),
        0x16: 'v&#829;&#851;',
        0x17: _0x3e3222(0xd9),
        0x18: _0x3e3222(0x45e),
        0x19: 'y&#829;&#851;',
        0x1a: _0x3e3222(0x286),
        0x1b: _0x3e3222(0x4c4),
        0x1c: 'B&#829;&#851;',
        0x1d: _0x3e3222(0x129),
        0x1e: _0x3e3222(0x364),
        0x1f: 'E&#829;&#851;',
        0x20: 'F&#829;&#851;',
        0x21: _0x3e3222(0xcb),
        0x22: _0x3e3222(0xc6),
        0x23: _0x3e3222(0xfe),
        0x24: _0x3e3222(0x459),
        0x25: _0x3e3222(0x22),
        0x26: _0x3e3222(0x137),
        0x27: _0x3e3222(0x24e),
        0x28: _0x3e3222(0x38e),
        0x29: _0x3e3222(0x17b),
        0x2a: 'P&#829;&#851;',
        0x2b: _0x3e3222(0x344),
        0x2c: _0x3e3222(0x27d),
        0x2d: _0x3e3222(0x174),
        0x2e: _0x3e3222(0x324),
        0x2f: _0x3e3222(0x4d7),
        0x30: 'V&#829;&#851;',
        0x31: _0x3e3222(0x393),
        0x32: _0x3e3222(0x329),
        0x33: _0x3e3222(0x60),
        0x34: _0x3e3222(0x2cb),
        0x35: '1&#829;&#851;',
        0x36: _0x3e3222(0x40e),
        0x37: _0x3e3222(0x4b0),
        0x38: '4&#829;&#851;',
        0x39: _0x3e3222(0x30a),
        0x3a: '6&#829;&#851;',
        0x3b: _0x3e3222(0x49b),
        0x3c: _0x3e3222(0xef),
        0x3d: _0x3e3222(0x277),
        0x3e: _0x3e3222(0x196)
    },
    's29': {
        0x1: '&#120458;&#823;',
        0x2: '&#120459;&#823;',
        0x3: '&#120460;&#823;',
        0x4: _0x3e3222(0x265),
        0x5: '&#120462;&#823;',
        0x6: _0x3e3222(0x270),
        0x7: _0x3e3222(0x176),
        0x8: _0x3e3222(0xb5),
        0x9: _0x3e3222(0x4b7),
        0xa: _0x3e3222(0x23b),
        0xb: _0x3e3222(0x24f),
        0xc: _0x3e3222(0x1ac),
        0xd: _0x3e3222(0x15f),
        0xe: _0x3e3222(0x114),
        0xf: _0x3e3222(0x160),
        0x10: _0x3e3222(0x425),
        0x11: '&#120474;&#823;',
        0x12: '&#120475;&#823;',
        0x13: '&#120476;&#823;',
        0x14: _0x3e3222(0xb4),
        0x15: _0x3e3222(0x31c),
        0x16: _0x3e3222(0x1c5),
        0x17: _0x3e3222(0x250),
        0x18: _0x3e3222(0x43b),
        0x19: '&#120482;&#823;',
        0x1a: '&#120483;&#823;',
        0x1b: _0x3e3222(0x1a3),
        0x1c: _0x3e3222(0x33f),
        0x1d: '&#120434;&#823;',
        0x1e: _0x3e3222(0x272),
        0x1f: _0x3e3222(0x231),
        0x20: _0x3e3222(0x1a1),
        0x21: _0x3e3222(0x2f8),
        0x22: _0x3e3222(0x3a7),
        0x23: _0x3e3222(0x25e),
        0x24: _0x3e3222(0x8d),
        0x25: _0x3e3222(0x122),
        0x26: _0x3e3222(0x513),
        0x27: _0x3e3222(0xba),
        0x28: _0x3e3222(0x44),
        0x29: _0x3e3222(0xca),
        0x2a: _0x3e3222(0x494),
        0x2b: '&#120448;&#823;',
        0x2c: '&#120449;&#823;',
        0x2d: '&#120450;&#823;',
        0x2e: _0x3e3222(0x247),
        0x2f: _0x3e3222(0x3d5),
        0x30: _0x3e3222(0x36d),
        0x31: _0x3e3222(0x50b),
        0x32: _0x3e3222(0x479),
        0x33: _0x3e3222(0x2f9),
        0x34: '&#120457;&#823;',
        0x35: _0x3e3222(0x26e),
        0x36: '&#120824;&#823;',
        0x37: _0x3e3222(0x2e2),
        0x38: '&#120826;&#823;',
        0x39: '&#120827;&#823;',
        0x3a: '&#120828;&#823;',
        0x3b: '&#120829;&#823;',
        0x3c: _0x3e3222(0x16),
        0x3d: '&#120831;&#823;',
        0x3e: _0x3e3222(0x48a)
    },
    's30': {
        0x1: _0x3e3222(0x44b),
        0x2: _0x3e3222(0x21e),
        0x3: _0x3e3222(0x1eb),
        0x4: 'd&#866;',
        0x5: _0x3e3222(0xa4),
        0x6: 'f&#866;',
        0x7: 'g&#866;',
        0x8: _0x3e3222(0x4a7),
        0x9: _0x3e3222(0x3c1),
        0xa: _0x3e3222(0x469),
        0xb: 'k&#866;',
        0xc: _0x3e3222(0xda),
        0xd: _0x3e3222(0x39b),
        0xe: 'n&#866;',
        0xf: 'o&#866;',
        0x10: _0x3e3222(0x3b0),
        0x11: _0x3e3222(0x48d),
        0x12: _0x3e3222(0x206),
        0x13: _0x3e3222(0x1f2),
        0x14: _0x3e3222(0x41d),
        0x15: _0x3e3222(0x2b5),
        0x16: _0x3e3222(0x501),
        0x17: _0x3e3222(0x353),
        0x18: _0x3e3222(0x79),
        0x19: _0x3e3222(0x17e),
        0x1a: _0x3e3222(0x1d3),
        0x1b: _0x3e3222(0x2b1),
        0x1c: _0x3e3222(0x4b),
        0x1d: _0x3e3222(0x39c),
        0x1e: _0x3e3222(0x477),
        0x1f: _0x3e3222(0x239),
        0x20: _0x3e3222(0x36f),
        0x21: 'G&#866;',
        0x22: 'H&#866;',
        0x23: _0x3e3222(0x11c),
        0x24: 'J&#866;',
        0x25: _0x3e3222(0x3a9),
        0x26: 'L&#866;',
        0x27: _0x3e3222(0x505),
        0x28: 'N&#866;',
        0x29: 'O&#866;',
        0x2a: _0x3e3222(0x1bf),
        0x2b: _0x3e3222(0x368),
        0x2c: _0x3e3222(0x97),
        0x2d: 'S&#866;',
        0x2e: 'T&#866;',
        0x2f: _0x3e3222(0x3dd),
        0x30: _0x3e3222(0x166),
        0x31: _0x3e3222(0x454),
        0x32: _0x3e3222(0x4f4),
        0x33: _0x3e3222(0x52),
        0x34: _0x3e3222(0x366),
        0x35: _0x3e3222(0x1e0),
        0x36: _0x3e3222(0x4d3),
        0x37: _0x3e3222(0x280),
        0x38: _0x3e3222(0x157),
        0x39: _0x3e3222(0x3f0),
        0x3a: '6&#866;',
        0x3b: _0x3e3222(0x1a8),
        0x3c: _0x3e3222(0x169),
        0x3d: _0x3e3222(0x43c),
        0x3e: _0x3e3222(0x520)
    },
    's31': {
        0x1: _0x3e3222(0x4da),
        0x2: _0x3e3222(0x3dc),
        0x3: _0x3e3222(0x10d),
        0x4: 'd&#828;',
        0x5: 'e&#828;',
        0x6: _0x3e3222(0x322),
        0x7: _0x3e3222(0x2cd),
        0x8: _0x3e3222(0x2ac),
        0x9: 'i&#828;',
        0xa: _0x3e3222(0x67),
        0xb: 'k&#828;',
        0xc: _0x3e3222(0x68),
        0xd: _0x3e3222(0x136),
        0xe: _0x3e3222(0x1be),
        0xf: _0x3e3222(0x3e5),
        0x10: _0x3e3222(0x83),
        0x11: _0x3e3222(0x2b7),
        0x12: _0x3e3222(0x416),
        0x13: _0x3e3222(0x50d),
        0x14: _0x3e3222(0x1fe),
        0x15: _0x3e3222(0x415),
        0x16: _0x3e3222(0x1ce),
        0x17: _0x3e3222(0x11e),
        0x18: _0x3e3222(0x2cc),
        0x19: 'y&#828;',
        0x1a: _0x3e3222(0x255),
        0x1b: 'A&#828;',
        0x1c: _0x3e3222(0x27f),
        0x1d: _0x3e3222(0x4e9),
        0x1e: 'D&#828;',
        0x1f: _0x3e3222(0x64),
        0x20: _0x3e3222(0x3e7),
        0x21: _0x3e3222(0x350),
        0x22: _0x3e3222(0x36c),
        0x23: _0x3e3222(0xa1),
        0x24: _0x3e3222(0x46b),
        0x25: _0x3e3222(0x3d0),
        0x26: _0x3e3222(0xa0),
        0x27: _0x3e3222(0x2d4),
        0x28: _0x3e3222(0xfb),
        0x29: _0x3e3222(0x1e8),
        0x2a: _0x3e3222(0x3f1),
        0x2b: 'Q&#828;',
        0x2c: _0x3e3222(0x42b),
        0x2d: _0x3e3222(0x33d),
        0x2e: _0x3e3222(0x4e7),
        0x2f: _0x3e3222(0x138),
        0x30: _0x3e3222(0x1e4),
        0x31: _0x3e3222(0x18a),
        0x32: _0x3e3222(0x1ad),
        0x33: _0x3e3222(0x2bd),
        0x34: _0x3e3222(0x4f5),
        0x35: _0x3e3222(0x19b),
        0x36: _0x3e3222(0x4d1),
        0x37: '3&#828;',
        0x38: _0x3e3222(0x2ec),
        0x39: _0x3e3222(0x76),
        0x3a: _0x3e3222(0x497),
        0x3b: _0x3e3222(0x409),
        0x3c: _0x3e3222(0x1c6),
        0x3d: '9&#828;',
        0x3e: '0&#828;'
    }
};

function Change(_0x5593c1, _0x138df7) {
    var _0x5ae5b4 = _0x3e3222,
        _0x4b742a = '',
        _0x5593c1 = _0x5593c1;
    if (_0x5593c1['length'] == 0x0) return;
    for (i = 0x0; i < _0x5593c1['length']; i++) {
        var _0x3c7097 = _0x5593c1[_0x5ae5b4(0x32c)](i),
            _0x43058e = normal[_0x5ae5b4(0x273)](_0x3c7097) + 0x1;
        if (_0x3c7097 == '\x20') _0x4b742a += '\x20';
        else !_0x43058e ? _0x4b742a += _0x3c7097 : _0x4b742a += newtext[_0x138df7][_0x43058e];
    }
    return _0x4b742a;
}
const futureAlienCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑢ',
        'd': 'ᕲ',
        'e': 'ᘿ',
        'f': 'ᖴ',
        'g': 'ᘜ',
        'h': 'ᕼ',
        'i': 'ᓰ',
        'j': 'ᒚ',
        'k': 'ᖽᐸ',
        'l': 'ᒪ',
        'm': 'ᘻ',
        'n': 'ᘉ',
        'o': 'ᓍ',
        'p': 'ᕵ',
        'q': 'ᕴ',
        'r': 'ᖇ',
        's': 'S',
        't': 'ᖶ',
        'u': 'ᑘ',
        'v': 'ᐺ',
        'w': 'ᘺ',
        'x': '᙭',
        'y': 'ᖻ',
        'z': 'ᗱ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑢ',
        'D': 'ᕲ',
        'E': 'ᘿ',
        'F': 'ᖴ',
        'G': 'ᘜ',
        'H': 'ᕼ',
        'I': 'ᓰ',
        'J': 'ᒚ',
        'K': 'ᖽᐸ',
        'L': 'ᒪ',
        'M': 'ᘻ',
        'N': 'ᘉ',
        'O': 'ᓍ',
        'P': 'ᕵ',
        'Q': 'ᕴ',
        'R': 'ᖇ',
        'S': 'S',
        'T': 'ᖶ',
        'U': 'ᑘ',
        'V': 'ᐺ',
        'W': 'ᘺ',
        'X': '᙭',
        'Y': 'ᖻ',
        'Z': 'ᗱ'
    },
    squiggle6CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๖',
        'c': '¢',
        'd': '໓',
        'e': 'ē',
        'f': 'f',
        'g': 'ງ',
        'h': 'h',
        'i': 'i',
        'j': 'ว',
        'k': 'k',
        'l': 'l',
        'm': '๓',
        'n': 'ຖ',
        'o': '໐',
        'p': 'p',
        'q': '๑',
        'r': 'r',
        's': 'Ş',
        't': 't',
        'u': 'น',
        'v': 'ง',
        'w': 'ຟ',
        'x': 'x',
        'y': 'ฯ',
        'z': 'ຊ',
        'A': 'ค',
        'B': '๖',
        'C': '¢',
        'D': '໓',
        'E': 'ē',
        'F': 'f',
        'G': 'ງ',
        'H': 'h',
        'I': 'i',
        'J': 'ว',
        'K': 'k',
        'L': 'l',
        'M': '๓',
        'N': 'ຖ',
        'O': '໐',
        'P': 'p',
        'Q': '๑',
        'R': 'r',
        'S': 'Ş',
        'T': 't',
        'U': 'น',
        'V': 'ง',
        'W': 'ຟ',
        'X': 'x',
        'Y': 'ฯ',
        'Z': 'ຊ'
    },
    squiggle5CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ą',
        'b': 'ც',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɠ',
        'h': 'ɧ',
        'i': 'ı',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'Ɩ',
        'm': 'ɱ',
        'n': 'ŋ',
        'o': 'ơ',
        'p': '℘',
        'q': 'զ',
        'r': 'ཞ',
        's': 'ʂ',
        't': 'ɬ',
        'u': 'ų',
        'v': '۷',
        'w': 'ῳ',
        'x': 'ҳ',
        'y': 'ყ',
        'z': 'ʑ',
        'A': 'ą',
        'B': 'ც',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɠ',
        'H': 'ɧ',
        'I': 'ı',
        'J': 'ʝ',
        'K': 'ƙ',
        'L': 'Ɩ',
        'M': 'ɱ',
        'N': 'ŋ',
        'O': 'ơ',
        'P': '℘',
        'Q': 'զ',
        'R': 'ཞ',
        'S': 'ʂ',
        'T': 'ɬ',
        'U': 'ų',
        'V': '۷',
        'W': 'ῳ',
        'X': 'ҳ',
        'Y': 'ყ',
        'Z': 'ʑ'
    },
    asianStyle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ﾑ',
        'b': '乃',
        'c': 'ᄃ',
        'd': 'り',
        'e': '乇',
        'f': 'ｷ',
        'g': 'ム',
        'h': 'ん',
        'i': 'ﾉ',
        'j': 'ﾌ',
        'k': 'ズ',
        'l': 'ﾚ',
        'm': 'ﾶ',
        'n': '刀',
        'o': 'の',
        'p': 'ｱ',
        'q': 'ゐ',
        'r': '尺',
        's': '丂',
        't': 'ｲ',
        'u': 'ひ',
        'v': '√',
        'w': 'W',
        'x': 'ﾒ',
        'y': 'ﾘ',
        'z': '乙',
        'A': 'ﾑ',
        'B': '乃',
        'C': 'ᄃ',
        'D': 'り',
        'E': '乇',
        'F': 'ｷ',
        'G': 'ム',
        'H': 'ん',
        'I': 'ﾉ',
        'J': 'ﾌ',
        'K': 'ズ',
        'L': 'ﾚ',
        'M': 'ﾶ',
        'N': '刀',
        'O': 'の',
        'P': 'ｱ',
        'Q': 'ゐ',
        'R': '尺',
        'S': '丂',
        'T': 'ｲ',
        'U': 'ひ',
        'V': '√',
        'W': 'W',
        'X': 'ﾒ',
        'Y': 'ﾘ',
        'Z': '乙'
    },
    asianStyleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '卂',
        'b': '乃',
        'c': '匚',
        'd': 'ᗪ',
        'e': '乇',
        'f': '千',
        'g': 'Ꮆ',
        'h': '卄',
        'i': '丨',
        'j': 'ﾌ',
        'k': 'Ҝ',
        'l': 'ㄥ',
        'm': '爪',
        'n': '几',
        'o': 'ㄖ',
        'p': '卩',
        'q': 'Ɋ',
        'r': '尺',
        's': '丂',
        't': 'ㄒ',
        'u': 'ㄩ',
        'v': 'ᐯ',
        'w': '山',
        'x': '乂',
        'y': 'ㄚ',
        'z': '乙',
        'A': '卂',
        'B': '乃',
        'C': '匚',
        'D': 'ᗪ',
        'E': '乇',
        'F': '千',
        'G': 'Ꮆ',
        'H': '卄',
        'I': '丨',
        'J': 'ﾌ',
        'K': 'Ҝ',
        'L': 'ㄥ',
        'M': '爪',
        'N': '几',
        'O': 'ㄖ',
        'P': '卩',
        'Q': 'Ɋ',
        'R': '尺',
        'S': '丂',
        'T': 'ㄒ',
        'U': 'ㄩ',
        'V': 'ᐯ',
        'W': '山',
        'X': '乂',
        'Y': 'ㄚ',
        'Z': '乙'
    },
    squaresCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '🄰',
        'b': '🄱',
        'c': '🄲',
        'd': '🄳',
        'e': '🄴',
        'f': '🄵',
        'g': '🄶',
        'h': '🄷',
        'i': '🄸',
        'j': '🄹',
        'k': '🄺',
        'l': '🄻',
        'm': '🄼',
        'n': '🄽',
        'o': '🄾',
        'p': '🄿',
        'q': '🅀',
        'r': '🅁',
        's': '🅂',
        't': '🅃',
        'u': '🅄',
        'v': '🅅',
        'w': '🅆',
        'x': '🅇',
        'y': '🅈',
        'z': '🅉',
        'A': '🄰',
        'B': '🄱',
        'C': '🄲',
        'D': '🄳',
        'E': '🄴',
        'F': '🄵',
        'G': '🄶',
        'H': '🄷',
        'I': '🄸',
        'J': '🄹',
        'K': '🄺',
        'L': '🄻',
        'M': '🄼',
        'N': '🄽',
        'O': '🄾',
        'P': '🄿',
        'Q': '🅀',
        'R': '🅁',
        'S': '🅂',
        'T': '🅃',
        'U': '🅄',
        'V': '🅅',
        'W': '🅆',
        'X': '🅇',
        'Y': '🅈',
        'Z': '🅉'
    },
    squiggle4CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Ꮧ',
        'b': 'Ᏸ',
        'c': 'ፈ',
        'd': 'Ꮄ',
        'e': 'Ꮛ',
        'f': 'Ꭶ',
        'g': 'Ꮆ',
        'h': 'Ꮒ',
        'i': 'Ꭵ',
        'j': 'Ꮰ',
        'k': 'Ꮶ',
        'l': 'Ꮭ',
        'm': 'Ꮇ',
        'n': 'Ꮑ',
        'o': 'Ꭷ',
        'p': 'Ꭾ',
        'q': 'Ꭴ',
        'r': 'Ꮢ',
        's': 'Ꮥ',
        't': 'Ꮦ',
        'u': 'Ꮼ',
        'v': 'Ꮙ',
        'w': 'Ꮗ',
        'x': 'ጀ',
        'y': 'Ꭹ',
        'z': 'ፚ',
        'A': 'Ꮧ',
        'B': 'Ᏸ',
        'C': 'ፈ',
        'D': 'Ꮄ',
        'E': 'Ꮛ',
        'F': 'Ꭶ',
        'G': 'Ꮆ',
        'H': 'Ꮒ',
        'I': 'Ꭵ',
        'J': 'Ꮰ',
        'K': 'Ꮶ',
        'L': 'Ꮭ',
        'M': 'Ꮇ',
        'N': 'Ꮑ',
        'O': 'Ꭷ',
        'P': 'Ꭾ',
        'Q': 'Ꭴ',
        'R': 'Ꮢ',
        'S': 'Ꮥ',
        'T': 'Ꮦ',
        'U': 'Ꮼ',
        'V': 'Ꮙ',
        'W': 'Ꮗ',
        'X': 'ጀ',
        'Y': 'Ꭹ',
        'Z': 'ፚ'
    },
    neonCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑕ',
        'd': 'ᗪ',
        'e': 'E',
        'f': 'ᖴ',
        'g': 'G',
        'h': 'ᕼ',
        'i': 'I',
        'j': 'ᒍ',
        'k': 'K',
        'l': 'ᒪ',
        'm': 'ᗰ',
        'n': 'ᑎ',
        'o': 'O',
        'p': 'ᑭ',
        'q': 'ᑫ',
        'r': 'ᖇ',
        's': 'ᔕ',
        't': 'T',
        'u': 'ᑌ',
        'v': 'ᐯ',
        'w': 'ᗯ',
        'x': '᙭',
        'y': 'Y',
        'z': 'ᘔ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑕ',
        'D': 'ᗪ',
        'E': 'E',
        'F': 'ᖴ',
        'G': 'G',
        'H': 'ᕼ',
        'I': 'I',
        'J': 'ᒍ',
        'K': 'K',
        'L': 'ᒪ',
        'M': 'ᗰ',
        'N': 'ᑎ',
        'O': 'O',
        'P': 'ᑭ',
        'Q': 'ᑫ',
        'R': 'ᖇ',
        'S': 'ᔕ',
        'T': 'T',
        'U': 'ᑌ',
        'V': 'ᐯ',
        'W': 'ᗯ',
        'X': '᙭',
        'Y': 'Y',
        'Z': 'ᘔ'
    },
    squiggle3CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ǟ',
        'b': 'ɮ',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɢ',
        'h': 'ɦ',
        'i': 'ɨ',
        'j': 'ʝ',
        'k': 'ӄ',
        'l': 'ʟ',
        'm': 'ʍ',
        'n': 'ռ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ʀ',
        's': 'ֆ',
        't': 'ȶ',
        'u': 'ʊ',
        'v': 'ʋ',
        'w': 'ա',
        'x': 'Ӽ',
        'y': 'ʏ',
        'z': 'ʐ',
        'A': 'ǟ',
        'B': 'ɮ',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɢ',
        'H': 'ɦ',
        'I': 'ɨ',
        'J': 'ʝ',
        'K': 'ӄ',
        'L': 'ʟ',
        'M': 'ʍ',
        'N': 'ռ',
        'O': 'օ',
        'P': 'ք',
        'Q': 'զ',
        'R': 'ʀ',
        'S': 'ֆ',
        'T': 'ȶ',
        'U': 'ʊ',
        'V': 'ʋ',
        'W': 'ա',
        'X': 'Ӽ',
        'Y': 'ʏ',
        'Z': 'ʐ'
    },
    monospaceCharMap = {
        0x0: '𝟶',
        0x1: '𝟷',
        0x2: '𝟸',
        0x3: '𝟹',
        0x4: '𝟺',
        0x5: '𝟻',
        0x6: '𝟼',
        0x7: '𝟽',
        0x8: '𝟾',
        0x9: '𝟿',
        'a': '𝚊',
        'b': '𝚋',
        'c': '𝚌',
        'd': '𝚍',
        'e': '𝚎',
        'f': '𝚏',
        'g': '𝚐',
        'h': '𝚑',
        'i': '𝚒',
        'j': '𝚓',
        'k': '𝚔',
        'l': '𝚕',
        'm': '𝚖',
        'n': '𝚗',
        'o': '𝚘',
        'p': '𝚙',
        'q': '𝚚',
        'r': '𝚛',
        's': '𝚜',
        't': '𝚝',
        'u': '𝚞',
        'v': '𝚟',
        'w': '𝚠',
        'x': '𝚡',
        'y': '𝚢',
        'z': '𝚣',
        'A': '𝙰',
        'B': '𝙱',
        'C': '𝙲',
        'D': '𝙳',
        'E': '𝙴',
        'F': '𝙵',
        'G': '𝙶',
        'H': '𝙷',
        'I': '𝙸',
        'J': '𝙹',
        'K': '𝙺',
        'L': '𝙻',
        'M': '𝙼',
        'N': '𝙽',
        'O': '𝙾',
        'P': '𝙿',
        'Q': '𝚀',
        'R': '𝚁',
        'S': '𝚂',
        'T': '𝚃',
        'U': '𝚄',
        'V': '𝚅',
        'W': '𝚆',
        'X': '𝚇',
        'Y': '𝚈',
        'Z': '𝚉'
    },
    boldItalicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝙖',
        'b': '𝙗',
        'c': '𝙘',
        'd': '𝙙',
        'e': '𝙚',
        'f': '𝙛',
        'g': '𝙜',
        'h': '𝙝',
        'i': '𝙞',
        'j': '𝙟',
        'k': '𝙠',
        'l': '𝙡',
        'm': '𝙢',
        'n': '𝙣',
        'o': '𝙤',
        'p': '𝙥',
        'q': '𝙦',
        'r': '𝙧',
        's': '𝙨',
        't': '𝙩',
        'u': '𝙪',
        'v': '𝙫',
        'w': '𝙬',
        'x': '𝙭',
        'y': '𝙮',
        'z': '𝙯',
        'A': '𝘼',
        'B': '𝘽',
        'C': '𝘾',
        'D': '𝘿',
        'E': '𝙀',
        'F': '𝙁',
        'G': '𝙂',
        'H': '𝙃',
        'I': '𝙄',
        'J': '𝙅',
        'K': '𝙆',
        'L': '𝙇',
        'M': '𝙈',
        'N': '𝙉',
        'O': '𝙊',
        'P': '𝙋',
        'Q': '𝙌',
        'R': '𝙍',
        'S': '𝙎',
        'T': '𝙏',
        'U': '𝙐',
        'V': '𝙑',
        'W': '𝙒',
        'X': '𝙓',
        'Y': '𝙔',
        'Z': '𝙕'
    },
    boldCharMap = {
        0x0: '𝟎',
        0x1: '𝟏',
        0x2: '𝟐',
        0x3: '𝟑',
        0x4: '𝟒',
        0x5: '𝟓',
        0x6: '𝟔',
        0x7: '𝟕',
        0x8: '𝟖',
        0x9: '𝟗',
        'a': '𝐚',
        'b': '𝐛',
        'c': '𝐜',
        'd': '𝐝',
        'e': '𝐞',
        'f': '𝐟',
        'g': '𝐠',
        'h': '𝐡',
        'i': '𝐢',
        'j': '𝐣',
        'k': '𝐤',
        'l': '𝐥',
        'm': '𝐦',
        'n': '𝐧',
        'o': '𝐨',
        'p': '𝐩',
        'q': '𝐪',
        'r': '𝐫',
        's': '𝐬',
        't': '𝐭',
        'u': '𝐮',
        'v': '𝐯',
        'w': '𝐰',
        'x': '𝐱',
        'y': '𝐲',
        'z': '𝐳',
        'A': '𝐀',
        'B': '𝐁',
        'C': '𝐂',
        'D': '𝐃',
        'E': '𝐄',
        'F': '𝐅',
        'G': '𝐆',
        'H': '𝐇',
        'I': '𝐈',
        'J': '𝐉',
        'K': '𝐊',
        'L': '𝐋',
        'M': '𝐌',
        'N': '𝐍',
        'O': '𝐎',
        'P': '𝐏',
        'Q': '𝐐',
        'R': '𝐑',
        'S': '𝐒',
        'T': '𝐓',
        'U': '𝐔',
        'V': '𝐕',
        'W': '𝐖',
        'X': '𝐗',
        'Y': '𝐘',
        'Z': '𝐙'
    },
    italicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝘢',
        'b': '𝘣',
        'c': '𝘤',
        'd': '𝘥',
        'e': '𝘦',
        'f': '𝘧',
        'g': '𝘨',
        'h': '𝘩',
        'i': '𝘪',
        'j': '𝘫',
        'k': '𝘬',
        'l': '𝘭',
        'm': '𝘮',
        'n': '𝘯',
        'o': '𝘰',
        'p': '𝘱',
        'q': '𝘲',
        'r': '𝘳',
        's': '𝘴',
        't': '𝘵',
        'u': '𝘶',
        'v': '𝘷',
        'w': '𝘸',
        'x': '𝘹',
        'y': '𝘺',
        'z': '𝘻',
        'A': '𝘈',
        'B': '𝘉',
        'C': '𝘊',
        'D': '𝘋',
        'E': '𝘌',
        'F': '𝘍',
        'G': '𝘎',
        'H': '𝘏',
        'I': '𝘐',
        'J': '𝘑',
        'K': '𝘒',
        'L': '𝘓',
        'M': '𝘔',
        'N': '𝘕',
        'O': '𝘖',
        'P': '𝘗',
        'Q': '𝘘',
        'R': '𝘙',
        'S': '𝘚',
        'T': '𝘛',
        'U': '𝘜',
        'V': '𝘝',
        'W': '𝘞',
        'X': '𝘟',
        'Y': '𝘠',
        'Z': '𝘡'
    },
    squiggle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'Ⴆ',
        'c': 'ƈ',
        'd': 'ԃ',
        'e': 'ҽ',
        'f': 'ϝ',
        'g': 'ɠ',
        'h': 'ԋ',
        'i': 'ι',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'ʅ',
        'm': 'ɱ',
        'n': 'ɳ',
        'o': 'σ',
        'p': 'ρ',
        'q': 'ϙ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'ƚ',
        'u': 'υ',
        'v': 'ʋ',
        'w': 'ɯ',
        'x': 'x',
        'y': 'ყ',
        'z': 'ȥ',
        'A': 'A',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'E',
        'F': 'F',
        'G': 'G',
        'H': 'H',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'N',
        'O': 'O',
        'P': 'P',
        'Q': 'Q',
        'R': 'R',
        'S': 'S',
        'T': 'T',
        'U': 'U',
        'V': 'V',
        'W': 'W',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    currencyCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '₳',
        'b': '฿',
        'c': '₵',
        'd': 'Đ',
        'e': 'Ɇ',
        'f': '₣',
        'g': '₲',
        'h': 'Ⱨ',
        'i': 'ł',
        'j': 'J',
        'k': '₭',
        'l': 'Ⱡ',
        'm': '₥',
        'n': '₦',
        'o': 'Ø',
        'p': '₱',
        'q': 'Q',
        'r': 'Ɽ',
        's': '₴',
        't': '₮',
        'u': 'Ʉ',
        'v': 'V',
        'w': '₩',
        'x': 'Ӿ',
        'y': 'Ɏ',
        'z': 'Ⱬ',
        'A': '₳',
        'B': '฿',
        'C': '₵',
        'D': 'Đ',
        'E': 'Ɇ',
        'F': '₣',
        'G': '₲',
        'H': 'Ⱨ',
        'I': 'ł',
        'J': 'J',
        'K': '₭',
        'L': 'Ⱡ',
        'M': '₥',
        'N': '₦',
        'O': 'Ø',
        'P': '₱',
        'Q': 'Q',
        'R': 'Ɽ',
        'S': '₴',
        'T': '₮',
        'U': 'Ʉ',
        'V': 'V',
        'W': '₩',
        'X': 'Ӿ',
        'Y': 'Ɏ',
        'Z': 'Ⱬ'
    },
    symbolsCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'å',
        'b': 'ß',
        'c': '¢',
        'd': 'Ð',
        'e': 'ê',
        'f': '£',
        'g': 'g',
        'h': 'h',
        'i': 'ï',
        'j': 'j',
        'k': 'k',
        'l': 'l',
        'm': 'm',
        'n': 'ñ',
        'o': 'ð',
        'p': 'þ',
        'q': 'q',
        'r': 'r',
        's': '§',
        't': '†',
        'u': 'µ',
        'v': 'v',
        'w': 'w',
        'x': 'x',
        'y': '¥',
        'z': 'z',
        'A': 'Ä',
        'B': 'ß',
        'C': 'Ç',
        'D': 'Ð',
        'E': 'È',
        'F': '£',
        'G': 'G',
        'H': 'H',
        'I': 'Ì',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'ñ',
        'O': 'Ö',
        'P': 'þ',
        'Q': 'Q',
        'R': 'R',
        'S': '§',
        'T': '†',
        'U': 'Ú',
        'V': 'V',
        'W': 'W',
        'X': '×',
        'Y': '¥',
        'Z': 'Z'
    },
    greekCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'в',
        'c': '¢',
        'd': '∂',
        'e': 'є',
        'f': 'ƒ',
        'g': 'g',
        'h': 'н',
        'i': 'ι',
        'j': 'נ',
        'k': 'к',
        'l': 'ℓ',
        'm': 'м',
        'n': 'η',
        'o': 'σ',
        'p': 'ρ',
        'q': 'q',
        'r': 'я',
        's': 'ѕ',
        't': 'т',
        'u': 'υ',
        'v': 'ν',
        'w': 'ω',
        'x': 'χ',
        'y': 'у',
        'z': 'z',
        'A': 'α',
        'B': 'в',
        'C': '¢',
        'D': '∂',
        'E': 'є',
        'F': 'ƒ',
        'G': 'g',
        'H': 'н',
        'I': 'ι',
        'J': 'נ',
        'K': 'к',
        'L': 'ℓ',
        'M': 'м',
        'N': 'η',
        'O': 'σ',
        'P': 'ρ',
        'Q': 'q',
        'R': 'я',
        'S': 'ѕ',
        'T': 'т',
        'U': 'υ',
        'V': 'ν',
        'W': 'ω',
        'X': 'χ',
        'Y': 'у',
        'Z': 'z'
    },
    bentTextCharMap = {
        0x0: '⊘',
        0x1: '𝟙',
        0x2: 'ϩ',
        0x3: 'Ӡ',
        0x4: '५',
        0x5: 'Ƽ',
        0x6: 'Ϭ',
        0x7: '7',
        0x8: '𝟠',
        0x9: '९',
        'a': 'ą',
        'b': 'ҍ',
        'c': 'ç',
        'd': 'ժ',
        'e': 'ҽ',
        'f': 'ƒ',
        'g': 'ց',
        'h': 'հ',
        'i': 'ì',
        'j': 'ʝ',
        'k': 'ҟ',
        'l': 'Ӏ',
        'm': 'ʍ',
        'n': 'ղ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'է',
        'u': 'մ',
        'v': 'ѵ',
        'w': 'ա',
        'x': '×',
        'y': 'վ',
        'z': 'Հ',
        'A': 'Ⱥ',
        'B': 'β',
        'C': '↻',
        'D': 'Ꭰ',
        'E': 'Ɛ',
        'F': 'Ƒ',
        'G': 'Ɠ',
        'H': 'Ƕ',
        'I': 'į',
        'J': 'ل',
        'K': 'Ҡ',
        'L': 'Ꝉ',
        'M': 'Ɱ',
        'N': 'ហ',
        'O': 'ට',
        'P': 'φ',
        'Q': 'Ҩ',
        'R': 'འ',
        'S': 'Ϛ',
        'T': 'Ͳ',
        'U': 'Ա',
        'V': 'Ỽ',
        'W': 'చ',
        'X': 'ჯ',
        'Y': 'Ӌ',
        'Z': 'ɀ'
    },
    upperAnglesCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Λ',
        'b': 'B',
        'c': 'ᄃ',
        'd': 'D',
        'e': 'Σ',
        'f': 'F',
        'g': 'G',
        'h': 'Ή',
        'i': 'I',
        'j': 'J',
        'k': 'K',
        'l': 'ᄂ',
        'm': 'M',
        'n': 'П',
        'o': 'Ө',
        'p': 'P',
        'q': 'Q',
        'r': 'Я',
        's': 'Ƨ',
        't': 'Ƭ',
        'u': 'Ц',
        'v': 'V',
        'w': 'Щ',
        'x': 'X',
        'y': 'Y',
        'z': 'Z',
        'A': 'Λ',
        'B': 'B',
        'C': 'ᄃ',
        'D': 'D',
        'E': 'Σ',
        'F': 'F',
        'G': 'G',
        'H': 'Ή',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'ᄂ',
        'M': 'M',
        'N': 'П',
        'O': 'Ө',
        'P': 'P',
        'Q': 'Q',
        'R': 'Я',
        'S': 'Ƨ',
        'T': 'Ƭ',
        'U': 'Ц',
        'V': 'V',
        'W': 'Щ',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    subscriptCharMap = {
        0x0: '₀',
        0x1: '₁',
        0x2: '₂',
        0x3: '₃',
        0x4: '₄',
        0x5: '₅',
        0x6: '₆',
        0x7: '₇',
        0x8: '₈',
        0x9: '₉',
        'a': 'ₐ',
        'b': 'b',
        'c': 'c',
        'd': 'd',
        'e': 'ₑ',
        'f': 'f',
        'g': 'g',
        'h': 'ₕ',
        'i': 'ᵢ',
        'j': 'ⱼ',
        'k': 'ₖ',
        'l': 'ₗ',
        'm': 'ₘ',
        'n': 'ₙ',
        'o': 'ₒ',
        'p': 'ₚ',
        'q': 'q',
        'r': 'ᵣ',
        's': 'ₛ',
        't': 'ₜ',
        'u': 'ᵤ',
        'v': 'ᵥ',
        'w': 'w',
        'x': 'ₓ',
        'y': 'y',
        'z': 'z',
        'A': 'ₐ',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'ₑ',
        'F': 'F',
        'G': 'G',
        'H': 'ₕ',
        'I': 'ᵢ',
        'J': 'ⱼ',
        'K': 'ₖ',
        'L': 'ₗ',
        'M': 'ₘ',
        'N': 'ₙ',
        'O': 'ₒ',
        'P': 'ₚ',
        'Q': 'Q',
        'R': 'ᵣ',
        'S': 'ₛ',
        'T': 'ₜ',
        'U': 'ᵤ',
        'V': 'ᵥ',
        'W': 'W',
        'X': 'ₓ',
        'Y': 'Y',
        'Z': 'Z',
        '+': '₊',
        '-': '₋',
        '=': '₌',
        '(': '₍',
        ')': '₎'
    },
    superscriptCharMap = {
        0x0: '⁰',
        0x1: '¹',
        0x2: '²',
        0x3: '³',
        0x4: '⁴',
        0x5: '⁵',
        0x6: '⁶',
        0x7: '⁷',
        0x8: '⁸',
        0x9: '⁹',
        'a': 'ᵃ',
        'b': 'ᵇ',
        'c': 'ᶜ',
        'd': 'ᵈ',
        'e': 'ᵉ',
        'f': 'ᶠ',
        'g': 'ᵍ',
        'h': 'ʰ',
        'i': 'ⁱ',
        'j': 'ʲ',
        'k': 'ᵏ',
        'l': 'ˡ',
        'm': 'ᵐ',
        'n': 'ⁿ',
        'o': 'ᵒ',
        'p': 'ᵖ',
        'q': 'q',
        'r': 'ʳ',
        's': 'ˢ',
        't': 'ᵗ',
        'u': 'ᵘ',
        'v': 'ᵛ',
        'w': 'ʷ',
        'x': 'ˣ',
        'y': 'ʸ',
        'z': 'ᶻ',
        'A': 'ᴬ',
        'B': 'ᴮ',
        'C': 'ᶜ',
        'D': 'ᴰ',
        'E': 'ᴱ',
        'F': 'ᶠ',
        'G': 'ᴳ',
        'H': 'ᴴ',
        'I': 'ᴵ',
        'J': 'ᴶ',
        'K': 'ᴷ',
        'L': 'ᴸ',
        'M': 'ᴹ',
        'N': 'ᴺ',
        'O': 'ᴼ',
        'P': 'ᴾ',
        'Q': 'Q',
        'R': 'ᴿ',
        'S': 'ˢ',
        'T': 'ᵀ',
        'U': 'ᵁ',
        'V': 'ⱽ',
        'W': 'ᵂ',
        'X': 'ˣ',
        'Y': 'ʸ',
        'Z': 'ᶻ',
        '+': '⁺',
        '-': '⁻',
        '=': '⁼',
        '(': '⁽',
        ')': '⁾'
    },
    squiggleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๒',
        'c': 'ς',
        'd': '๔',
        'e': 'є',
        'f': 'Ŧ',
        'g': 'ﻮ',
        'h': 'ђ',
        'i': 'เ',
        'j': 'ן',
        'k': 'к',
        'l': 'ɭ',
        'm': '๓',
        'n': 'ภ',
        'o': '๏',
        'p': 'ק',
        'q': 'ợ',
        'r': 'г',
        's': 'ร',
        't': 'Շ',
        'u': 'ย',
        'v': 'ש',
        'w': 'ฬ',
        'x': 'א',
        'y': 'ץ',
        'z': 'չ',
        'A': 'ค',
        'B': '๒',
        'C': 'ς',
        'D': '๔',
        'E': 'є',
        'F': 'Ŧ',
        'G': 'ﻮ',
        'H': 'ђ',
        'I': 'เ',
        'J': 'ן',
        'K': 'к',
        'L': 'ɭ',
        'M': '๓',
        'N': 'ภ',
        'O': '๏',
        'P': 'ק',
        'Q': 'ợ',
        'R': 'г',
        'S': 'ร',
        'T': 'Շ',
        'U': 'ย',
        'V': 'ש',
        'W': 'ฬ',
        'X': 'א',
        'Y': 'ץ',
        'Z': 'չ'
    },
    doubleStruckCharMap = {
        0x0: '𝟘',
        0x1: '𝟙',
        0x2: '𝟚',
        0x3: '𝟛',
        0x4: '𝟜',
        0x5: '𝟝',
        0x6: '𝟞',
        0x7: '𝟟',
        0x8: '𝟠',
        0x9: '𝟡',
        'a': '𝕒',
        'b': '𝕓',
        'c': '𝕔',
        'd': '𝕕',
        'e': '𝕖',
        'f': '𝕗',
        'g': '𝕘',
        'h': '𝕙',
        'i': '𝕚',
        'j': '𝕛',
        'k': '𝕜',
        'l': '𝕝',
        'm': '𝕞',
        'n': '𝕟',
        'o': '𝕠',
        'p': '𝕡',
        'q': '𝕢',
        'r': '𝕣',
        's': '𝕤',
        't': '𝕥',
        'u': '𝕦',
        'v': '𝕧',
        'w': '𝕨',
        'x': '𝕩',
        'y': '𝕪',
        'z': '𝕫',
        'A': '𝔸',
        'B': '𝔹',
        'C': 'ℂ',
        'D': '𝔻',
        'E': '𝔼',
        'F': '𝔽',
        'G': '𝔾',
        'H': 'ℍ',
        'I': '𝕀',
        'J': '𝕁',
        'K': '𝕂',
        'L': '𝕃',
        'M': '𝕄',
        'N': 'ℕ',
        'O': '𝕆',
        'P': 'ℙ',
        'Q': 'ℚ',
        'R': 'ℝ',
        'S': '𝕊',
        'T': '𝕋',
        'U': '𝕌',
        'V': '𝕍',
        'W': '𝕎',
        'X': '𝕏',
        'Y': '𝕐',
        'Z': 'ℤ'
    },
    medievalCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝖆',
        'b': '𝖇',
        'c': '𝖈',
        'd': '𝖉',
        'e': '𝖊',
        'f': '𝖋',
        'g': '𝖌',
        'h': '𝖍',
        'i': '𝖎',
        'j': '𝖏',
        'k': '𝖐',
        'l': '𝖑',
        'm': '𝖒',
        'n': '𝖓',
        'o': '𝖔',
        'p': '𝖕',
        'q': '𝖖',
        'r': '𝖗',
        's': '𝖘',
        't': '𝖙',
        'u': '𝖚',
        'v': '𝖛',
        'w': '𝖜',
        'x': '𝖝',
        'y': '𝖞',
        'z': '𝖟',
        'A': '𝕬',
        'B': '𝕭',
        'C': '𝕮',
        'D': '𝕯',
        'E': '𝕰',
        'F': '𝕱',
        'G': '𝕲',
        'H': '𝕳',
        'I': '𝕴',
        'J': '𝕵',
        'K': '𝕶',
        'L': '𝕷',
        'M': '𝕸',
        'N': '𝕹',
        'O': '𝕺',
        'P': '𝕻',
        'Q': '𝕼',
        'R': '𝕽',
        'S': '𝕾',
        'T': '𝕿',
        'U': '𝖀',
        'V': '𝖁',
        'W': '𝖂',
        'X': '𝖃',
        'Y': '𝖄',
        'Z': '𝖅'
    },
    invertedSquaresCharMap = {
        'q': '🆀',
        'w': '🆆',
        'e': '🅴',
        'r': '🆁',
        't': '🆃',
        'y': '🆈',
        'u': '🆄',
        'i': '🅸',
        'o': '🅾',
        'p': '🅿',
        'a': '🅰',
        's': '🆂',
        'd': '🅳',
        'f': '🅵',
        'g': '🅶',
        'h': '🅷',
        'j': '🅹',
        'k': '🅺',
        'l': '🅻',
        'z': '🆉',
        'x': '🆇',
        'c': '🅲',
        'v': '🆅',
        'b': '🅱',
        'n': '🅽',
        'm': '🅼'
    },
    cursiveCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝓪',
        'b': '𝓫',
        'c': '𝓬',
        'd': '𝓭',
        'e': '𝓮',
        'f': '𝓯',
        'g': '𝓰',
        'h': '𝓱',
        'i': '𝓲',
        'j': '𝓳',
        'k': '𝓴',
        'l': '𝓵',
        'm': '𝓶',
        'n': '𝓷',
        'o': '𝓸',
        'p': '𝓹',
        'q': '𝓺',
        'r': '𝓻',
        's': '𝓼',
        't': '𝓽',
        'u': '𝓾',
        'v': '𝓿',
        'w': '𝔀',
        'x': '𝔁',
        'y': '𝔂',
        'z': '𝔃',
        'A': '𝓐',
        'B': '𝓑',
        'C': '𝓒',
        'D': '𝓓',
        'E': '𝓔',
        'F': '𝓕',
        'G': '𝓖',
        'H': '𝓗',
        'I': '𝓘',
        'J': '𝓙',
        'K': '𝓚',
        'L': '𝓛',
        'M': '𝓜',
        'N': '𝓝',
        'O': '𝓞',
        'P': '𝓟',
        'Q': '𝓠',
        'R': '𝓡',
        'S': '𝓢',
        'T': '𝓣',
        'U': '𝓤',
        'V': '𝓥',
        'W': '𝓦',
        'X': '𝓧',
        'Y': '𝓨',
        'Z': '𝓩'
    },
    oldEnglishCharMap = {
        'a': '𝔞',
        'b': '𝔟',
        'c': '𝔠',
        'd': '𝔡',
        'e': '𝔢',
        'f': '𝔣',
        'g': '𝔤',
        'h': '𝔥',
        'i': '𝔦',
        'j': '𝔧',
        'k': '𝔨',
        'l': '𝔩',
        'm': '𝔪',
        'n': '𝔫',
        'o': '𝔬',
        'p': '𝔭',
        'q': '𝔮',
        'r': '𝔯',
        's': '𝔰',
        't': '𝔱',
        'u': '𝔲',
        'v': '𝔳',
        'w': '𝔴',
        'x': '𝔵',
        'y': '𝔶',
        'z': '𝔷',
        'A': '𝔄',
        'B': '𝔅',
        'C': 'ℭ',
        'D': '𝔇',
        'E': '𝔈',
        'F': '𝔉',
        'G': '𝔊',
        'H': 'ℌ',
        'I': 'ℑ',
        'J': '𝔍',
        'K': '𝔎',
        'L': '𝔏',
        'M': '𝔐',
        'N': '𝔑',
        'O': '𝔒',
        'P': '𝔓',
        'Q': '𝔔',
        'R': 'ℜ',
        'S': '𝔖',
        'T': '𝔗',
        'U': '𝔘',
        'V': '𝔙',
        'W': '𝔚',
        'X': '𝔛',
        'Y': '𝔜',
        'Z': 'ℨ'
    },
    wideTextCharMap = {
        '`': '`',
        0x1: '１',
        0x2: '２',
        0x3: '３',
        0x4: '４',
        0x5: '５',
        0x6: '６',
        0x7: '７',
        0x8: '８',
        0x9: '９',
        0x0: '０',
        '-': '－',
        '=': '＝',
        '~': '~',
        '!': '！',
        '@': '＠',
        '#': '＃',
        '$': '＄',
        '%': '％',
        '^': '^',
        '&': '＆',
        '*': '＊',
        '(': '（',
        ')': '）',
        '_': '_',
        '+': '＋',
        'q': 'ｑ',
        'w': 'ｗ',
        'e': 'ｅ',
        'r': 'ｒ',
        't': 'ｔ',
        'y': 'ｙ',
        'u': 'ｕ',
        'i': 'ｉ',
        'o': 'ｏ',
        'p': 'ｐ',
        '[': '[',
        ']': ']',
        '\x5c': '\x5c',
        'Q': 'Ｑ',
        'W': 'Ｗ',
        'E': 'Ｅ',
        'R': 'Ｒ',
        'T': 'Ｔ',
        'Y': 'Ｙ',
        'U': 'Ｕ',
        'I': 'Ｉ',
        'O': 'Ｏ',
        'P': 'Ｐ',
        '{': '{',
        '}': '}',
        '|': '|',
        'a': 'ａ',
        's': 'ｓ',
        'd': 'ｄ',
        'f': 'ｆ',
        'g': 'ｇ',
        'h': 'ｈ',
        'j': 'ｊ',
        'k': 'ｋ',
        'l': 'ｌ',
        ';': '；',
        '\x27': '＇',
        'A': 'Ａ',
        'S': 'Ｓ',
        'D': 'Ｄ',
        'F': 'Ｆ',
        'G': 'Ｇ',
        'H': 'Ｈ',
        'J': 'Ｊ',
        'K': 'Ｋ',
        'L': 'Ｌ',
        ':': '：',
        '\x22': '\x22',
        'z': 'ｚ',
        'x': 'ｘ',
        'c': 'ｃ',
        'v': 'ｖ',
        'b': 'ｂ',
        'n': 'ｎ',
        'm': 'ｍ',
        ',': '，',
        '.': '．',
        '/': '／',
        'Z': 'Ｚ',
        'X': 'Ｘ',
        'C': 'Ｃ',
        'V': 'Ｖ',
        'B': 'Ｂ',
        'N': 'Ｎ',
        'M': 'Ｍ',
        '<': '<',
        '>': '>',
        '?': '？'
    };

function Lunicode() {
    var _0x4fc33e = _0x3e3222;
    this[_0x4fc33e(0x339)] = {
        'flip': {
            'init': function() {
                var _0x131c61 = _0x4fc33e;
                for (i in this['map']) this[_0x131c61(0x27c)][this['map'][i]] = i;
            },
            'encode': function(_0x45c39e) {
                var _0x308a45 = _0x4fc33e;
                for (var _0x27e3e1, _0x1527dc = [], _0x18077d = 0x0, _0x2698b1 = _0x45c39e[_0x308a45(0x40)]; _0x2698b1 > _0x18077d; _0x18077d++) _0x27e3e1 = _0x45c39e['charAt'](_0x18077d), _0x18077d > 0x0 && ('̤' == _0x27e3e1 || '̗' == _0x27e3e1 || '̖' == _0x27e3e1 || '̮' == _0x27e3e1) ? (_0x27e3e1 = this[_0x308a45(0x27c)][_0x45c39e['charAt'](_0x18077d - 0x1) + _0x27e3e1], _0x1527dc[_0x308a45(0x13d)]()) : (_0x27e3e1 = this[_0x308a45(0x27c)][_0x27e3e1], _0x308a45(0x69) == typeof _0x27e3e1 && (_0x27e3e1 = _0x45c39e[_0x308a45(0x32c)](_0x18077d))), _0x1527dc['push'](_0x27e3e1);
                return _0x1527dc[_0x308a45(0x121)]()['join']('');
            },
            'decode': function(_0x57b3e5) {
                var _0x404e33 = _0x4fc33e;
                for (var _0xace34e, _0x7c790a = [], _0x31fd45 = 0x0, _0x11a9f2 = _0x57b3e5[_0x404e33(0x40)]; _0x11a9f2 > _0x31fd45; _0x31fd45++) _0xace34e = _0x57b3e5[_0x404e33(0x32c)](_0x31fd45), _0x31fd45 > 0x0 && ('̤' == _0xace34e || '̗' == _0xace34e || '̖' == _0xace34e || '̮' == _0xace34e) ? (_0xace34e = this[_0x404e33(0x27c)][_0x57b3e5[_0x404e33(0x32c)](_0x31fd45 - 0x1) + _0xace34e], _0x7c790a[_0x404e33(0x13d)]()) : (_0xace34e = this[_0x404e33(0x27c)][_0xace34e], _0x404e33(0x69) == typeof _0xace34e && (_0xace34e = _0x57b3e5[_0x404e33(0x32c)](_0x31fd45))), _0x7c790a[_0x404e33(0x4cc)](_0xace34e);
                return _0x7c790a[_0x404e33(0x121)]()[_0x404e33(0x209)]('');
            },
            'map': {
                'a': 'ɐ',
                'b': 'q',
                'c': 'ɔ',
                'd': 'p',
                'e': 'ǝ',
                'f': 'ɟ',
                'g': 'ɓ',
                'h': 'ɥ',
                'i': 'ı',
                'j': 'ɾ',
                'k': 'ʞ',
                'l': 'l',
                'm': 'ɯ',
                'n': 'u',
                'r': 'ɹ',
                't': 'ʇ',
                'v': 'ʌ',
                'w': 'ʍ',
                'y': 'ʎ',
                'A': '∀',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'Ⅎ',
                'G': '⅁',
                'J': 'ſ',
                'K': '⋊',
                'L': '˥',
                'M': 'W',
                'P': 'Ԁ',
                'Q': 'Ό',
                'R': 'ᴚ',
                'T': '⊥',
                'U': '∩',
                'V': 'Λ',
                'Y': '⅄',
                0x1: '⇂',
                0x2: 'ᄅ',
                0x3: 'Ɛ',
                0x4: 'ㄣ',
                0x5: 'ގ',
                0x6: '9',
                0x7: 'ㄥ',
                '&': '⅋',
                '.': '˙',
                '\x22': '„',
                ';': '؛',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '¿',
                '!': '¡',
                '\x27': ',',
                '<': '>',
                '‾': '_',
                '¯': '_',
                '‿': '⁀',
                '⁅': '⁆',
                '∴': '∵',
                '\x0d': '\x0a',
                'ß': 'ᙠ',
                '̈': '̤',
                'ä': 'ɐ̤',
                'ö': 'o̤',
                'ü': 'n̤',
                'Ä': '∀̤',
                'Ö': 'O̤',
                'Ü': '∩̤',
                '´': '\x20̗',
                'é': 'ǝ̗',
                'á': 'ɐ̗',
                'ó': 'o̗',
                'ú': 'n̗',
                'É': 'Ǝ̗',
                'Á': '∀̗',
                'Ó': 'O̗',
                'Ú': '∩̗',
                '`': '\x20̖',
                'è': 'ǝ̖',
                'à': 'ɐ̖',
                'ò': 'o̖',
                'ù': 'n̖',
                'È': 'Ǝ̖',
                'À': '∀̖',
                'Ò': 'O̖',
                'Ù': '∩̖',
                '^': '\x20̮',
                'ê': 'ǝ̮',
                'â': 'ɐ̮',
                'ô': 'o̮',
                'û': 'n̮',
                'Ê': 'Ǝ̮',
                'Â': '∀̮',
                'Ô': 'O̮',
                'Û': '∩̮'
            }
        },
        'mirror': {
            'init': function() {
                var _0x5ddd4f = _0x4fc33e;
                for (i in this[_0x5ddd4f(0x27c)]) this[_0x5ddd4f(0x27c)][this[_0x5ddd4f(0x27c)][i]] = i;
            },
            'encode': function(_0xeba1c5) {
                var _0x55ef39 = _0x4fc33e;
                for (var _0x204483, _0x32908b = [], _0x3d72b7 = [], _0x21b5c3 = 0x0, _0x3c5868 = _0xeba1c5['length']; _0x3c5868 > _0x21b5c3; _0x21b5c3++) _0x204483 = _0xeba1c5['charAt'](_0x21b5c3), _0x21b5c3 > 0x0 && ('̈' == _0x204483 || '̀' == _0x204483 || '́' == _0x204483 || '̂' == _0x204483) ? (_0x204483 = this[_0x55ef39(0x27c)][_0xeba1c5[_0x55ef39(0x32c)](_0x21b5c3 - 0x1) + _0x204483], _0x32908b[_0x55ef39(0x13d)]()) : (_0x204483 = this[_0x55ef39(0x27c)][_0x204483], 'undefined' == typeof _0x204483 && (_0x204483 = _0xeba1c5[_0x55ef39(0x32c)](_0x21b5c3))), '\x0a' == _0x204483 ? (_0x3d72b7[_0x55ef39(0x4cc)](_0x32908b[_0x55ef39(0x121)]()[_0x55ef39(0x209)]('')), _0x32908b = []) : _0x32908b[_0x55ef39(0x4cc)](_0x204483);
                return _0x3d72b7['push'](_0x32908b[_0x55ef39(0x121)]()['join']('')), _0x3d72b7[_0x55ef39(0x209)]('\x0a');
            },
            'decode': function(_0x2bcc8e) {
                var _0x50ef1b = _0x4fc33e;
                for (var _0x113474, _0xc4306c = [], _0x57271f = [], _0x550eb0 = 0x0, _0x2bc6de = _0x2bcc8e[_0x50ef1b(0x40)]; _0x2bc6de > _0x550eb0; _0x550eb0++) _0x113474 = _0x2bcc8e[_0x50ef1b(0x32c)](_0x550eb0), _0x550eb0 > 0x0 && ('̈' == _0x113474 || '̀' == _0x113474 || '́' == _0x113474 || '̂' == _0x113474) ? (_0x113474 = this[_0x50ef1b(0x27c)][_0x2bcc8e[_0x50ef1b(0x32c)](_0x550eb0 - 0x1) + _0x113474], _0xc4306c['pop']()) : (_0x113474 = this[_0x50ef1b(0x27c)][_0x113474], _0x50ef1b(0x69) == typeof _0x113474 && (_0x113474 = _0x2bcc8e[_0x50ef1b(0x32c)](_0x550eb0))), '\x0a' == _0x113474 ? (_0x57271f[_0x50ef1b(0x4cc)](_0xc4306c[_0x50ef1b(0x121)]()['join']('')), _0xc4306c = []) : _0xc4306c[_0x50ef1b(0x4cc)](_0x113474);
                return _0x57271f[_0x50ef1b(0x4cc)](_0xc4306c[_0x50ef1b(0x121)]()[_0x50ef1b(0x209)]('')), _0x57271f[_0x50ef1b(0x209)]('\x0a');
            },
            'map': {
                'a': 'ɒ',
                'b': 'd',
                'c': 'ɔ',
                'e': 'ɘ',
                'f': 'Ꮈ',
                'g': 'ǫ',
                'h': 'ʜ',
                'j': 'ꞁ',
                'k': 'ʞ',
                'l': '|',
                'n': 'ᴎ',
                'p': 'q',
                'r': 'ɿ',
                's': 'ꙅ',
                't': 'ƚ',
                'y': 'ʏ',
                'z': 'ƹ',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'ꟻ',
                'G': 'Ꭾ',
                'J': 'Ⴑ',
                'K': '⋊',
                'L': '⅃',
                'N': 'Ͷ',
                'P': 'ꟼ',
                'Q': 'Ọ',
                'R': 'Я',
                'S': 'Ꙅ',
                'Z': 'Ƹ',
                0x1: '',
                0x2: '',
                0x3: '',
                0x4: '',
                0x5: '',
                0x6: '',
                0x7: '',
                '&': '',
                ';': '',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '⸮',
                '<': '>',
                'ä': 'ɒ̈',
                'ß': 'ᙠ',
                '´': '`',
                'é': 'ɘ̀',
                'á': 'ɒ̀',
                'ó': 'ò',
                'ú': 'ù',
                'É': 'Ǝ̀',
                'Á': 'À',
                'Ó': 'Ò',
                'Ú': 'Ù',
                '`': '´',
                'è': 'ɘ́',
                'à': 'ɒ́',
                'È': 'Ǝ́',
                'ê': 'ɘ̂',
                'â': 'ɒ̂',
                'Ê': 'Ǝ̂',
                'Ø': 'ᴓ',
                'ø': 'ᴓ'
            }
        },
        'creepify': {
            'init': function() {
                var _0xa378ad = _0x4fc33e;
                for (var _0x55287d = 0x300; 0x315 >= _0x55287d; _0x55287d++) this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](_0x55287d));
                for (var _0x55287d = 0x316; 0x333 >= _0x55287d; _0x55287d++) 0x31a != _0x55287d && 0x31b != _0x55287d && this[_0xa378ad(0x42c)]['push'](String['fromCharCode'](_0x55287d));
                this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x31a)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x31b));
                for (var _0x55287d = 0x334; 0x338 >= _0x55287d; _0x55287d++) this[_0xa378ad(0x3fd)][_0xa378ad(0x4cc)](String['fromCharCode'](_0x55287d));
                for (var _0x55287d = 0x339; 0x33c >= _0x55287d; _0x55287d++) this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](_0x55287d));
                for (var _0x55287d = 0x33d; 0x344 >= _0x55287d; _0x55287d++) this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](_0x55287d));
                this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x344)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x345)), this['diacriticsTop']['push'](String[_0xa378ad(0x46d)](0x346)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x347)), this[_0xa378ad(0x42c)]['push'](String[_0xa378ad(0x46d)](0x348)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x349)), this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x34a)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x34b)), this['diacriticsTop']['push'](String[_0xa378ad(0x46d)](0x34c)), this['diacriticsBottom'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x34d)), this[_0xa378ad(0x42c)]['push'](String[_0xa378ad(0x46d)](0x34e)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x350)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x351)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x352)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x353)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x354)), this['diacriticsBottom']['push'](String[_0xa378ad(0x46d)](0x355)), this['diacriticsBottom'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x356)), this['diacriticsTop']['push'](String[_0xa378ad(0x46d)](0x357)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String['fromCharCode'](0x358)), this['diacriticsBottom']['push'](String[_0xa378ad(0x46d)](0x359)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35a)), this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35b)), this[_0xa378ad(0x42c)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35c)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35d)), this['diacriticsTop'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35d)), this['diacriticsBottom'][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x35f)), this[_0xa378ad(0x405)]['push'](String[_0xa378ad(0x46d)](0x360)), this[_0xa378ad(0x405)][_0xa378ad(0x4cc)](String[_0xa378ad(0x46d)](0x361));
            },
            'encode': function(_0x3606ff) {
                var _0x39d960 = _0x4fc33e,
                    _0x4cc919, _0x33b11a = '';
                for (i in _0x3606ff) {
                    if (_0x4cc919 = _0x3606ff[i], this[_0x39d960(0x1bd)][_0x39d960(0x2a)] && (_0x4cc919 += this['diacriticsMiddle'][Math[_0x39d960(0x7b)](Math[_0x39d960(0x2bf)]() * this[_0x39d960(0x3fd)][_0x39d960(0x40)])]), this[_0x39d960(0x1bd)][_0x39d960(0x191)]) {
                        for (var _0x53c209 = this[_0x39d960(0x405)][_0x39d960(0x40)] - 0x1, _0x2d0d40 = 0x0, _0x809803 = this[_0x39d960(0x1bd)][_0x39d960(0x149)] - Math[_0x39d960(0x2bf)]() * (this[_0x39d960(0x1bd)][_0x39d960(0x29)] / 0x64 * this[_0x39d960(0x1bd)][_0x39d960(0x149)]); _0x809803 > _0x2d0d40; _0x2d0d40++) _0x4cc919 += this['diacriticsTop'][Math['floor'](Math[_0x39d960(0x2bf)]() * _0x53c209)];
                    }
                    if (this[_0x39d960(0x1bd)]['bottom']) {
                        for (var _0xf8913f = this[_0x39d960(0x42c)][_0x39d960(0x40)] - 0x1, _0x2d0d40 = 0x0, _0x809803 = this[_0x39d960(0x1bd)][_0x39d960(0x149)] - Math[_0x39d960(0x2bf)]() * (this[_0x39d960(0x1bd)]['randomization'] / 0x64 * this[_0x39d960(0x1bd)]['maxHeight']); _0x809803 > _0x2d0d40; _0x2d0d40++) _0x4cc919 += this[_0x39d960(0x42c)][Math[_0x39d960(0x7b)](Math[_0x39d960(0x2bf)]() * _0xf8913f)];
                    }
                    _0x33b11a += _0x4cc919;
                }
                return _0x33b11a;
            },
            'decode': function(_0xda766) {
                var _0x15a4ca = _0x4fc33e,
                    _0x47ee37, _0x52462f = '';
                for (i in _0xda766) _0x47ee37 = _0xda766[i][_0x15a4ca(0x11f)](0x0), (0x300 > _0x47ee37 || _0x47ee37 > 0x361) && (_0x52462f += _0xda766[i]);
                return _0x52462f;
            },
            'diacriticsTop': [],
            'diacriticsMiddle': [],
            'diacriticsBottom': [],
            'options': {
                'top': !0x0,
                'middle': !0x0,
                'bottom': !0x0,
                'maxHeight': 0xf,
                'randomization': 0x64
            }
        },
        'bubbles': {
            'init': function() {
                var _0x4977f0 = _0x4fc33e;
                for (var _0x5188ed = 0x31; 0x39 >= _0x5188ed; _0x5188ed++) this[_0x4977f0(0x27c)][String[_0x4977f0(0x46d)](_0x5188ed)] = String[_0x4977f0(0x46d)](_0x5188ed + 0x242f);
                this['map'][0x0] = '⓪';
                for (var _0x5188ed = 0x41; 0x5a >= _0x5188ed; _0x5188ed++) this[_0x4977f0(0x27c)][String[_0x4977f0(0x46d)](_0x5188ed)] = String[_0x4977f0(0x46d)](_0x5188ed + 0x2475);
                for (var _0x5188ed = 0x61; 0x7a >= _0x5188ed; _0x5188ed++) this['map'][String[_0x4977f0(0x46d)](_0x5188ed)] = String[_0x4977f0(0x46d)](_0x5188ed + 0x246f);
                for (_0x5188ed in this[_0x4977f0(0x27c)]) this[_0x4977f0(0x17a)][this[_0x4977f0(0x27c)][_0x5188ed]] = _0x5188ed;
            },
            'encode': function(_0x18cd20) {
                var _0x5149fa = _0x4fc33e,
                    _0x4431a2, _0xd5c75 = '',
                    _0x1412c9 = !0x0;
                for (i in _0x18cd20) _0x4431a2 = this[_0x5149fa(0x27c)][_0x18cd20[i]], _0x5149fa(0x69) == typeof _0x4431a2 && (_0x18cd20[i][_0x5149fa(0x11f)](0x0) >= 0x21 ? (_0x4431a2 = _0x18cd20[i] + String[_0x5149fa(0x46d)](0x20dd), _0x1412c9 || (_0x4431a2 = String['fromCharCode'](0x202f) + String['fromCharCode'](0xa0) + String[_0x5149fa(0x46d)](0xa0) + String[_0x5149fa(0x46d)](0x202f) + _0x4431a2)) : _0x4431a2 = _0x18cd20[i]), _0xd5c75 += _0x4431a2, _0x1412c9 = '\x0a' == _0x4431a2;
                return _0xd5c75;
            },
            'decode': function(_0x4fc455) {
                var _0x1bd4c8 = _0x4fc33e,
                    _0x260490, _0x3592e4 = '',
                    _0x599bd9 = '';
                for (i in _0x4fc455) _0x260490 = this['mapInverse'][_0x4fc455[i]], _0x3592e4 += _0x1bd4c8(0x69) == typeof _0x260490 ? _0x4fc455[i] : _0x260490;
                for (i in _0x3592e4) _0x260490 = _0x3592e4[i]['charCodeAt'](0x0), 0xa0 != _0x260490 && 0x202f != _0x260490 && 0x20dd != _0x260490 && (_0x599bd9 += _0x3592e4[i]);
                return _0x599bd9;
            },
            'map': {},
            'mapInverse': {}
        },
        'squares': {
            'init': function() {},
            'encode': function(_0x4f3bd0) {
                var _0xa5d1da = _0x4fc33e,
                    _0x208ee2, _0x3179e9 = '',
                    _0x5a58b0 = !0x0;
                for (i in _0x4f3bd0) _0x4f3bd0[i][_0xa5d1da(0x11f)](0x0) >= 0x21 ? (_0x208ee2 = _0x4f3bd0[i] + String[_0xa5d1da(0x46d)](0x20de), _0x5a58b0 || (_0x208ee2 = String[_0xa5d1da(0x46d)](0x202f) + String[_0xa5d1da(0x46d)](0xa0) + String['fromCharCode'](0xa0) + String[_0xa5d1da(0x46d)](0x202f) + _0x208ee2)) : _0x208ee2 = _0x4f3bd0[i], _0x3179e9 += _0x208ee2, _0x5a58b0 = '\x0a' == _0x208ee2;
                return _0x3179e9;
            },
            'decode': function(_0x23d720) {
                var _0xf540cc = _0x4fc33e,
                    _0x596985, _0x20f42f = '';
                for (i in _0x23d720) _0x596985 = _0x23d720[i][_0xf540cc(0x11f)](0x0), 0xa0 != _0x596985 && 0x202f != _0x596985 && 0x20de != _0x596985 && (_0x20f42f += _0x23d720[i]);
                return _0x20f42f;
            }
        },
        'roundsquares': {
            'init': function() {},
            'encode': function(_0x2e42ab) {
                var _0x17b140 = _0x4fc33e,
                    _0x40b707, _0xf8a440 = '',
                    _0x16d8a0 = !0x0;
                for (i in _0x2e42ab) _0x2e42ab[i]['charCodeAt'](0x0) >= 0x21 ? (_0x40b707 = _0x2e42ab[i] + String[_0x17b140(0x46d)](0x20e3), _0x16d8a0 || (_0x40b707 = String[_0x17b140(0x46d)](0xa0) + String['fromCharCode'](0xa0) + String['fromCharCode'](0xa0) + _0x40b707)) : _0x40b707 = _0x2e42ab[i], _0xf8a440 += _0x40b707, _0x16d8a0 = '\x0a' == _0x40b707;
                return _0xf8a440;
            },
            'decode': function(_0xcdba7) {
                var _0x23fc9c = _0x4fc33e,
                    _0x53dfe7, _0xe4b36e = '';
                for (i in _0xcdba7) _0x53dfe7 = _0xcdba7[i][_0x23fc9c(0x11f)](0x0), 0xa0 != _0x53dfe7 && 0x202f != _0x53dfe7 && 0x20e3 != _0x53dfe7 && (_0xe4b36e += _0xcdba7[i]);
                return _0xe4b36e;
            }
        },
        'bent': {
            'init': function() {
                var _0x103ac7 = _0x4fc33e;
                for (i in this['map']) this['map'][this[_0x103ac7(0x27c)][i]] = i;
            },
            'encode': function(_0x429465) {
                var _0x479652 = _0x4fc33e;
                for (var _0x525375, _0x5d2e25 = '', _0x3bc390 = 0x0, _0x31b7b5 = _0x429465[_0x479652(0x40)]; _0x31b7b5 > _0x3bc390; _0x3bc390++) _0x525375 = this[_0x479652(0x27c)][_0x429465[_0x479652(0x32c)](_0x3bc390)], _0x479652(0x69) == typeof _0x525375 && (_0x525375 = _0x429465[_0x479652(0x32c)](_0x3bc390)), _0x5d2e25 += _0x525375;
                return _0x5d2e25;
            },
            'decode': function(_0x207094) {
                var _0x3457ee = _0x4fc33e;
                for (var _0x34ef53, _0x2400ac = '', _0x581017 = 0x0, _0x3c4949 = _0x207094['length']; _0x3c4949 > _0x581017; _0x581017++) _0x34ef53 = this[_0x3457ee(0x27c)][_0x207094['charAt'](_0x581017)], _0x3457ee(0x69) == typeof _0x34ef53 && (_0x34ef53 = _0x207094[_0x3457ee(0x32c)](_0x581017)), _0x2400ac += _0x34ef53;
                return _0x2400ac;
            },
            'map': {
                'a': 'ą',
                'b': 'ҍ',
                'c': 'ç',
                'd': 'ժ',
                'e': 'ҽ',
                'f': 'ƒ',
                'g': 'ց',
                'h': 'հ',
                'i': 'ì',
                'j': 'ʝ',
                'k': 'ҟ',
                'l': 'Ӏ',
                'm': 'ʍ',
                'n': 'ղ',
                'o': 'օ',
                'p': 'ք',
                'q': 'զ',
                'r': 'ɾ',
                's': 'ʂ',
                't': 'է',
                'u': 'մ',
                'v': 'ѵ',
                'w': 'ա',
                'x': '×',
                'y': 'վ',
                'z': 'Հ',
                'A': 'Ⱥ',
                'B': 'β',
                'C': '↻',
                'D': 'Ꭰ',
                'E': 'Ɛ',
                'F': 'Ƒ',
                'G': 'Ɠ',
                'H': 'Ƕ',
                'I': 'į',
                'J': 'ل',
                'K': 'Ҡ',
                'L': 'Ꝉ',
                'M': 'Ɱ',
                'N': 'ហ',
                'O': 'ට',
                'P': 'φ',
                'Q': 'Ҩ',
                'R': 'འ',
                'S': 'Ϛ',
                'T': 'Ͳ',
                'U': 'Ա',
                'V': 'Ỽ',
                'W': 'చ',
                'X': 'ჯ',
                'Y': 'Ӌ',
                'Z': 'ɀ',
                0x0: '⊘',
                0x1: _0x4fc33e(0x4c7),
                0x2: 'ϩ',
                0x3: 'Ӡ',
                0x4: '५',
                0x5: 'Ƽ',
                0x6: 'Ϭ',
                0x7: '7',
                0x8: '������',
                0x9: '९',
                '&': '⅋',
                '(': '{',
                ')': '}',
                '{': '(',
                '}': ')',
                'ä': 'ą̈',
                'ö': 'օ̈',
                'ü': 'մ̈',
                'Ä': 'Ⱥ̈',
                'Ö': 'ට̈',
                'Ü': 'Ա̈',
                'é': 'ҽ́',
                'á': 'ą́',
                'ó': 'օ́',
                'ú': 'մ́',
                'É': 'Ɛ́',
                'Á': 'Ⱥ́',
                'Ó': 'ට́',
                'Ú': 'Ա́',
                'è': 'ҽ̀',
                'à': 'ą̀',
                'ò': 'օ̀',
                'ù': 'մ̀',
                'È': 'Ɛ̀',
                'À': 'Ⱥ̀',
                'Ò': 'ට̀',
                'Ù': 'Ա̀',
                'ê': 'ҽ̂',
                'â': 'ą̂',
                'ô': 'օ̂',
                'û': 'մ̂',
                'Ê': 'Ɛ̂',
                'Â': 'Ⱥ̂',
                'Ô': 'ට̂',
                'Û': 'Ա̂'
            }
        },
        'tiny': {
            'init': function() {
                var _0x1f822b = _0x4fc33e;
                for (i in this['map']) this[_0x1f822b(0x27c)][this[_0x1f822b(0x27c)][i]] = i;
            },
            'encode': function(_0x13f96d) {
                var _0x373e15 = _0x4fc33e,
                    _0x1f31d6, _0x188cae = '';
                _0x13f96d = _0x13f96d['toUpperCase']();
                for (var _0xb329ae = 0x0, _0x22db8b = _0x13f96d['length']; _0x22db8b > _0xb329ae; _0xb329ae++) _0x1f31d6 = this['map'][_0x13f96d[_0x373e15(0x32c)](_0xb329ae)], _0x373e15(0x69) == typeof _0x1f31d6 && (_0x1f31d6 = _0x13f96d[_0x373e15(0x32c)](_0xb329ae)), _0x188cae += _0x1f31d6;
                return _0x188cae;
            },
            'decode': function(_0x563bbb) {
                var _0x49ed89 = _0x4fc33e;
                for (var _0x19659f, _0x2cff7b = '', _0xa2fbef = 0x0, _0x10294f = _0x563bbb['length']; _0x10294f > _0xa2fbef; _0xa2fbef++) _0x19659f = this[_0x49ed89(0x27c)][_0x563bbb['charAt'](_0xa2fbef)], _0x49ed89(0x69) == typeof _0x19659f && (_0x19659f = _0x563bbb['charAt'](_0xa2fbef)), _0x2cff7b += _0x19659f;
                return _0x2cff7b;
            },
            'map': {
                'A': 'ᴀ',
                'B': 'ʙ',
                'C': 'ᴄ',
                'D': 'ᴅ',
                'E': 'ᴇ',
                'F': 'ꜰ',
                'G': 'ɢ',
                'H': 'ʜ',
                'I': 'ɪ',
                'J': 'ᴊ',
                'K': 'ᴋ',
                'L': 'ʟ',
                'M': 'ᴍ',
                'N': 'ɴ',
                'O': 'ᴏ',
                'P': 'ᴘ',
                'Q': 'Q',
                'R': 'ʀ',
                'S': 'ꜱ',
                'T': 'ᴛ',
                'U': 'ᴜ',
                'V': 'ᴠ',
                'W': 'ᴡ',
                'X': 'x',
                'Y': 'ʏ',
                'Z': 'ᴢ'
            }
        }
    };
    for (i in this[_0x4fc33e(0x339)]) this[_0x4fc33e(0x339)][i][_0x4fc33e(0xf6)]();
    this[_0x4fc33e(0x1e7)] = function(_0x1ec102) {
        var _0x325219 = _0x4fc33e;
        for (var _0x2a920f, _0x1c621b = '', _0x10337f = !0x0, _0x42a8f6 = 0x0, _0x54cf30 = 0x0, _0x56ba37 = 0x0, _0x17ebf2 = _0x1ec102[_0x325219(0x40)]; _0x17ebf2 > _0x56ba37; _0x56ba37++) _0x2a920f = _0x1ec102[_0x325219(0x11f)](_0x56ba37), 0xa == _0x2a920f || 0xd == _0x2a920f ? (_0x1c621b += '<br>\x0a', _0x10337f = !0x0) : 0x20 == _0x2a920f ? _0x10337f ? (_0x1c621b += '\x20', _0x10337f = !0x1) : (_0x1c621b += '\x20', _0x10337f = !0x0) : (_0x2a920f >= 0xd800 && 0xdbff >= _0x2a920f ? (_0x42a8f6 = _0x2a920f, _0x54cf30 = 0x0) : _0x42a8f6 > 0x0 ? (_0x2a920f >= 0xdc00 && 0xdfff >= _0x2a920f && (_0x54cf30 = 0x400 * (_0x42a8f6 - 0xd800) + (_0x2a920f - 0xdc00) + 0x10000), _0x42a8f6 = 0x0) : _0x54cf30 = _0x2a920f, 0x0 != _0x54cf30 && (_0x1c621b += _0x325219(0xd8) + _0x54cf30[_0x325219(0x4d2)](0x10) + ';', _0x10337f = !0x0));
        return _0x1c621b;
    };
}

function cuteText(_0x39072d) {
    var _0x46d969 = _0x3e3222;
    if (_0x39072d[_0x46d969(0x305)]() === '') return '';
    qi = -0x1;
    var _0x300e22 = boundingString(Math[_0x46d969(0x7b)](Math['random']() * 0x2) + 0x1);
    return _0x300e22 + _0x46d969(0xe4) + _0x39072d[_0x46d969(0x40c)](/([!?.]+)/gi)[_0x46d969(0x27c)](cuteSentence)['join']('') + '\x20\x20🎀\x20\x20' + esrever[_0x46d969(0x121)](_0x300e22);
}

function cuteSentence(_0x35212b) {
    var _0x34990d = _0x3e3222;
    return _0x35212b['split'](/([\s,]+)/gi)['map'](cuteWord)[_0x34990d(0x209)]('');
}

function cuteWord(_0x121d09) {
    var _0x2870f2 = _0x3e3222;
    if (_0x121d09 === '' || /[[!?.\s,]+]/gi [_0x2870f2(0x3a)](_0x121d09)) return _0x121d09;
    return _0x121d09 = roundReplace(_0x121d09), _0x121d09 = punctReplace(_0x121d09), _0x121d09 = emojiReplace(_0x121d09), scriptify(_0x121d09);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x2a9039) {
    var _0x10a51d = _0x3e3222;
    return _0x2a9039[_0x10a51d(0x40c)]('')['map'](function(_0x379575) {
        if (_0x379575 === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x379575 === '?') return randomElement(['¿', '?']);
            else {
                if (_0x379575 === '\x22') return quotes();
                else return _0x379575;
            }
        }
    })[_0x10a51d(0x209)]('');
}

function emojiReplace(_0x1f3572) {
    var _0x52c00a = _0x3e3222;
    return _0x1f3572[_0x52c00a(0x236)](':)', randomElement(emoji[':)']))['replace']('(:', randomElement(emoji[':)']))[_0x52c00a(0x236)]('^^', randomElement(emoji['^^']))['replace'](':P', randomElement(emoji[':p']))[_0x52c00a(0x236)](':p', randomElement(emoji[':p']))['replace'](':D', randomElement(emoji[':D']))[_0x52c00a(0x236)]('<3', randomElement(emoji['<3']))[_0x52c00a(0x236)](_0x52c00a(0x3e9), randomElement(emoji['(y)']))[_0x52c00a(0x236)](_0x52c00a(0x24a), randomElement(emoji[_0x52c00a(0x3e9)]));
}

function roundReplace(_0x4532d6) {
    var _0x19dfc5 = _0x3e3222;
    return _0x4532d6[_0x19dfc5(0x40c)]('')[_0x19dfc5(0x27c)](function(_0x151c4b) {
        var _0x52e0f4 = _0x19dfc5;
        return _0x151c4b[_0x52e0f4(0x287)]() === 'o' || _0x151c4b === '0' ? randomElement(round) : _0x151c4b;
    })['join']('');
}
var emoji = {
        ':)': [_0x3e3222(0x101), _0x3e3222(0x205), '(ɔ◔‿◔)ɔ', _0x3e3222(0x1f1), _0x3e3222(0x3fe), '●‿●', _0x3e3222(0x21b), '😍', 'ツ', _0x3e3222(0x109), _0x3e3222(0x475), '(づ｡◕‿‿◕｡)づ', '(/◔◡◔)/', 's(^‿^)-b', _0x3e3222(0x5e), '(✿╹◡╹)', _0x3e3222(0xc3)],
        '^^': [_0x3e3222(0x51d), '(✿^▽^)', _0x3e3222(0x31e), _0x3e3222(0x1ca), _0x3e3222(0x1cf), _0x3e3222(0x1e2), _0x3e3222(0x127), _0x3e3222(0x21c), _0x3e3222(0x1b4), _0x3e3222(0x1c4), ''],
        ':p': [':Þ', ''],
        ':D': [_0x3e3222(0x43e), '(✿◕ᗜ◕)━♫.*･｡ﾟ', _0x3e3222(0x125)],
        '<3': ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'],
        '(y)': ['👍', '👌']
    },
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x3e3222(0xb2), _0x3e3222(0x5a), _0x3e3222(0x370), _0x3e3222(0x28), _0x3e3222(0x36a), _0x3e3222(0x360), _0x3e3222(0x173), _0x3e3222(0x200), _0x3e3222(0x217), '•°¯`••\x20', _0x3e3222(0xfd), '*´¯`*.¸¸.*´¯`*\x20', _0x3e3222(0xb6), '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', _0x3e3222(0x3da), '¸„.-•~¹°”ˆ˜¨\x20', _0x3e3222(0x307), '••¤(`×', _0x3e3222(0x142), _0x3e3222(0x35a), _0x3e3222(0x4db), '.o0×X×0o.\x20', _0x3e3222(0x347), _0x3e3222(0x3a6), _0x3e3222(0x1ee), _0x3e3222(0x132), '••.•´¯`•.••\x20', '.•°¤*(¯`★´¯)*¤°\x20', _0x3e3222(0x3b3), _0x3e3222(0x466), _0x3e3222(0xe), _0x3e3222(0x2b), '▀▄▀▄▀▄\x20', _0x3e3222(0x38a)];

function boundingString(_0x4fea15) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x4fea15);
}

function foodString(_0xf5983c) {
    var _0x13a7d9 = _0x3e3222;
    return new Array(_0xf5983c + 0x1)['join']('0')[_0x13a7d9(0x40c)]('')[_0x13a7d9(0x27c)](function(_0x3a6d4c) {
        return randomElement(food);
    })['join']('\x20⋆\x20');
}

function twinkleString(_0xadde5c) {
    var _0x295e7a = _0x3e3222;
    return new Array(_0xadde5c + 0x1)[_0x295e7a(0x209)]('0')[_0x295e7a(0x40c)]('')[_0x295e7a(0x27c)](function() {
        return randomElement(twinkles);
    })[_0x295e7a(0x209)]('');
}

function animalString(_0x3e2ef5) {
    var _0x1067a6 = _0x3e3222;
    return new Array(_0x3e2ef5 + 0x1)[_0x1067a6(0x209)]('0')[_0x1067a6(0x40c)]('')[_0x1067a6(0x27c)](function(_0x491653) {
        return randomElement(animals);
    })[_0x1067a6(0x209)](_0x1067a6(0x2ee));
}

function flourishString(_0x203a23) {
    return randomElement(flourish);
}

function scriptify(_0xea7951) {
    var _0x385076 = _0x3e3222,
        _0x152a47 = {
            0x0: '𝟢',
            0x1: '𝟣',
            0x2: '𝟤',
            0x3: '𝟥',
            0x4: '𝟦',
            0x5: '𝟧',
            0x6: '𝟨',
            0x7: '𝟩',
            0x8: '𝟪',
            0x9: '𝟫',
            'a': '𝒶',
            'b': '𝒷',
            'c': '𝒸',
            'd': '𝒹',
            'e': '𝑒',
            'f': '𝒻',
            'g': '𝑔',
            'h': '𝒽',
            'i': '𝒾',
            'j': '𝒿',
            'k': '𝓀',
            'l': '𝓁',
            'm': '𝓂',
            'n': '𝓃',
            'o': '𝑜',
            'p': '𝓅',
            'q': '𝓆',
            'r': '𝓇',
            's': '𝓈',
            't': '𝓉',
            'u': '𝓊',
            'v': '𝓋',
            'w': '𝓌',
            'x': '𝓍',
            'y': '𝓎',
            'z': '𝓏',
            'A': '𝒜',
            'B': '𝐵',
            'C': '𝒞',
            'D': '𝒟',
            'E': '𝐸',
            'F': '𝐹',
            'G': '𝒢',
            'H': '𝐻',
            'I': '𝐼',
            'J': '𝒥',
            'K': '𝒦',
            'L': '𝐿',
            'M': '𝑀',
            'N': '𝒩',
            'O': '𝒪',
            'P': '𝒫',
            'Q': '𝒬',
            'R': '𝑅',
            'S': '𝒮',
            'T': '𝒯',
            'U': '𝒰',
            'V': '𝒱',
            'W': '𝒲',
            'X': '𝒳',
            'Y': '𝒴',
            'Z': '𝒵'
        },
        _0x312e5e = _0xea7951[_0x385076(0x40c)]('');
    for (var _0x4f8c70 = 0x0; _0x4f8c70 < _0x312e5e['length']; _0x4f8c70++) {
        _0x152a47[_0x312e5e[_0x4f8c70][_0x385076(0x287)]()] && (_0x312e5e[_0x4f8c70] = _0x152a47[_0x312e5e[_0x4f8c70]]);
    }
    return _0xea7951 = _0x312e5e['join'](''), _0xea7951;
}

function shuffleArray(_0x1453fc) {
    var _0x2f072d = _0x3e3222,
        _0x2480bc = _0x1453fc[_0x2f072d(0x40)],
        _0x4ca773, _0x358c3f;
    while (0x0 !== _0x2480bc) {
        _0x358c3f = Math[_0x2f072d(0x7b)](Math['random']() * _0x2480bc), _0x2480bc -= 0x1, _0x4ca773 = _0x1453fc[_0x2480bc], _0x1453fc[_0x2480bc] = _0x1453fc[_0x358c3f], _0x1453fc[_0x358c3f] = _0x4ca773;
    }
    return _0x1453fc;
}

function randomElement(_0x1b4145) {
    var _0x406aa4 = _0x3e3222;
    return _0x1b4145[Math['floor'](Math[_0x406aa4(0x2bf)]() * _0x1b4145['length'])];
}! function(_0xcd31a4) {
    var _0x6179c1 = _0x3e3222,
        _0xa8d5be = _0x6179c1(0x44f) == typeof exports && exports,
        _0xac6734 = _0x6179c1(0x44f) == typeof module && module && module[_0x6179c1(0x478)] == _0xa8d5be && module,
        _0x178e7f = _0x6179c1(0x44f) == typeof global && global;
    (_0x178e7f['global'] === _0x178e7f || _0x178e7f['window'] === _0x178e7f) && (_0xcd31a4 = _0x178e7f);
    var _0x278e7e = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0xcb37da = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x155e32 = function(_0x36479d) {
            var _0x5cb393 = _0x6179c1;
            _0x36479d = _0x36479d[_0x5cb393(0x236)](_0x278e7e, function(_0x4d37a7, _0x2f67aa, _0x1e1b0f) {
                return _0x155e32(_0x1e1b0f) + _0x2f67aa;
            })[_0x5cb393(0x236)](_0xcb37da, _0x5cb393(0x443));
            for (var _0xf1cdec = '', _0x8e27a = _0x36479d[_0x5cb393(0x40)]; _0x8e27a--;) _0xf1cdec += _0x36479d[_0x5cb393(0x32c)](_0x8e27a);
            return _0xf1cdec;
        },
        _0x4f359f = {
            'version': _0x6179c1(0x10f),
            'reverse': _0x155e32
        };
    if (_0x6179c1(0x43d) == typeof define && _0x6179c1(0x44f) == typeof define[_0x6179c1(0x326)] && define[_0x6179c1(0x326)]) define(function() {
        return _0x4f359f;
    });
    else {
        if (_0xa8d5be && !_0xa8d5be['nodeType']) {
            if (_0xac6734) _0xac6734['exports'] = _0x4f359f;
            else {
                for (var _0x3a1d55 in _0x4f359f) _0x4f359f[_0x6179c1(0xc7)](_0x3a1d55) && (_0xa8d5be[_0x3a1d55] = _0x4f359f[_0x3a1d55]);
            }
        } else _0xcd31a4[_0x6179c1(0x380)] = _0x4f359f;
    }
}(this);

function fullCrazy(_0x560f38) {
    if (_0x560f38['trim']() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x560f38) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x3db770) {
    var _0x551ee7 = _0x3e3222;
    _0x3db770 = _0x3db770[_0x551ee7(0x40c)]('');
    for (var _0x2a9bf3 = 0x0; _0x2a9bf3 < _0x3db770['length']; _0x2a9bf3++) {
        _0x3db770[_0x2a9bf3] = crazifyCharacter(_0x3db770[_0x2a9bf3]);
    }
    return _0x3db770['join']('');
}

function crazifyCharacter(_0x4e924d) {
    var _0x2c4cb0 = _0x3e3222;
    _0x4e924d = _0x4e924d[_0x2c4cb0(0x287)]();
    var _0x46169d = {
        '&': '⅋',
        '%': ['⅍', '℀', '℁', '℆', '℅'],
        0x0: ['０', 'Ѳ', 'ʘ'],
        0x1: ['➀', '❶', '１'],
        0x2: ['２', '❷', '➁'],
        0x3: ['３', '❸', '➂'],
        0x4: ['４', '❹', '➃'],
        0x5: ['❺', '➄', '５'],
        0x6: ['６', '❻', '➅'],
        0x7: ['７', '❼', '➆'],
        0x8: ['８', '➇', '❽'],
        0x9: ['➈', '❾', '９'],
        '<': ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'],
        '>': _0x2c4cb0(0x458),
        '[': '【〖〘〚［',
        ']': _0x2c4cb0(0x1f0),
        '*': _0x2c4cb0(0x45a),
        'a': ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'],
        'b': ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'],
        'c': ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'],
        'd': ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'],
        'e': ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'],
        'f': ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'],
        'g': ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'],
        'h': ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'],
        'i': ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'],
        'j': ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'],
        'k': ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'],
        'l': ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'],
        'm': ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'],
        'n': ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'],
        'o': ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'],
        'p': ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'],
        'q': ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'],
        'r': ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'],
        's': ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'],
        't': ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'],
        'u': ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'],
        'v': ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'],
        'w': ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'],
        'x': ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'],
        'y': ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'],
        'z': ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ']
    };
    return _0x46169d[_0x4e924d] ? randomElement(_0x46169d[_0x4e924d]) : _0x4e924d;
}

function randomElement(_0x2ed334) {
    var _0x574796 = _0x3e3222;
    return _0x2ed334[Math[_0x574796(0x7b)](Math['random']() * _0x2ed334[_0x574796(0x40)])];
}

function randomSymbols(_0x24b808) {
    var _0x197499 = _0x3e3222,
        _0x30e78a = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x4fc5b6 = [];
    for (var _0xf46511 = 0x0; _0xf46511 < _0x24b808; _0xf46511++) _0x4fc5b6[_0x197499(0x4cc)](randomElement(_0x30e78a));
    return _0x4fc5b6[_0x197499(0x209)]('');
}

function randInt(_0x3f987e, _0x24f686) {
    var _0x1554e7 = _0x3e3222;
    return _0x3f987e + Math['floor'](Math[_0x1554e7(0x2bf)]() * (_0x24f686 - _0x3f987e + 0x1));
}
$(document)[_0x3e3222(0x438)](function() {
    var _0x15301e = _0x3e3222;
    $(_0x15301e(0x30c))['insertBefore'](_0x15301e(0x383)), $(_0x15301e(0x313))['on'](_0x15301e(0x22d), function() {
        var _0x3b9b94 = _0x15301e;
        $(_0x3b9b94(0x3a3) + $(this)[_0x3b9b94(0x21a)]() + _0x3b9b94(0x104))[_0x3b9b94(0x2)](_0x3b9b94(0x383));
    }), _0x2d7fe2(default_text), $(_0x15301e(0x249))['on']('input', function(_0x5e2f57) {
        var _0x7bf8b4 = _0x15301e;
        if ($('#Name-FF')[_0x7bf8b4(0x21a)]() < 0x1) _0x2d7fe2(default_text);
        else {
            var _0x103f2b = $(_0x7bf8b4(0x3ed))[_0x7bf8b4(0x21a)]();
            _0x2d7fe2(_0x103f2b);
        }
    });
    var _0x9c5c59 = window[_0x15301e(0x9e)][_0x15301e(0x436)],
        _0x321b8b = _0x9c5c59[_0x15301e(0x40c)](_0x15301e(0x3a8));
    urltext = _0x321b8b[0x1];
    urltext && (urltext = decodeURIComponent(urltext), $('#Sk-text')['val'](urltext), _0x2d7fe2(urltext));

    function _0x2d7fe2(_0x6a4eb0) {
        var _0x5093ba = _0x15301e;
        _0x6a4eb0 = _0x6a4eb0[_0x5093ba(0x305)](), $(_0x5093ba(0xc9))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's1')), $(_0x5093ba(0xc2))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's2')), $('.result-s3')[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's3')), $('.result-s4')[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's4')), $(_0x5093ba(0x9f))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's5')), $(_0x5093ba(0x2eb))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's6')), $(_0x5093ba(0x318))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's7')), $(_0x5093ba(0x4bb))['html'](Change(_0x6a4eb0, 's8')), $('.result-s9')[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's9')), $(_0x5093ba(0x499))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x17c))), $(_0x5093ba(0x3f7))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x285))), $('.result-s12')[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x331))), $(_0x5093ba(0x1ba))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x258))), $(_0x5093ba(0x482))['html'](Change(_0x6a4eb0, _0x5093ba(0x178))), $(_0x5093ba(0x105))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's15')), $('.result-s16')['html'](Change(_0x6a4eb0, _0x5093ba(0x480))), $('.result-s17')[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x47a))), $(_0x5093ba(0x99))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x279))), $(_0x5093ba(0x401))['html'](Change(_0x6a4eb0, 's19')), $(_0x5093ba(0x3c7))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x16e))), $(_0x5093ba(0x3d))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x19f))), $(_0x5093ba(0x4bf))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x47c))), $(_0x5093ba(0x1bc))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's23')), $(_0x5093ba(0x3d2))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x4a6))), $('.result-s25')[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x35c))), $(_0x5093ba(0x388))['html'](Change(_0x6a4eb0, _0x5093ba(0x3))), $(_0x5093ba(0x192))['html'](Change(_0x6a4eb0, _0x5093ba(0x39))), $(_0x5093ba(0x389))[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x290))), $(_0x5093ba(0x3cc))[_0x5093ba(0x16d)](Change(_0x6a4eb0, 's30')), $('.result-s31')[_0x5093ba(0x16d)](Change(_0x6a4eb0, _0x5093ba(0x170))), $(_0x5093ba(0x11d))[_0x5093ba(0x16d)](luni['tools'][_0x5093ba(0x15b)]['encode'](_0x6a4eb0)), $(_0x5093ba(0x428))['html'](applyCharMap(invertedSquaresCharMap, _0x6a4eb0)), $(_0x5093ba(0x41))[_0x5093ba(0x16d)](illuminati(_0x6a4eb0)), $(_0x5093ba(0x3f3))[_0x5093ba(0x16d)](textgun(_0x6a4eb0)), $('.minigame')['html'](minigame(_0x6a4eb0)), $(_0x5093ba(0x44c))['html'](pubggame1(_0x6a4eb0)), $(_0x5093ba(0x3d4))[_0x5093ba(0x16d)](pubggame2(_0x6a4eb0)), $(_0x5093ba(0x9b))['html'](pubggame3(_0x6a4eb0)), $(_0x5093ba(0x237))[_0x5093ba(0x16d)](bricks(_0x6a4eb0)), $(_0x5093ba(0x42d))[_0x5093ba(0x16d)](bigrus(_0x6a4eb0)), $(_0x5093ba(0x8))[_0x5093ba(0x16d)](applyCharMap(wideTextCharMap, _0x6a4eb0)), $(_0x5093ba(0x1f9))['html'](luni['tools'][_0x5093ba(0xc8)]['encode'](_0x6a4eb0)), $('.lunitoolsflipencode')['html'](luni['tools']['flip'][_0x5093ba(0x202)](_0x6a4eb0)), $('.squaresCharMap')['html'](applyCharMap(squaresCharMap, _0x6a4eb0)), $(_0x5093ba(0xbe))[_0x5093ba(0x16d)](luni['tools']['mirror'][_0x5093ba(0x202)](_0x6a4eb0)), $('.subscriptCharMap')['html'](applyCharMap(subscriptCharMap, _0x6a4eb0)), $(_0x5093ba(0x75))[_0x5093ba(0x16d)](applyCharMap(superscriptCharMap, _0x6a4eb0)), $(_0x5093ba(0x4f))['html'](applyCharMap(bentTextCharMap, _0x6a4eb0)), $(_0x5093ba(0x14d))['html'](applyCharMap(neonCharMap, _0x6a4eb0)), $(_0x5093ba(0x1ff))[_0x5093ba(0x16d)](applyCharMap(futureAlienCharMap, _0x6a4eb0)), $(_0x5093ba(0x4c0))[_0x5093ba(0x16d)](strikeThrough(_0x6a4eb0)), $(_0x5093ba(0x20a))[_0x5093ba(0x16d)](tildeStrikeThrough(_0x6a4eb0)), $(_0x5093ba(0x2e0))[_0x5093ba(0x16d)](slashThrough(_0x6a4eb0)), $(_0x5093ba(0xe2))['html'](underline(_0x6a4eb0)), $(_0x5093ba(0x23e))[_0x5093ba(0x16d)](doubleUnderline(_0x6a4eb0)), $(_0x5093ba(0x2d3))[_0x5093ba(0x16d)](luni['tools'][_0x5093ba(0x352)]['encode'](_0x6a4eb0)), $('.squiggleCharMap')[_0x5093ba(0x16d)](applyCharMap(squiggleCharMap, _0x6a4eb0)), $(_0x5093ba(0x48c))[_0x5093ba(0x16d)](applyCharMap(squiggle2CharMap, _0x6a4eb0)), $('.squiggle3CharMap')[_0x5093ba(0x16d)](applyCharMap(squiggle3CharMap, _0x6a4eb0)), $(_0x5093ba(0x4fd))['html'](applyCharMap(squiggle4CharMap, _0x6a4eb0)), $('.squiggle5CharMap')[_0x5093ba(0x16d)](applyCharMap(squiggle5CharMap, _0x6a4eb0)), $('.squiggle6CharMap')[_0x5093ba(0x16d)](applyCharMap(squiggle6CharMap, _0x6a4eb0)), $('.boldCharMap')['html'](applyCharMap(boldCharMap, _0x6a4eb0)), $(_0x5093ba(0x42f))['html'](luni[_0x5093ba(0x339)][_0x5093ba(0x94)][_0x5093ba(0x202)](_0x6a4eb0)), $('.lunisquares')[_0x5093ba(0x16d)](luni[_0x5093ba(0x339)]['squares']['encode'](_0x6a4eb0[_0x5093ba(0x252)]())), $(_0x5093ba(0x1f3))[_0x5093ba(0x16d)](applyCharMap(oldEnglishCharMap, _0x6a4eb0)), $('.medievalCharMap')[_0x5093ba(0x16d)](applyCharMap(medievalCharMap, _0x6a4eb0)), $('.cursiveCharMap')[_0x5093ba(0x16d)](applyCharMap(cursiveCharMap, _0x6a4eb0)), $('.scriptify')[_0x5093ba(0x16d)](scriptify(_0x6a4eb0)), $(_0x5093ba(0x4ce))[_0x5093ba(0x16d)](applyCharMap(doubleStruckCharMap, _0x6a4eb0)), $(_0x5093ba(0x146))['html'](applyCharMap(italicCharMap, _0x6a4eb0)), $(_0x5093ba(0x437))['html'](applyCharMap(boldItalicCharMap, _0x6a4eb0)), $(_0x5093ba(0x2d))[_0x5093ba(0x16d)](applyCharMap(monospaceCharMap, _0x6a4eb0)), $(_0x5093ba(0x523))[_0x5093ba(0x16d)](applyCharMap(upperAnglesCharMap, _0x6a4eb0)), $(_0x5093ba(0xdb))[_0x5093ba(0x16d)](applyCharMap(greekCharMap, _0x6a4eb0)), $(_0x5093ba(0x25b))[_0x5093ba(0x16d)](applyCharMap(symbolsCharMap, _0x6a4eb0)), $('.currencyCharMap')['html'](applyCharMap(currencyCharMap, _0x6a4eb0)), $(_0x5093ba(0x244))[_0x5093ba(0x16d)](applyCharMap(asianStyleCharMap, _0x6a4eb0)), $(_0x5093ba(0x3ab))[_0x5093ba(0x16d)](applyCharMap(asianStyle2CharMap, _0x6a4eb0)), $(_0x5093ba(0x528))['html'](thickBlockFramed(_0x6a4eb0)), $('.diametricAngleFrame')[_0x5093ba(0x16d)](diametricAngleFrame(_0x6a4eb0)), $(_0x5093ba(0xcf))[_0x5093ba(0x16d)](wavyJoiner(_0x6a4eb0)), $(_0x5093ba(0x201))[_0x5093ba(0x16d)](dottyJoiner(_0x6a4eb0)), $(_0x5093ba(0x15))[_0x5093ba(0x16d)](kirbyHug(_0x6a4eb0)), $('.vaporwaveText')[_0x5093ba(0x16d)](vaporwaveText(_0x6a4eb0)), $(_0x5093ba(0x2b2))[_0x5093ba(0x16d)](vaporwaveText1(_0x6a4eb0)), $(_0x5093ba(0x463))[_0x5093ba(0x16d)](vaporwaveText2(_0x6a4eb0)), $('.littleSparkles')[_0x5093ba(0x16d)](littleSparkles(_0x6a4eb0)), $(_0x5093ba(0xb7))[_0x5093ba(0x16d)](weirdBox(_0x6a4eb0)), $(_0x5093ba(0x5))[_0x5093ba(0x16d)](thickBox(_0x6a4eb0)), $(_0x5093ba(0x446))[_0x5093ba(0x16d)](zigzagJoiner(_0x6a4eb0)), $(_0x5093ba(0x4d4))[_0x5093ba(0x16d)](hashJoiner(_0x6a4eb0)), $(_0x5093ba(0x464))[_0x5093ba(0x16d)](starJoiner(_0x6a4eb0)), $('.connectedJoiner')['html'](connectedJoiner(_0x6a4eb0)), $(_0x5093ba(0x1c))['html'](arrowjoin(_0x6a4eb0)), $(_0x5093ba(0x3d9))[_0x5093ba(0x16d)](dotBoxtwo(_0x6a4eb0)), $('.dotBox')[_0x5093ba(0x16d)](dotBox(_0x6a4eb0)), $(_0x5093ba(0x2dd))[_0x5093ba(0x16d)](diametricBox(_0x6a4eb0)), $(_0x5093ba(0x25c))['html'](arrowBox(_0x6a4eb0)), $('.curlybrackets')[_0x5093ba(0x16d)](curlybrackets(_0x6a4eb0)), $(_0x5093ba(0x156))[_0x5093ba(0x16d)](singlewavyJoiner(_0x6a4eb0)), $(_0x5093ba(0x2e9))['html'](firework(_0x6a4eb0)), $(_0x5093ba(0x312))['html'](stinky(_0x6a4eb0)), $(_0x5093ba(0x1ae))[_0x5093ba(0x16d)](heartsBetween(_0x6a4eb0)), $(_0x5093ba(0x2c9))[_0x5093ba(0x16d)](arrowBelow(_0x6a4eb0)), $(_0x5093ba(0x3e3))['html'](crossAboveBelow(_0x6a4eb0)), $(_0x5093ba(0x6e))['html'](wingdings(_0x6a4eb0)), $(_0x5093ba(0x2c0))[_0x5093ba(0x16d)](fullCrazy(_0x6a4eb0)), $(_0x5093ba(0x1d8))[_0x5093ba(0x16d)](crazyWithFlourishOrSymbols(_0x6a4eb0)), $(_0x5093ba(0x16f))['html'](cuteText(_0x6a4eb0)), $('.star0')[_0x5093ba(0x16d)](star0(_0x6a4eb0)), $(_0x5093ba(0x2dc))['html'](star1(_0x6a4eb0)), $(_0x5093ba(0x41f))[_0x5093ba(0x16d)](star2(_0x6a4eb0)), $(_0x5093ba(0x515))['html'](star3(_0x6a4eb0)), $('.star4')[_0x5093ba(0x16d)](star4(_0x6a4eb0)), $(_0x5093ba(0x29d))['html'](star5(_0x6a4eb0)), $(_0x5093ba(0x390))[_0x5093ba(0x16d)](star6(_0x6a4eb0)), $(_0x5093ba(0x111))['html'](star7(_0x6a4eb0)), $('.star8')[_0x5093ba(0x16d)](star8(_0x6a4eb0)), $(_0x5093ba(0x2e6))['html'](star9(_0x6a4eb0)), $(_0x5093ba(0x1f6))[_0x5093ba(0x16d)](star10(_0x6a4eb0)), $(_0x5093ba(0x4b3))[_0x5093ba(0x16d)](heart0(_0x6a4eb0)), $(_0x5093ba(0x1ab))[_0x5093ba(0x16d)](heart1(_0x6a4eb0)), $(_0x5093ba(0xf5))[_0x5093ba(0x16d)](heart2(_0x6a4eb0)), $(_0x5093ba(0x340))['html'](heart3(_0x6a4eb0)), $(_0x5093ba(0x4d8))[_0x5093ba(0x16d)](heart4(_0x6a4eb0)), $(_0x5093ba(0x22a))[_0x5093ba(0x16d)](heart5(_0x6a4eb0)), $('.heart6')[_0x5093ba(0x16d)](heart6(_0x6a4eb0)), $(_0x5093ba(0x292))[_0x5093ba(0x16d)](heart7(_0x6a4eb0)), $(_0x5093ba(0x4e2))[_0x5093ba(0x16d)](emoticon0(_0x6a4eb0)), $(_0x5093ba(0x9d))[_0x5093ba(0x16d)](emoticon1(_0x6a4eb0)), $(_0x5093ba(0x220))[_0x5093ba(0x16d)](emoticon2(_0x6a4eb0)), $(_0x5093ba(0x439))[_0x5093ba(0x16d)](emoticon3(_0x6a4eb0)), $(_0x5093ba(0x128))[_0x5093ba(0x16d)](emoticon4(_0x6a4eb0)), $(_0x5093ba(0xb8))[_0x5093ba(0x16d)](emoticon5(_0x6a4eb0)), $(_0x5093ba(0x483))[_0x5093ba(0x16d)](emoticon6(_0x6a4eb0)), $(_0x5093ba(0x5b))[_0x5093ba(0x16d)](emoticon7(_0x6a4eb0)), $(_0x5093ba(0x486))[_0x5093ba(0x16d)](thankyou0(_0x6a4eb0)), $(_0x5093ba(0x1aa))[_0x5093ba(0x16d)](thankyou1(_0x6a4eb0)), $(_0x5093ba(0x135))[_0x5093ba(0x16d)](thankyou2(_0x6a4eb0)), $(_0x5093ba(0x420))['html'](thankyou3(_0x6a4eb0)), $(_0x5093ba(0x5c))[_0x5093ba(0x16d)](thankyou4(_0x6a4eb0)), $(_0x5093ba(0x93))[_0x5093ba(0x16d)](thankyou5(_0x6a4eb0)), $(_0x5093ba(0x165))[_0x5093ba(0x16d)](thankyou6(_0x6a4eb0)), $('.thankyou7')[_0x5093ba(0x16d)](thankyou7(_0x6a4eb0)), $(_0x5093ba(0x4a))[_0x5093ba(0x16d)](sad0(_0x6a4eb0)), $('.sad1')['html'](sad1(_0x6a4eb0)), $(_0x5093ba(0x450))['html'](sad2(_0x6a4eb0)), $('.sad3')[_0x5093ba(0x16d)](sad3(_0x6a4eb0)), $('.sad4')[_0x5093ba(0x16d)](sad4(_0x6a4eb0)), $('.sad5')[_0x5093ba(0x16d)](sad5(_0x6a4eb0)), $('.sad6')[_0x5093ba(0x16d)](sad6(_0x6a4eb0)), $(_0x5093ba(0x2a6))['html'](sad7(_0x6a4eb0)), $(_0x5093ba(0x158))[_0x5093ba(0x16d)](cuteText1(_0x6a4eb0)), $(_0x5093ba(0x1a2))[_0x5093ba(0x16d)](cuteText2(_0x6a4eb0)), $(_0x5093ba(0x7d))[_0x5093ba(0x16d)](cuteText3(_0x6a4eb0)), $('.cuteText4')['html'](cuteText4(_0x6a4eb0)), $('.cuteText5')[_0x5093ba(0x16d)](cuteText5(_0x6a4eb0)), $('.crazyWithFlourishOrSymbols1')[_0x5093ba(0x16d)](crazyWithFlourishOrSymbols1(_0x6a4eb0)), $('.crazyWithFlourishOrSymbols2')['html'](crazyWithFlourishOrSymbols2(_0x6a4eb0)), $(_0x5093ba(0x39a))[_0x5093ba(0x16d)](crazyWithFlourishOrSymbols3(_0x6a4eb0)), $(_0x5093ba(0x12b))[_0x5093ba(0x16d)](crazyWithFlourishOrSymbols4(_0x6a4eb0)), $(_0x5093ba(0x4f2))[_0x5093ba(0x16d)](crazyWithFlourishOrSymbols5(_0x6a4eb0)), $('.fullCrazy1')['html'](fullCrazy1(_0x6a4eb0)), $('.fullCrazy2')[_0x5093ba(0x16d)](fullCrazy2(_0x6a4eb0)), $(_0x5093ba(0x219))['html'](fullCrazy3(_0x6a4eb0)), $('.fullCrazy4')[_0x5093ba(0x16d)](fullCrazy4(_0x6a4eb0)), $(_0x5093ba(0x1cd))[_0x5093ba(0x16d)](fullCrazy5(_0x6a4eb0)), $(_0x5093ba(0x4ee))[_0x5093ba(0x16d)](wrap1(_0x6a4eb0)), $(_0x5093ba(0x229))[_0x5093ba(0x16d)](wrap2(_0x6a4eb0)), $(_0x5093ba(0x49f))[_0x5093ba(0x16d)](wrap3(_0x6a4eb0)), $(_0x5093ba(0x4fe))['html'](wrap4(_0x6a4eb0)), $(_0x5093ba(0x299))[_0x5093ba(0x16d)](wrap5(_0x6a4eb0));
    }
    $(_0x15301e(0x33c))['click'](function() {
        var _0x13c947 = _0x15301e;
        $(_0x13c947(0x4d9))[_0x13c947(0x21a)]('');
    });

    function _0x4effab() {
        var _0x102c08 = _0x15301e,
            _0x8eaa47 = document['querySelector'](_0x102c08(0x37f)),
            _0x39a789 = _0x8eaa47[_0x102c08(0x19a)]('.text');
        document['querySelectorAll'](_0x102c08(0x1ea))[_0x102c08(0x511)](_0x1831a4 => {
            var _0x3a6cca = _0x102c08;
            _0x1831a4[_0x3a6cca(0x14b)]('click', () => {
                var _0x497686 = _0x3a6cca;
                _0x39a789[_0x497686(0x356)] = _0x1831a4[_0x497686(0x19a)]('p')['innerText'], _0x467c47(_0x39a789), _0x8eaa47[_0x497686(0x141)]['add']('copied-show'), setTimeout(() => {
                    var _0x3dc3c2 = _0x497686;
                    _0x8eaa47['classList'][_0x3dc3c2(0x281)](_0x3dc3c2(0x207));
                }, 0x3e8);
            });
        });
    }
    _0x4effab();

    function _0x467c47(_0x324da0) {
        var _0x11a7e9 = _0x15301e,
            _0x5edfc5 = document[_0x11a7e9(0x46e)](_0x11a7e9(0x342));
        _0x5edfc5['value'] = _0x324da0[_0x11a7e9(0x372)] || _0x324da0[_0x11a7e9(0x356)], document[_0x11a7e9(0x383)]['appendChild'](_0x5edfc5), _0x5edfc5[_0x11a7e9(0x440)](), document[_0x11a7e9(0x3ac)](_0x11a7e9(0x508)), _0x5edfc5[_0x11a7e9(0x281)]();
    }
});
