var _0x50051f = _0x1fce,
    _0x342271 = (function() {
        var _0x34dc4f = !![];
        return function(_0x4d127f, _0x561a4e) {
            var _0x4dbeec = _0x34dc4f ? function() {
                var _0x1493a5 = _0x1fce;
                if (_0x561a4e) {
                    var _0x52388f = _0x561a4e[_0x1493a5(0x99)](_0x4d127f, arguments);
                    return _0x561a4e = null, _0x52388f;
                }
            } : function() {};
            return _0x34dc4f = ![], _0x4dbeec;
        };
    }()),
    _0x4553c5 = _0x342271(this, function() {
        var _0x18a010 = _0x1fce,
            _0x974ee3;
        try {
            var _0xdb9b3c = Function(_0x18a010(0x36a) + '{}.constructor(\x22return\x20this\x22)(\x20)' + ');');
            _0x974ee3 = _0xdb9b3c();
        } catch (_0x200fd9) {
            _0x974ee3 = window;
        }
        var _0x22afa2 = _0x974ee3['console'] = _0x974ee3[_0x18a010(0x3bb)] || {},
            _0x56af22 = [_0x18a010(0x181), _0x18a010(0x534), _0x18a010(0x56), _0x18a010(0x19b), _0x18a010(0x23d), _0x18a010(0x1a4), _0x18a010(0xc3)];
        for (var _0x2a5fbb = 0x0; _0x2a5fbb < _0x56af22[_0x18a010(0x353)]; _0x2a5fbb++) {
            var _0x2dd39d = _0x342271[_0x18a010(0xb8)][_0x18a010(0x1e2)][_0x18a010(0x2ea)](_0x342271),
                _0x498a33 = _0x56af22[_0x2a5fbb],
                _0x37c2a1 = _0x22afa2[_0x498a33] || _0x2dd39d;
            _0x2dd39d[_0x18a010(0x508)] = _0x342271[_0x18a010(0x2ea)](_0x342271), _0x2dd39d['toString'] = _0x37c2a1[_0x18a010(0x4d6)]['bind'](_0x37c2a1), _0x22afa2[_0x498a33] = _0x2dd39d;
        }
    });
_0x4553c5();
var normal = _0x50051f(0x4e3),
    default_text = _0x50051f(0x3da);

function applyCharMap(_0x26ceaa, _0x362617) {
    var _0x1cd2d7 = _0x50051f;
    let _0x59d25e = '';
    for (let _0x1ec930 of _0x362617[_0x1cd2d7(0x29c)]('')) {
        if (_0x26ceaa[_0x1ec930] !== undefined) _0x59d25e += _0x26ceaa[_0x1ec930];
        else {
            if (_0x26ceaa[_0x1ec930['toLowerCase']()] !== undefined) _0x59d25e += _0x26ceaa[_0x1ec930[_0x1cd2d7(0x22c)]()];
            else _0x59d25e += _0x1ec930;
        }
    }
    return _0x59d25e;
}

function invertedSquaresCharMapFun(_0x3390b6) {
    return applyCharMap(invertedSquaresCharMap, _0x3390b6);
}

function wideTextCharMapFun(_0x41c0d7) {
    return applyCharMap(wideTextCharMap, _0x41c0d7);
}

function squaresCharMapFun(_0x4d8500) {
    return applyCharMap(squaresCharMap, _0x4d8500);
}

function subscriptCharMapFun(_0x505c81) {
    return applyCharMap(subscriptCharMap, _0x505c81);
}

function bentTextCharMapFun(_0x5a1e2e) {
    return applyCharMap(bentTextCharMap, _0x5a1e2e);
}

function neonCharMapFun(_0x13ce00) {
    return applyCharMap(neonCharMap, _0x13ce00);
}

function futureAlienCharMapFun(_0x5d87c8) {
    return applyCharMap(futureAlienCharMap, _0x5d87c8);
}

function squiggleCharMapFun(_0x129865) {
    return applyCharMap(squiggleCharMap, _0x129865);
}

function squiggle2CharMapFun(_0x41e2b3) {
    return applyCharMap(squiggle2CharMap, _0x41e2b3);
}

function squiggle3CharMapFun(_0x3a80f9) {
    return applyCharMap(squiggle3CharMap, _0x3a80f9);
}

function squiggle4CharMapFun(_0x108883) {
    return applyCharMap(squiggle4CharMap, _0x108883);
}

function squiggle5CharMapFun(_0x3003ab) {
    return applyCharMap(squiggle5CharMap, _0x3003ab);
}

function squiggle6CharMapFun(_0x349d1a) {
    return applyCharMap(squiggle6CharMap, _0x349d1a);
}

function boldCharMapFun(_0x289787) {
    return applyCharMap(boldCharMap, _0x289787);
}

function oldEnglishCharMapFun(_0x3f0da1) {
    return applyCharMap(oldEnglishCharMap, _0x3f0da1);
}

function medievalCharMapFun(_0x4879fb) {
    return applyCharMap(medievalCharMap, _0x4879fb);
}

function cursiveCharMapFun(_0x37171a) {
    return applyCharMap(cursiveCharMap, _0x37171a);
}

function doubleStruckCharMapFun(_0x443dee) {
    return applyCharMap(doubleStruckCharMap, _0x443dee);
}

function italicCharMapFun(_0x1800f9) {
    return applyCharMap(italicCharMap, _0x1800f9);
}

function boldItalicCharMapFun(_0x402371) {
    return applyCharMap(boldItalicCharMap, _0x402371);
}

function monospaceCharMapFun(_0x660be2) {
    return applyCharMap(monospaceCharMap, _0x660be2);
}

function upperAnglesCharMapFun(_0x4cc350) {
    return applyCharMap(upperAnglesCharMap, _0x4cc350);
}

function greekCharMapFun(_0x5555dd) {
    return applyCharMap(greekCharMap, _0x5555dd);
}

function symbolsCharMapFun(_0x59c42c) {
    return applyCharMap(symbolsCharMap, _0x59c42c);
}

function currencyCharMapFun(_0x536018) {
    return applyCharMap(currencyCharMap, _0x536018);
}

function asianStyleCharMapFun(_0x1bdb88) {
    return applyCharMap(asianStyleCharMap, _0x1bdb88);
}

function asianStyle2CharMapFun(_0x1bca76) {
    return applyCharMap(asianStyle2CharMap, _0x1bca76);
}
var luni = new Lunicode();
luni[_0x50051f(0x2d8)][_0x50051f(0x4b3)]['options']['maxHeight'] = 0xa;

function crazyWithFlourishOrSymbols(_0x1262ec) {
    var _0x17f6eb = _0x50051f;
    if (Math[_0x17f6eb(0x58)]() < 0.7) return wrapInSymbols(crazifyText(_0x1262ec), 0x2);
    else return wrapInFlourish(crazifyText(_0x1262ec), 0x2);
}

function illuminati(_0x172d0d) {
    var _0x2e0397 = _0x50051f;
    return _0x2e0397(0x2d4) + luni[_0x2e0397(0x2d8)][_0x2e0397(0xa1)]['encode'](_0x172d0d) + '࿐';
}

function textgun(_0x3a9696) {
    var _0x337de4 = _0x50051f;
    return _0x337de4(0x12e) + _0x3a9696[_0x337de4(0x29c)]('')[_0x337de4(0x4f7)]('&#823;') + _0x337de4(0x429);
}

function minigame(_0xc83641) {
    var _0x407c8a = _0x50051f;
    return _0x407c8a(0x78) + luni['tools'][_0x407c8a(0x199)][_0x407c8a(0x79)](_0xc83641) + ']彡★';
}

function pubggame1(_0x5d3e3f) {
    return applyCharMap(cursiveCharMap, '༒☬' + _0x5d3e3f + '☬༒');
}

function pubggame2(_0x10b655) {
    var _0x1bea2d = _0x50051f;
    return applyCharMap(cursiveCharMap, _0x1bea2d(0x347) + _0x10b655 + _0x1bea2d(0x323));
}

function pubggame3(_0x23bd2d) {
    var _0x12c3b4 = _0x50051f;
    return applyCharMap(invertedSquaresCharMap, _0x12c3b4(0x4ef) + _0x23bd2d + '𒆜𓊉꧂');
}

function bricks(_0x261d96) {
    var _0x1ed17f = _0x50051f;
    return applyCharMap(doubleStruckCharMap, _0x1ed17f(0x48a) + _0x261d96 + _0x1ed17f(0x161));
}

function bigrus(_0xaab418) {
    var _0x39e817 = _0x50051f;
    return applyCharMap(boldItalicCharMap, _0x39e817(0x345) + _0xaab418 + _0x39e817(0x17f));
}

function strikeThrough(_0x39ed2d) {
    var _0x25c349 = _0x50051f;
    return _0x39ed2d[_0x25c349(0x29c)]('')[_0x25c349(0x4f7)]('̶') + '̶';
}

function tildeStrikeThrough(_0x542ed9) {
    return _0x542ed9['split']('')['join']('̴') + '̴';
}

function underline(_0x3a5aec) {
    var _0x3aea73 = _0x50051f;
    return _0x3a5aec[_0x3aea73(0x29c)]('')[_0x3aea73(0x4f7)]('̲') + '̲';
}

function doubleUnderline(_0x4fb120) {
    var _0x108f3e = _0x50051f;
    return _0x4fb120[_0x108f3e(0x29c)]('')[_0x108f3e(0x4f7)]('̳') + '̳';
}

function slashThrough(_0xea0ed0) {
    var _0x1ea44d = _0x50051f;
    return _0xea0ed0[_0x1ea44d(0x29c)]('')['join']('̷') + '̷';
}

function _0x2c91() {
    var _0x28a9ef = ['&#4318;', '&#276;', '💖´\x20*•.¸♥¸.•**\x20', '&#1337;', '(✿╹◡╹)', '&#120473;&#823;', '.wrap4', 'E&#826;', '🕕︎', '\x20⋆\x20', '.wideTextCharMap', '&#10122;', 'max', 'push', '.PubgIsimleri', '.sad0', '&#5397;', 'U&#857;', '\x20ıllıllı⭐🌟', '▀▄▀▄▀▄\x20[[text]]\x20▄▀▄▀▄▀', '░▒▓█\x20[[text]]\x20█▓▒░', '(|||❛︵❛.)', '&#1028;', '.star0', '(*ˊᗜˋ*)', 'a&#826;', 'p&#826;', '.cuteText4', '٭⊹•꧂', '🐣♖', '◠◡◠', '꜍$1꜉', 'L&#846;', '&#8467;', '(◍•ᴗ•◍)\x20ミ💖\x20', 'l&#838;', '&#3648;', '&#1008;', '.superscriptCharMap', '&#1180;', '&#623;', '&#41556;', '🖴︎', '&#9835;', 'h&#826;', '୧(•̀ᗝ•́)૭\x20[[text]]\x20୧(⇀‸↼‶)૭', '&ugrave;', '&#315;', 'innerText', '.crazyWithFlourishOrSymbols3', '&#41532;', '.sad6', '&#5196;', '&#41037;', '&#642;', '.result-s11', 'N&#838;', '&#12425;', '&#9812;', '⎝⎝✧GͥOͣDͫ✧⎠⎠', '📫︎', '(人◕‿◕)', '3&#838;', 'K&#846;', 's&#828;', '8&#857;', 'e&#838;', '&#120462;&#823;', '&#41976;', '·.¸¸.·♩♪♫\x20[[text]]\x20♫♪♩·.¸¸.·', '↫↫↫↫↫\x20[[text]]\x20↬↬↬↬↬', '.thickBlockFramed', '&#346;', '&#358;', '&#356;', '&#40984;', 'floor', '×º°”˜`”°º×\x20', '&#12552;', 'o&#830;', '๑۞๑,¸¸,ø¤º°`°๑۩\x20', '9&#826;', '.heart5', '(¯´•._.•\x20', '🕛︎', '&#41769;', 'info', 's19', 'random', '💣︎', 'p&#799;', 'n&#828;', '0&#828;', '&#2749;', 'randomization', '3&#829;&#851;', '➶➶➶➶➶\x20[[text]]\x20➷➷➷➷➷', 'G&#829;&#851;', 'f&#829;&#851;', 'D&#846;', '[̲̅$1]', '&#292;', 's29', '•´¯`•.\x20', '★｡\x20🎀', '+｡:.ﾟヽ(*´∀)ﾉﾟ', '&#5029;', 'Z&#846;', '&#2797;', '&#670;', '5&#829;&#851;', 'F&#830;', '3&#846;', 'u&#866;', 'E&#830;', '••¤(`×', '&#4308;', 'F&#846;', '&#385;', '7&#857;', '★彡[', 'encode', '&#1097;', '.minigame', '&#344;', '&#4329;', '&#12581;', 'u&#838;', 'y&#826;', '╰•★★\x20', '\x20●︿●', '&#2792;', '—(••÷[\x20', 'querySelector', 'N&#829;&#851;', '٭⊹¤.•⨳•.*☆✬\x20', '&#294;', 'V&#799;', '&#1059;', '&#4357;', 'html', 'trim', '&#413;', '&#416;', 'x&#830;', 'f&#799;', '&#41008;', 'v&#846;', 'K&#799;', '&#420;', 'x&#828;', 'R&#826;', '.star1', 'apply', 'K&#838;', 'y&#799;', '🖮︎', '6&#829;&#851;', '#Sk-text', '&#377;', '.thankyou4', 'bubbles', '&#10128;', '&#943;', '&forall;', '.oldEnglishCharMap', '7&#826;', '&#42075;', ']\x20𒆜𓊉꧂', '7&#838;', 'esrever', '&#5597;', 'Z&#866;', '&#120438;&#823;', 'm&#829;&#851;', 'm&#830;', 't&#866;', '&#438;', '&#669;', '.weirdBox', '•._.••´¯``•.¸¸.•`\x20', '1&#866;', '&#404;', '&#422;', 'constructor', '&#972;', 'L&#857;', '.bigrus', '.result-s30', 'J&#829;&#851;', '&#652;', '&#41203;', '.heart0', 'C&#830;', '&#10124;', 'trace', '🖲︎', 'e&#826;', '&#2790;', '&#653;', '&#42131;', 'charCodeAt', '&#646;', 'addEventListener', '&#5623;', '&#40983;', '┗(^o^\x20)┓三\x20[[text]]\x20三\x20┗(^o^\x20)┓', '.emoticon6', '&#41708;', '&#295;', 'Z&#829;&#851;', 'v&#799;', '.star9', 'squares', '8&#799;', '&#1087;', 'Z&#799;', '▀▄▀▄▀▄\x20', 'P&#857;', '】〗〙〛］', '&#941;', '.vaporwaveText', '.thankyou0', '.thickBox', '&#608;', 'S&#857;', '&#120449;&#823;', '(｀∀´)Ψ', 's12', 'A&#826;', '&#120478;&#823;', '&#987;', '.result-s26', '&#41823;', 'C&#826;', '🖬︎', '&#1359;', 'y&#846;', 'E&#866;', 'reverse', '&Oslash;', '&iuml;', '【｡_｡】\x20[[text]]\x20【｡_｡】', '&Lambda;', 'P&#828;', 'j&#857;', 's11', '&#120468;&#823;', '&#372;', '[[text]]\x20☜(`o´)', '•._.••´¯``•.¸¸.•`\x20[[text]]\x20`•.¸¸.•´´¯`••._.•', '&epsilon;', 'add', '.heart6', 'P&#799;', 'r&#799;', 'options', 'z&#846;', 'j&#838;', '&#41266;', 'V&#846;', 's23', '.thankyou3', '&#614;', 'o&#828;', '&#1082;', '—(••÷[\x20[[text]]\x20]÷••)—', '&#65420;', '.crossAboveBelow', 'W&#846;', '.italicCharMap', 'diacriticsBottom', 'href', 'k&#828;', '&#41045;', 'I&#799;', '(｡◕‿◕｡)', '&#258;', '&kappa;', '&#5229;', '.result-s25', '&Gamma;', '&#341;', 'b&#846;', '.star7', 'l&#866;', 'g&#826;', '&#120458;&#823;', 'd&#838;', '&#41733;', 'w&#838;', '&#270;', 'X&#846;', '.result-s9', '6&#846;', 'O&#830;', 's26', '&#120828;&#823;', '&#41754;', '&#291;', 'Y&#828;', '.heart2', '▄︻デ', 's&#829;&#851;', '&#42130;', '.doubleStruckCharMap', '������', '&#355;', 'O&#846;', '&#40996;', 'f&#830;', '<(_\x20_*)>', '&#1044;', 'D&#828;', 't&#826;', '·.★·.·´¯`·.·★', '&#429;', 'H&#830;', '&#120483;&#823;', 'A&#866;', 's27', '★·.·´¯`·.·★.·', '.result-s17', '(¯´•._.•\x20[[text]]\x20•._.•´¯)', '(っ◔◡◔)っ\x20♥\x20', '&#418;', '\x20卐ॐ\x20ཌ꧂◤', '&#42171;', 'w&#826;', '&#2794;', 'value', '&#633;', '&#41126;', '&#120823;&#823;', 'getHTML', '(⌒‿⌒)', 'S&#829;&#851;', '🌟⭐ıllıllı', '.result-s23', '¨˜ˆ”°⍣~•✡⊹٭„¸\x20\x20', 'd&#846;', '╰☆☆\x20[[text]]\x20☆☆╮', '&#41155;', '&#4336;', '&#120479;&#823;', 'B&#866;', '.heart4', 'location', '3&#866;', 'f&#857;', '[[text]]', 's18', 'I&#846;', '♥⊱ღ', '&#5500;', '.heartsBetween', '(づ｡◕‿‿◕｡)づ\x20', 'R&#830;', 's17', 'H&#828;', 'm&#857;', 'U&#826;', '&#41433;', '🎯🍧', '&#406;', 'W&#829;&#851;', '♡〜ლ(๑癶\x20', 'W&#838;', '&#120469;&#823;', '&#120825;&#823;', '&#9790;', '**•.¸♥¸.•*´💖', '.tildeStrikeThrough', '🕙︎', '&iota;', '↤↤↤↤↤\x20[[text]]\x20↦↦↦↦↦', 'ミミ◦❧◦°˚°◦.¸¸◦°´❤*•.¸♥\x20\x20', 'ღ(¯`◕‿◕´¯)\x20♫\x20♪\x20♫\x20[[text]]\x20♫\x20♪\x20♫\x20(¯`◕‿◕´¯)ღ', '🕔︎', '&#327;', 'ready', '.fullCrazy2', '⫷\x20[[text]]\x20⫸', '♥࿐٭', '◔◡◔', 'log', 'E&#838;', 's25', '&#41991;', 'k&#838;', 'F&#799;', 'n&#866;', '🖰︎', 's31', 'K&#828;', '«-(¯`v´¯)-«\x20', '&#1141;', '&#8355;', '&#1111;', '.result-s13', 'T&#866;', '°°°·.°·..·°¯°·._.·\x20[[text]]\x20·._.·°¯°·.·°\x20.·°°°', '&#41029;', '&#9815;', '<style>\x20//\x20Discord\x20Fonts\x20by\x20:PubgIsimleri@gmail.com\x20</style>', '&#435;', '.result-s24', 'v&#866;', '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20\x20', 'tiny', '(¯`·.¸¸.·´¯`·.¸¸.->\x20', 'error', 'f&#826;', 'V&#838;', 'l&#828;', 'a&#799;', '.bentTextCharMap', 'L&#838;', '<style>\x20.PubgIsimleri\x20p{font-size:', '&#41392;', 'table', '🌘‿🌘\x20\x20', 'O&#838;', '&#323;', '&#613;', '•●◉✿\x20', '&fnof;', 'H&#829;&#851;', '&#647;', '&#391;', '&#1192;', '.cuteText3', 'L&#799;', 'amd', 'n&#846;', 'z&#828;', 'M&#829;&#851;', 'G&#828;', 'c&#799;', '(\x20◔\x20ʖ̯\x20◔\x20)\x20', '\x20¤]×´)¤••', '2&#829;&#851;', '&#639;', 'J&#846;', '&#120470;&#823;', 'щ（ﾟДﾟщ）\x20<\x20', 'fromCharCode', '(•◡•)', '&#545;', '&#586;', 'v&#828;', '♪ღ♪*•.¸¸.•*¨¨*•.♪\x20[[text]]\x20♪ღ♪*•.¸¸.•*¨¨*•.♪ღ♪', '&#4310;', 'X&#829;&#851;', 'M&#799;', 'i&#826;', '&#1041;', 'j&#828;', '&#41074;', '▌│█║▌║▌║\x20[[text]]\x20║▌║▌║█│▌', '&#120460;&#823;', '.result-s14', '&#41240;', '&#42015;', 'l&#846;', '7&#846;', '.thankyou6', '🌘‿🌘', '&#41079;', '&#2670;', '&#1060;', '&#8023;', '◦•●❤♡\x20', 'roundsquares', '.heart7', 'C&#829;&#851;', '&#5609;', 'T&#828;', '.heart3', '◥꧁ད\x20ॐ卐', 'A&#846;', 'Z&#828;', 'prototype', '4&#828;', 'v&#857;', 'G&#830;', '.thankyou1', 's&#857;', '&#5620;', '(*ゝω・)', '&#9739;', '1&#799;', '&#627;', '&#42150;', '&#41426;', 'i&#830;', '.neonCharMap', 'd&#799;', '.result-s15', '&#1488;', '&#5262;', '⦏$1&#x302;⦎', '&#5167;', '(^▽^)\x20\x20', '📄︎', 's15', 'Z&#857;', '🕆︎', '.pubggame3', 'H&#838;', '&#5845;', '8&#846;', 'v&#838;', 'init', 'C&#828;', '♥╣[-_-]╠♥', '(◕︿◕✿)\x20', '&#296;', '&#41042;', '&#595;', '&#120822;&#823;', '&#1202;', '&#120432;&#823;', '1&#846;', '2&#857;', 'y&#829;&#851;', '5&#828;', '&#1075;', '&#41120;', '&#409;', 'https://www.PubgIsimleri.com/?=', 'r&#830;', '.squiggle2CharMap', '&#41949;', 'copied-show', '*•.¸♡\x20[[text]]\x20♡¸.•*', '2&#826;', '&#41005;', '.strikeThrough', '&#654;', '&#41648;', '•?((¯°·._.•\x20[[text]]\x20•._.·°¯))؟•', '.arrowjoin', 'r&#826;', 'p&#838;', 'V&#829;&#851;', 'f&#866;', 'w&#829;&#851;', '.vaporwaveText1', '&#1046;', 'g&#857;', '.emoticon7', '.emoticon2', '&eta;', '&#120445;&#823;', '🕒︎', 'toLowerCase', 'appendChild', ',-*\x27\x20^\x20\x27~*-.,_,.-*~\x20[[text]]\x20~*-.,_,.-*~\x27\x20^\x20\x27*-,', 'k&#846;', '7&#830;', 'e&#828;', '1&#857;', '&#412;', 'h&#799;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', 's22', '.squiggle3CharMap', 'x&#846;', '&#311;', '&#1291;', '&#41508;', '&#1185;', 'exception', '.emoticon1', '6&#828;', 'y&#866;', 'replace', '🕑︎', '.star2', '(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)', '∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ\x20[[text]]\x20ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙', 'E&#829;&#851;', '.sad7', '&#1179;', '&#5511;', '&#340;', '&#392;', '&Uacute;', 'nodeType', '3&#830;', '&#120456;&#823;', 'e&#829;&#851;', '&#592;', 'Y&#846;', '&#434;', '&#41204;', '&#1360;', 'T&#857;', '&#974;', 'm&#838;', '&#41007;', 'V&#866;', '&#5556;', 'd&#830;', 'X&#828;', 'y&#830;', '&#120826;&#823;', ']|I{•------»\x20[[text]]\x20«------•}I|[', '&#1213;', '.arrowBox', 'g&#829;&#851;', 'M&#830;', 'c&#828;', 'h&#830;', '¤¸¸.•´¯`•¸¸.•..>>\x20[[text]]\x20<<..•.¸¸•´¯`•.¸¸¤', '&#1358;', 'z&#799;', '☽≫≻≽≿⋝⋟⋑⊃⊐⊒⫸》＞❯❱', '📪︎', '.wavyJoiner', '2&#828;', 'b&#857;', 'I&#857;', '👍︎', 'j&#799;', '📬︎', '•?((¯°·._.•\x20', '.diametricBox', 'middle', 'N&#830;', '¸„٭⊹✡•~⍣°”ˆ˜¨', '🗄︎', 'y&#838;', 'select', '&#4330;', 'w&#866;', 'T&#846;', '.futureAlienCharMap', '&Delta;', 'flip', 't&#799;', 'B&#830;', 'm&#866;', '4&#857;', 'ᵔ⌣ᵔ', '♥¸.•*❤´°◦¸¸.◦°˚°◦☙◦彡彡', '&#1062;', '&#996;', '&sigmaf;', 'c&#866;', '.luniroundsquares', 'E&#828;', 'q&#829;&#851;', '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20', 'I&#830;', 'indexOf', '(^▽^)', 'px}\x20</style>', '*´¯`*.¸¸.*´¯`*\x20', 'Z&#830;', 'v&#826;', '&ETH;', '【〖〘〚［', '&#9837;', 'w&#857;', '3&#799;', '•°¯`••\x20[[text]]\x20••´¯°•', 'split', '&nu;', '&#1193;', '&#336;', '.result-s7', '(✿^▽^)', '╚»★«╝', '★⌒(●ゝω・)', '.lunitoolsbubbles', 'window', 'a&#838;', 't&#846;', 'ᵔᴥᵔ', '5&#830;', '&#313;', '｡*ﾟ.*.｡(っ\x20ᐛ\x20)っ✂╰⋃╯\x20[[text]]', 'D&#866;', '&#638;', '&#9773;', '&#10081;', '&#2799;', '.cursiveCharMap', 'n&#826;', '&#40974;', '.wrap1', 'o&#846;', 'n&#799;', '&#4335;', '(′︿‵｡)', '.thankyou7', '&#9687;', 'r&#857;', '.star3', '&sigma;', 'Q&#846;', '&#5610;', '&#120830;&#823;', '&#4317;', '(/◔◡◔)/', '&szlig;', 'Q&#866;', '&#10129;', 'D&#829;&#851;', 't&#857;', 's&#846;', '&#1506;', '&#548;', '★·.·´¯`·.·★\x20[[text]]\x20★·.·´¯`·.·★', '★★•╯', '&#321;', '.boldCharMap', '.dottyJoiner', '&#41296;', '\x20•°*”˜.•°*”˜', '0&#829;&#851;', 'K&#829;&#851;', '༄ᶦᶰᵈ᭄', '9&#866;', '.result-s19', '.squiggle4CharMap', 'tools', '&#3923;', 'H&#826;', 'Q&#826;', 'Q&#830;', '5&#846;', 'v&#829;&#851;', '&#41141;', '8&#829;&#851;', '(.﹒︠₋﹒︡.)\x20ﾟ😳☹', '.lunitoolstinyencode', '🕗︎', '×º°”˜`”°º×\x20[[text]]\x20×º°”˜`”°º×', '&#41575;', '&#411;', '&#1071;', '5&#857;', 'U&#829;&#851;', 'bind', 'r&#828;', '9&#846;', '&yen;', '&#41555;', 'N&#828;', '\x20.o0×X×0o.\x20[[text]]\x20.o0×X×0o.', '&#41863;', '🕭︎', 'T&#826;', 'h&#866;', '&#8627;', 'a&#829;&#851;', '&Omega;', '&Xi;', '📁︎', 'ᕕ(ᐛ)ᕗ', '.wrap2', '癶๑)ლ〜♡', 'p&#828;', 'L&#826;', 'g&#799;', '.•°¤*(¯`★´¯)*¤°\x20', '1&#828;', 'body', '&#120451;&#823;', '.result-s31', '&#41660;', '(y)', '.slashThrough', '&#5616;', 's30', '&#x', 'd&#828;', 'Q&#838;', '⦚$1⦚', '•´¯`•.\x20[[text]]\x20.•´¯`•', 'g&#866;', '&#490;', 'maxHeight', '&#10123;', 'ஜ۩۞۩ஜ\x20[[text]]\x20ஜ۩۞۩ஜ', 'p&#866;', '【$1】', 'ஜ۩۞۩ஜ', '&#20057;', '.result-s29', 'toUpperCase', '4&#846;', 'R&#857;', '.result-s12', 's(^‿^)-b', '&#1138;', 'J&#799;', '.wrap5', '.•♫•♬•\x20[[text]]\x20•♬•♫•.', '&#9834;', '༻༒۝', '&#9791;', 'V&#830;', '8&#830;', '$2$1', '&#41076;', '^ㅅ^', 'L&#830;', 'function', '🕘︎', '&#423;', '&#41751;', '☞ó\x20͜つò☞\x20\x20', 'F&#828;', '💜💘', '&#120824;&#823;', 'forEach', '『$1』', '.squiggle5CharMap', 'execCommand', '&#350;', '&#9736;', 'diacriticsMiddle', '🕚︎', '&#387;', 'mirror', 't&#828;', '&#1347;', '9&#799;', 'R&#838;', '(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧', '&#477;', '&#2414;', '🗏︎', '٭ᶦᶰᵈ᭄', '.result-s2', '۝༒༺', 'u&#828;', '◦•●◉✿\x20[[text]]\x20✿◉●•◦', '&#7918;', '`•.¸¸.•´´¯`••._.•\x20[[text]]\x20•._.••`¯´´•.¸¸.•`', '&#1397;', 'U&#830;', '&#120441;&#823;', 't&#830;', 'global', '&#1178;', '0&#857;', 'length', 'ミ★\x20', '꧁𓊈𒆜\x20[[text]]\x20𒆜𓊉꧂', '&#120454;&#823;', 'I&#828;', 'Y&#857;', 's20', '\x20.o0×X×0o.\x20', '🕖︎', 'b&#828;', 'test', 'input', '&#4315;', 'k&#866;', 'd&#866;', 'I&#829;&#851;', 'T&#838;', '&#9761;', 's14', '.lunicreepify', 'g&#838;', '&#41346;', '&#400;', 'return\x20(function()\x20', 'R&#828;', 'o&#826;', 'D&#838;', '¸,ø¤º°`°º¤ø,¸\x20[[text]]\x20¸,ø¤º°`°º¤ø,¸', '෴❤️෴\x20\x20', '`•.,¸¸,.•´¯\x20[[text]]\x20¯`•.,¸¸,.•´', '📂︎', 'B&#826;', '&#1348;', '.sad4', '&#1112;', '&#1283;', '╚»★«╝\x20', 'f&#846;', '.bricks', 'S&#799;', '&#41804;', 'h&#828;', '&#1377;', '.squiggleCharMap', '┏༼\x20◉\x20╭╮\x20◉༽┓\x20', '&#403;', '(¯`·.¸¸.->\x20°º\x20', '&#262;', 'mapInverse', 'b&#826;', '&#576;', '&#618;', '&#41053;', 'G&#857;', 'O&#866;', 'F&#857;', 'u&#829;&#851;', '🕮︎', 'j&#826;', 'click', 'j&#829;&#851;', '&#308;', 'F&#866;', '0&#838;', 'z&#829;&#851;', '¸„.-•~¹°”ˆ˜¨\x20', '&#120437;&#823;', '0&#846;', '&#1350;', 'val', '&#1349;', '&#1051;', '❀◕‿◕❀', 'Y&#830;', '1&#829;&#851;', ']|I{•------»\x20', '••.•´¯`•.••\x20', '&#5741;', '♦👺\x20（（●´∧｀●））', '°·.¸.·°¯°·.¸.·°¯°·.¸.->\x20', 'G&#826;', 'S&#826;', '&#381;', '&#10003;', '\x20»-(¯`v´¯)-»', 'bottom', '6&#838;', 'l&#830;', 'textarea', 'pop', '&#9796;', '🗐︎', '&#4327;', '&#1330;', 'r&#829;&#851;', 'T&#799;', '&#41674;', '&#1085;', '0&#866;', '&beta;', 'W&#799;', '6&#866;', '&#3182;', 'G&#799;', 'console', '&#120444;&#823;', 'round', '(Y)', 'O&#799;', '.boldItalicCharMap', '&#1095;', '&#401;', '.star6', '꧁༒༻☬ད\x20[[text]]\x20ཌ☬༺༒꧂', 'u&#846;', '.fullCrazy5', 'x&#826;', '&#120433;&#823;', 'H&#857;', '&#120480;&#823;', '.currencyCharMap', '.result-s1', '4&#866;', '&#120465;&#823;', '.crazyWithFlourishOrSymbols2', '.clear', '&#12579;', 'b&#829;&#851;', 'X&#857;', '♪(\x20^-^)/★,｡･:･ﾟ', '★彡\x20[[text]]\x20彡★', '.Sk-text', 'z&#857;', '&#998;', '.hashJoiner', 'Pubg\x20Isimleri.', 'N&#799;', '1&#826;', '⟦$1⟧', '.dotBoxtwo', 'J&#866;', 'V&#857;', '&#120459;&#823;', '▌│█║▌║▌║\x20', 'l&#857;', '&#1210;', 'l&#799;', '&#120448;&#823;', '&#120447;&#823;', '1&#830;', '.squaresCharMap', '&#120464;&#823;', '👌︎', '٩(˘◡˘)۶', '(･ω･)♪', 'h&#846;', '&#1105;', 't&#838;', '👻ൠ', '7&#829;&#851;', '&#7990;', 'charAt', '.result-s10', '.star5', '.result-s16', '🖃︎', '&#549;', '★·.·´¯`·.·★\x20', '2&#866;', 'K&#866;', '&oplus;', '&#42180;', '.result-s27', 'Y&#866;', '✿.｡.:*\x20☆:**:.\x20[[text]]\x20.:**:.☆*.:｡.✿', '&upsilon;', 'W&#857;', '.result-s21', '&#42159;', '9&#857;', 'undefined', '&#1094;', 's&#799;', '▁\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20[[text]]\x20█\x20▇\x20▆\x20▅\x20▄\x20▂\x20▁', '&thorn;', 'V&#826;', '&#120440;&#823;', '&#1103;', 'P&#829;&#851;', '&#1131;', '✬☆*.•⨳•.¤⊹٭', 'H&#866;', '&#3057;', '★¸.•☆•.¸★\x20', '⦑$1⦒', ',-*\x27^\x27~*-.,_,.-*~\x20', '⧼$1&#828;⧽', '.heart1', 's16', 'p&#830;', '&#272;', 'M&#838;', '&#1073;', '&#286;', '♪(･ω･)ﾉ', '&#120453;&#823;', 'e&#857;', '&#7828;', 'i&#846;', '4&#799;', '💖彡', '&#8857;', '&#1084;', 'B&#799;', '══━一', 'b&#838;', 'a&#830;', '&#42181;', '.subscriptCharMap', '&#9730;', '&#1340;', '&#41766;', '&#428;', '&#1344;', 'a&#828;', '.cuteText2', 'w&#846;', '&#942;', '&#351;', '&#41731;', 'Y&#838;', 'p&#846;', '&#394;', '╚»★«╝\x20[[text]]\x20╚»★«╝', 'R&#829;&#851;', '.copied', '&euro;', 'q&#857;', 'm&#826;', 'D&#826;', '˜”*°•.˜”*°•\x20', '★⡀.•☆•.★', '7&#866;', '✨✩✪✫✬✭✮✯✰✦✱✲✳✴✵✶✷֍֎✸✹✺✻✼✽✾✿❀❁❂❃❄★☆＊', 'U&#846;', '&#541;', '&#41922;', '&#120475;&#823;', '(✿◕ᗜ◕)━♫.*･｡ﾟ', '.lunitoolsmirrorencode', '&#8984;', '\x20║▌║▌║█│▌', '&#1338;', '&#1090;', 'N&#846;', '&#1356;', '&#65434;', '&#8134;', 'A&#829;&#851;', '&#41105;', '\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '°°°·.°·..·°¯°·._.·\x20', 'C&#838;', 'W&#826;', '&#9450;', 'exports', '.connectedJoiner', '&#41016;', '&micro;', 'q&#830;', '.cuteText', 'ﾟ･:,｡★＼(^-^\x20)♪', '&#41571;', '&#23610;', '.result-s18', '&chi;', 'U&#799;', 's&#866;', '&#120446;&#823;', '&#3619;', 's&#826;', 'A&#838;', 'W&#828;', '&#607;', '&#41295;', '&#374;', '&#41807;', '🏱︎', '(-_-)\x20[[text]]\x20(-_-)', '&#41833;', '&#4306;', '2&#846;', '&#1047;', 'd&#857;', '<:::::[]=¤\x20[[text]]\x20(▀̿̿Ĺ̯̿̿▀̿\x20̿)', '&#120477;&#823;', '🕐︎', '&omega;', '&#596;', 'G&#866;', '&#1171;', '&#1048;', 'x&#857;', '&#1056;', '&#5615;', 'diacriticsTop', 'map', '5&#826;', '&#41686;', 'H&#846;', 'o&#838;', 'ღ⊱♥', '(ㅅꈍ﹃ꈍ)*\x20[[text]]\x20*(ꈍ﹃ꈍㅅ)♡', '&#42128;', 'g&#830;', '.text', '5&#866;', '.sad2', 'ıllıllı\x20[[text]]\x20ıllıllı', '3&#828;', '\x20]÷••)—\x20', '&#1052;', 'p&#857;', '\x20▂\x20▄\x20▅\x20▆\x20▇\x20█\x20', '&#10125;', '.zigzagJoiner', '&#625;', '&#1092;', '&#41427;', 'P&#838;', 'F&#838;', 'L&#866;', '&#1351;', '&#120452;&#823;', 'y&#828;', '&#120827;&#823;', 'ஜ۩۞۩ஜ\x20', '§.•´¨\x27°÷•..×\x20', 'e&#830;', '.•°¤*(¯`★´¯)*¤°\x20[[text]]\x20°¤*(¯´★`¯)*¤°•.', 'O&#857;', '&#4331;', '&#42014;', '&#120482;&#823;', '&rho;', 'r&#838;', '.sad1', '.result-s20', 'ıllıllı\x20', 'a&#857;', 't&#829;&#851;', '&#3588;', 'creepify', '🖳︎', '&#120443;&#823;', 'o&#799;', 'F&#826;', '3&#826;', '&#120439;&#823;', '.o0×X×0o.\x20', '&#1043;', '&alpha;', '&#382;', '&#2798;', '&#41712;', '2&#799;', '<br>\x0a', '&Mu;', '&#310;', '&#41080;', '&#120463;&#823;', '.wingdings', '&otilde;', '&#645;', '&#120435;&#823;', '&#1333;', 'i&#838;', 'x&#829;&#851;', 'object', 'l&#826;', '-·=»‡«=·-\x20[[text]]\x20-·=»‡«=·-', '&#1139;', '&#484;', '💘🎀', '.textgun', '&#19973;', '✰.｡.✵°✵,¸.•✵´', 'toString', 'I&#866;', '🖫︎', '<%=\x20version\x20%>', '&part;', '🕈︎', 'insertBefore', '&#41157;', 'B&#838;', '(¯`*•.¸,¤°´✿.｡.:*\x20[[text]]\x20*.:｡.✿`°¤,¸.•*´¯)', 'Q&#829;&#851;', '&#410;', '.invertedSquaresCharMap', 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890', '&#1352;', 'l&#829;&#851;', 'w&#830;', 'L&#829;&#851;', '(oꆤ︵ꆤo)\x20', '&scaron;', 'J&#857;', 'hasOwnProperty', '꧁༒☬\x20[[text]]\x20☬༒꧂', 'u&#830;', '&#988;', '꧁𓊈𒆜', 'P&#846;', 'k&#857;', '&#120455;&#823;', 'D&#799;', 'O&#828;', 'b&#866;', 'J&#826;', 'join', 'f&#828;', '.scriptify', '&#10126;', 'a&#846;', 'n&#829;&#851;', 'x&#866;', '&#1331;', '&#5205;', 'u&#799;', 'D&#857;', '&#408;', '&#1065;', '&#447;', '&#1074;', '¸¸♬·¯·♩¸¸♪·¯·♫¸¸\x20[[text]]\x20¸¸♫·¯·♪¸¸♩·¯·♬¸¸', '6&#857;', '__proto__', 'C&#799;', '&phi;', '&#120829;&#823;', 'T&#829;&#851;', '═─◄█▓▒░', '🕓︎', 'W&#830;', '⚔️\x20[[text]]\x20⚔️', '9&#838;', 's&#838;', 'B&#846;', '🕯︎', 'F&#829;&#851;', '&#120434;&#823;', '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', '🕿︎', '7&#828;', '&#120436;&#823;', '&#10127;', 'remove', 'c&#857;', '&#268;', '&#5290;', 'M&#857;', '&#120474;&#823;', '.symbolsCharMap', '░▒▓█►─═\x20\x20[[text]]\x20═─◄█▓▒░', '&psi;', '•]••´º´•»\x20[[text]]\x20«•´º´••[•', '💧︎', '⎝⎝✧GͥOͣDͫ✧⎠⎠\x20[[text]]\x20⎝⎝✧GͥOͣDͫ✧⎠⎠', '&#9442;', 'G&#838;', '.cuteText5', '.:｡+ﾟ', '&dagger;', '(ω・*ゝ)', '(☝◞‸◟)☞', 'A&#857;', '&#41081;', '&#41706;', 'd&#829;&#851;', 'N&#857;', 'warn', 'B&#857;', '\x20\x20🎀\x20\x20', '.kirbyHug', '.result-s5', '.lunisquares', '(\x20ﾟ∀ﾟ)ﾉ【[[text]]】', '&#1079;', '.emoticon3', 'e&#799;', '.result-s22', '꧁•⊹٭', '|!¤*\x27~``~\x27*¤!|\x20[[text]]\x20|!¤*\x27~``~\x27*¤!|'];
    _0x2c91 = function() {
        return _0x28a9ef;
    };
    return _0x2c91();
}

function stinky(_0x241fd6) {
    var _0x1d0354 = _0x50051f;
    return _0x241fd6[_0x1d0354(0x29c)]('')[_0x1d0354(0x4f7)]('̾') + '̾';
}

function heartsBetween(_0x527250) {
    var _0x10cdb7 = _0x50051f;
    return _0x527250[_0x10cdb7(0x29c)]('')[_0x10cdb7(0x4f7)]('♥');
}

function arrowBelow(_0x467929) {
    var _0x27b3ca = _0x50051f;
    return _0x467929[_0x27b3ca(0x29c)]('')[_0x27b3ca(0x4f7)]('͎') + '͎';
}

function crossAboveBelow(_0x1f527b) {
    return _0x1f527b['split']('')['join']('͓̽') + '͓̽';
}
const wingdingsCharMap = {
    0x0: _0x50051f(0x2f9),
    0x1: _0x50051f(0x371),
    0x2: _0x50051f(0x1f8),
    0x3: _0x50051f(0x344),
    0x4: _0x50051f(0x3ae),
    0x5: _0x50051f(0x278),
    0x6: '⌛︎',
    0x7: _0x50051f(0x9c),
    0x8: _0x50051f(0x188),
    0x9: _0x50051f(0xc4),
    '!': '✏︎',
    '\x22': '✂︎',
    '#': '✁︎',
    '$': '👓︎',
    '%': _0x50051f(0x2f2),
    '&': _0x50051f(0x38c),
    '\x27': _0x50051f(0x514),
    '(': _0x50051f(0x518),
    ')': '✆︎',
    '*': '🖂︎',
    '+': _0x50051f(0x3f8),
    ',': _0x50051f(0x26b),
    '-': _0x50051f(0x3c),
    '.': _0x50051f(0x272),
    '/': '📭︎',
    ':': _0x50051f(0x4b4),
    ';': _0x50051f(0x2a),
    '<': _0x50051f(0x4d8),
    '=': _0x50051f(0xeb),
    '>': '✇︎',
    '?': '✍︎',
    'A': '✌︎',
    'B': _0x50051f(0x3eb),
    'C': _0x50051f(0x270),
    'D': '👎︎',
    'E': '☜︎',
    'F': '☞︎',
    'G': '☝︎',
    'H': '☟︎',
    'I': '✋︎',
    'J': '☺︎',
    'K': '😐︎',
    'L': '☹︎',
    'M': _0x50051f(0x59),
    'N': '☠︎',
    'O': '⚐︎',
    'P': _0x50051f(0x472),
    'Q': '✈︎',
    'R': '☼︎',
    'S': _0x50051f(0x526),
    'T': '❄︎',
    'U': _0x50051f(0x1fb),
    'V': '✞︎',
    'W': _0x50051f(0x4db),
    'X': '✠︎',
    'Y': '✡︎',
    'Z': '☪︎',
    '[': '☯︎',
    '\x5c': 'ॐ︎',
    ']': '☸︎',
    '^': '♈︎',
    '_': '♉︎',
    '`': '♊︎',
    'a': '♋︎',
    'b': '♌︎',
    'c': '♍︎',
    'd': '♎︎',
    'e': '♏︎',
    'f': '♐︎',
    'g': '♑︎',
    'h': '♒︎',
    'i': '♓︎',
    'j': '🙰',
    'k': '🙵',
    'l': '●︎',
    'm': '❍︎',
    'n': '■︎',
    'o': '□︎',
    'p': '◻︎',
    'q': '❑︎',
    'r': '❒︎',
    's': '⬧︎',
    't': '⧫︎',
    'u': '◆︎',
    'v': '❖︎',
    'w': '⬥︎',
    'x': '⌧︎',
    'y': '⍓︎',
    'z': '⌘︎',
    '{': '❀︎',
    '|': '✿︎',
    '}': '❝︎',
    '~': '❞︎',
    '\x20': '▯︎',
    '€': '⓪︎',
    '\x20': '①︎',
    '‚': '②︎',
    'ƒ': '③︎',
    '„': '④︎',
    '…': '⑤︎',
    '†': '⑥︎',
    '‡': '⑦︎',
    'ˆ': '⑧︎',
    '‰': '⑨︎',
    'Š': '⑩︎',
    '‹': '⓿︎',
    'Œ': '❶︎',
    '\x20': '❷︎',
    'Ž': '❸︎',
    '\x20': '❹︎',
    '\x20': '❺︎',
    '‘': '❻︎',
    '’': '❼︎',
    '“': '❽︎',
    '”': '❾︎',
    '•': '❿︎',
    '–': '◻︎',
    '—': '◻︎',
    '˜': '◻︎',
    '™': '◻︎',
    'š': '◻︎',
    '›': '◻︎',
    'œ': '◻︎',
    '\x20': '◻︎',
    'ž': '·︎',
    'Ÿ': '•︎',
    '¡': '○︎',
    '¢': '⭕︎',
    '£': '◻︎',
    '¤': '◉︎',
    '¥': '◎︎',
    '¦': '◻︎',
    '§': '▪︎',
    '¨': '◻︎',
    '©': '◻︎',
    'ª': '✦︎',
    '«': '★︎',
    '¬': '✶︎',
    '®': '✹︎',
    '¯': '✵︎',
    '°': '◻︎',
    '±': '⌖︎',
    '²': '⟡︎',
    '³': '⌑︎',
    '´': '◻︎',
    'µ': '✪︎',
    '¶': '✰︎',
    '·': _0x50051f(0x47b),
    '¸': _0x50051f(0x242),
    '¹': _0x50051f(0x22b),
    'º': _0x50051f(0x50e),
    '»': _0x50051f(0x17a),
    '¼': _0x50051f(0x8),
    '½': _0x50051f(0x35b),
    '¾': _0x50051f(0x2e3),
    '¿': _0x50051f(0x32c),
    'À': _0x50051f(0x175),
    'Á': _0x50051f(0x33a),
    'Â': _0x50051f(0x54),
    'Ã': '◻︎',
    'Ä': '◻︎',
    'Å': '◻︎',
    'Æ': '◻︎',
    'Ç': '◻︎',
    'È': '◻︎',
    'É': '◻︎',
    'Ê': '◻︎',
    'Ë': '◻︎',
    'Ì': '◻︎',
    'Í': '◻︎',
    'Î': '◻︎',
    'Ï': '◻︎',
    'Ð': '◻︎',
    'Ñ': '◻︎',
    'Ò': '◻︎',
    'Ó': '◻︎',
    'Ô': '◻︎',
    'Õ': '⌫︎',
    'Ö': '⌦︎',
    '×': '◻︎',
    'Ø': '➢︎',
    'Ù': '◻︎',
    'Ú': '◻︎',
    'Û': '◻︎',
    'Ü': '➲︎',
    'Ý': '◻︎',
    'Þ': '◻︎',
    'ß': '◻︎',
    'à': '◻︎',
    'á': '◻︎',
    'â': '◻︎',
    'ã': '◻︎',
    'ä': '◻︎',
    'å': '◻︎',
    'æ': '◻︎',
    'ç': '◻︎',
    'è': '➔︎',
    'é': '◻︎',
    'ê': '◻︎',
    'ë': '◻︎',
    'ì': '◻︎',
    'í': '◻︎',
    'î': '◻︎',
    'ï': '⇦︎',
    'ð': '⇨︎',
    'ñ': '⇧︎',
    'ò': '⇩︎',
    'ó': '⬄︎',
    'ô': '⇳︎',
    'õ': '⬀︎',
    'ö': '⬁︎',
    '÷': '⬃︎',
    'ø': '⬂︎',
    'ù': '▭︎',
    'ú': '▫︎',
    'û': '✗︎',
    'ü': '✓︎',
    'ý': '☒︎',
    'þ': '☑︎',
    'ÿ': '◻︎'
};

function wingdings(_0x1f0606) {
    var _0x552259 = _0x50051f;
    return _0x1f0606[_0x552259(0x29c)]('')[_0x552259(0x485)](function(_0x4b59e6) {
        return wingdingsCharMap[_0x4b59e6] ? wingdingsCharMap[_0x4b59e6] : _0x4b59e6;
    })[_0x552259(0x4f7)]('');
}
const vaporwaveCharMap = {
    '\x20': '\u3000',
    '`': '`',
    0x1: '１',
    0x2: '２',
    0x3: '３',
    0x4: '４',
    0x5: '５',
    0x6: '６',
    0x7: '７',
    0x8: '８',
    0x9: '９',
    0x0: '０',
    '-': '－',
    '=': '＝',
    '~': '~',
    '!': '！',
    '@': '＠',
    '#': '＃',
    '$': '＄',
    '%': '％',
    '^': '^',
    '&': '＆',
    '*': '＊',
    '(': '（',
    ')': '）',
    '_': '_',
    '+': '＋',
    'q': 'ｑ',
    'w': 'ｗ',
    'e': 'ｅ',
    'r': 'ｒ',
    't': 'ｔ',
    'y': 'ｙ',
    'u': 'ｕ',
    'i': 'ｉ',
    'o': 'ｏ',
    'p': 'ｐ',
    '[': '[',
    ']': ']',
    '\x5c': '\x5c',
    'Q': 'Ｑ',
    'W': 'Ｗ',
    'E': 'Ｅ',
    'R': 'Ｒ',
    'T': 'Ｔ',
    'Y': 'Ｙ',
    'U': 'Ｕ',
    'I': 'Ｉ',
    'O': 'Ｏ',
    'P': 'Ｐ',
    '{': '{',
    '}': '}',
    '|': '|',
    'a': 'ａ',
    's': 'ｓ',
    'd': 'ｄ',
    'f': 'ｆ',
    'g': 'ｇ',
    'h': 'ｈ',
    'j': 'ｊ',
    'k': 'ｋ',
    'l': 'ｌ',
    ';': '；',
    '\x27': '＇',
    'A': 'Ａ',
    'S': 'Ｓ',
    'D': 'Ｄ',
    'F': 'Ｆ',
    'G': 'Ｇ',
    'H': 'Ｈ',
    'J': 'Ｊ',
    'K': 'Ｋ',
    'L': 'Ｌ',
    ':': '：',
    '\x22': '\x22',
    'z': 'ｚ',
    'x': 'ｘ',
    'c': 'ｃ',
    'v': 'ｖ',
    'b': 'ｂ',
    'n': 'ｎ',
    'm': 'ｍ',
    ',': '，',
    '.': '．',
    '/': '／',
    'Z': 'Ｚ',
    'X': 'Ｘ',
    'C': 'Ｃ',
    'V': 'Ｖ',
    'B': 'Ｂ',
    'N': 'Ｎ',
    'M': 'Ｍ',
    '<': '<',
    '>': '>',
    '?': '？'
};

function vaporwaveText(_0x1e76ed) {
    var _0x3a9d1b = _0x50051f,
        _0x192c78 = _0x1e76ed[_0x3a9d1b(0x29c)]('\x20')['length'];
    _0x1e76ed = applyCharMap(vaporwaveCharMap, _0x1e76ed);
    var _0x4d8c45 = getAsianChars(Math[_0x3a9d1b(0xc)](0x3, _0x192c78));
    if (_0x192c78 > 0x6) _0x4d8c45 = _0x4d8c45[_0x3a9d1b(0x29c)]('')[_0x3a9d1b(0x485)](_0x4a408d => _0x4a408d + ['', ''][Math[_0x3a9d1b(0x3bd)](Math[_0x3a9d1b(0x58)]() * 0.6)])['join']('');
    var _0x11a650 = [];
    return _0x11a650[_0x3a9d1b(0xd)](_0x1e76ed), _0x11a650[_0x3a9d1b(0x4f7)]();
}

function vaporwaveText1(_0x53314d) {
    var _0x3e6935 = _0x50051f,
        _0x5b25d8 = _0x53314d[_0x3e6935(0x29c)]('\x20')['length'];
    _0x53314d = applyCharMap(vaporwaveCharMap, _0x53314d);
    var _0x386b62 = getAsianChars(Math[_0x3e6935(0xc)](0x3, _0x5b25d8));
    if (_0x5b25d8 > 0x6) _0x386b62 = _0x386b62[_0x3e6935(0x29c)]('')[_0x3e6935(0x485)](_0x3a1ac2 => _0x3a1ac2 + ['', ''][Math[_0x3e6935(0x3bd)](Math[_0x3e6935(0x58)]() * 0.6)])[_0x3e6935(0x4f7)]('');
    var _0x42f450 = [];
    return _0x42f450[_0x3e6935(0xd)](_0x53314d[_0x3e6935(0x241)](/　/g, '░')['replace'](/ａｅ/, 'æ')[_0x3e6935(0x241)](/Ａ/g, 'Λ')[_0x3e6935(0x241)](/Ｅ/g, function() {
        return Math['random']() > 0.5 ? 'Ξ' : 'Σ';
    })['replace'](/Ｏ/g, '♢')), _0x42f450[_0x3e6935(0x4f7)]();
}

function vaporwaveText2(_0x4c5c71) {
    var _0x4d58b3 = _0x50051f,
        _0x3c4faa = _0x4c5c71[_0x4d58b3(0x29c)]('\x20')[_0x4d58b3(0x353)];
    _0x4c5c71 = applyCharMap(vaporwaveCharMap, _0x4c5c71);
    var _0x2f4e27 = getAsianChars(Math[_0x4d58b3(0xc)](0x3, _0x3c4faa));
    if (_0x3c4faa > 0x6) _0x2f4e27 = _0x2f4e27[_0x4d58b3(0x29c)]('')[_0x4d58b3(0x485)](_0x4d1466 => _0x4d1466 + ['', ''][Math[_0x4d58b3(0x3bd)](Math[_0x4d58b3(0x58)]() * 0.6)])[_0x4d58b3(0x4f7)]('');
    var _0x370465 = [];
    return _0x370465[_0x4d58b3(0xd)]('【\ufeff' + _0x4c5c71 + '】'), _0x370465[_0x4d58b3(0x4f7)]();
}

function getAsianChars(_0x176b6f) {
    var _0x3328cb = _0x50051f;
    if (!_0x176b6f) _0x176b6f = 0x1;
    var _0x192f90 = 'リサフランク現代のコンピュ竹内\x20まりや若者が履く流行のスニーカー真夜中のドアホットドッグマスターストライカーソニーブギ新しい日の誕生ライフ\x20-\x20ヒスイ蒸気波\x20無線゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ゙゚゛゜ゝゞゟ亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育壱逸茨芋引印因咽姻員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科',
        _0x2d8ad9 = '';
    for (var _0x1ad89a = 0x0; _0x1ad89a < _0x176b6f; _0x1ad89a++) {
        _0x2d8ad9 += _0x192f90[Math[_0x3328cb(0x4c)](Math[_0x3328cb(0x58)]() * _0x192f90[_0x3328cb(0x353)])];
    }
    return _0x2d8ad9;
}
const flourishArray = [_0x50051f(0x4ec), '◥꧁ད\x20[[text]]\x20ཌ꧂◤', _0x50051f(0x2cb), _0x50051f(0x510), _0x50051f(0x3c4), _0x50051f(0x1c3), '◥꧁ད\x20ॐ卐[[text]]\x20卐ॐ\x20ཌ꧂◤', _0x50051f(0x53a), 'ღƪ(ˆ◡ˆ)ʃ♡\x20[[text]]\x20♡ƪ(ˆ◡ˆ)ʃ♪', _0x50051f(0xf9), _0x50051f(0x527), _0x50051f(0x479), _0x50051f(0x2ab), _0x50051f(0xce), _0x50051f(0x48b), '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯\x20[[text]]\x20¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯', _0x50051f(0x2d), _0x50051f(0x40a), _0x50051f(0x191), '¸,ø¤º°`°º¤ø,¸¸,ø¤º°\x20[[text]]\x20°º¤ø,¸¸,ø¤º°`°º¤ø,¸', _0x50051f(0x491), _0x50051f(0x21d), _0x50051f(0x1cb), _0x50051f(0x2e4), _0x50051f(0x525), _0x50051f(0x217), _0x50051f(0x155), _0x50051f(0x4a6), _0x50051f(0x143), _0x50051f(0x517), _0x50051f(0x14), _0x50051f(0x523), _0x50051f(0x3d5), _0x50051f(0x30e), '§.•´¨\x27°÷•..×\x20[[text]]\x20×,.•´¨\x27°÷•..§', _0x50051f(0x29b), _0x50051f(0x4df), _0x50051f(0x540), _0x50051f(0xfa), '¸„.-•~¹°”ˆ˜¨\x20[[text]]\x20¨˜ˆ”°¹~•-.„¸', _0x50051f(0x143), '••¤(`×[¤\x20[[text]]\x20¤]×´)¤••', '•´¯`•»\x20[[text]]\x20«•´¯`•', _0x50051f(0x2f0), _0x50051f(0x267), _0x50051f(0x10a), _0x50051f(0x36e), _0x50051f(0x34b), _0x50051f(0x22e), _0x50051f(0x370), _0x50051f(0x177), _0x50051f(0x60), _0x50051f(0x46), _0x50051f(0x45), _0x50051f(0xf2), _0x50051f(0x260), _0x50051f(0x13), _0x50051f(0x473), _0x50051f(0x30e), '-漫~*\x27¨¯¨\x27*·舞~\x20[[text]]\x20~舞*\x27¨¯¨\x27*·~漫-', '๑۞๑,¸¸,ø¤º°`°๑۩\x20[[text]]\x20๑۩\x20,¸¸,ø¤º°`°๑۞๑', _0x50051f(0x4a6), '••.•´¯`•.••\x20[[text]]\x20••.•´¯`•.••', _0x50051f(0x267), _0x50051f(0x349), _0x50051f(0x355), _0x50051f(0x43c), _0x50051f(0x17e), _0x50051f(0x4cf), _0x50051f(0x245), _0x50051f(0x506), _0x50051f(0x313), '¤\x20(¯´☆✭.¸_)¤\x20[[text]]\x20¤(_¸.✭☆´¯)\x20¤', '(¯`·.¸¸.·´¯`·.¸¸.->\x20[[text]]\x20<-.¸¸.·´¯`·.¸¸.·´¯)', _0x50051f(0x401), _0x50051f(0x321), _0x50051f(0x179), '«-(¯`v´¯)-«\x20[[text]]\x20»-(¯`v´¯)-»'];

function wrapInFlourish(_0x5c6a64) {
    var _0x4d8d51 = _0x50051f;
    return flourishArray[Math[_0x4d8d51(0x4c)](Math['random']() * flourishArray[_0x4d8d51(0x353)])][_0x4d8d51(0x241)](_0x4d8d51(0x15e), _0x5c6a64);
}

function Flourishlist(_0x3a3cfa, _0x23f969) {
    var _0x13f4d8 = _0x50051f;
    return flourishArray[_0x3a3cfa][_0x13f4d8(0x241)](_0x13f4d8(0x15e), _0x23f969);
}

function wrapInSymbols(_0x25abf1, _0x34bf4f) {
    return randomSymbols(_0x34bf4f) + '\x20\x20' + _0x25abf1 + '\x20\x20' + randomSymbols(_0x34bf4f);
}

function firework(_0x5b6acf) {
    var _0x10842f = _0x50051f;
    return _0x5b6acf[_0x10842f(0x29c)]('')[_0x10842f(0x4f7)]('҉') + '҉';
}

function weirdBox(_0x5f0348) {
    var _0x505abf = _0x50051f;
    return _0x5f0348[_0x505abf(0x241)](/([^\s])/g, _0x505abf(0x64));
}

function curlybrackets(_0x1e04c9) {
    var _0x51034e = _0x50051f;
    return _0x1e04c9[_0x51034e(0x241)](/([^\s])/g, _0x51034e(0x417));
}

function singlewavyJoiner(_0x5b1a32) {
    var _0x4c5b19 = _0x50051f;
    return '〜' + _0x5b1a32['split']('')[_0x4c5b19(0x4f7)]('∿') + '〜';
}

function thickBox(_0x358862) {
    var _0x36cb4d = _0x50051f;
    return _0x358862[_0x36cb4d(0x241)](/([^\s])/g, _0x36cb4d(0x3dd));
}

function zigzagJoiner(_0x1bdb92) {
    var _0x46fb13 = _0x50051f;
    return _0x1bdb92['replace'](/([^\s])/g, _0x46fb13(0x30d));
}

function hashJoiner(_0x252f0e) {
    var _0x405407 = _0x50051f;
    return _0x252f0e[_0x405407(0x29c)]('')[_0x405407(0x4f7)]('⨳');
}

function starJoiner(_0x143f91) {
    var _0x112f7f = _0x50051f;
    return _0x143f91[_0x112f7f(0x241)](/([^\s])/g, '⦚$1⦚');
}

function connectedJoiner(_0x5334f9) {
    var _0x480a5c = _0x50051f;
    return _0x5334f9[_0x480a5c(0x29c)]('')[_0x480a5c(0x4f7)]('⊶');
}

function arrowjoin(_0x30da85) {
    var _0x9ec742 = _0x50051f;
    return _0x30da85[_0x9ec742(0x241)](/([^\s])/g, _0x9ec742(0x1f5));
}

function dotBoxtwo(_0x596e5d) {
    var _0x5d0b49 = _0x50051f;
    return _0x596e5d[_0x5d0b49(0x29c)]('')[_0x5d0b49(0x4f7)]('&#778;\x20⫶');
}

function dotBox(_0x514ce7) {
    var _0x30f36b = _0x50051f;
    return _0x514ce7['replace'](/([^\s])/g, _0x30f36b(0x1f));
}

function diametricBox(_0x561011) {
    var _0x4aa616 = _0x50051f;
    return _0x561011[_0x4aa616(0x241)](/([^\s])/g, _0x4aa616(0x415));
}

function arrowBox(_0x45a9a9) {
    var _0x4f9b9e = _0x50051f;
    return _0x45a9a9[_0x4f9b9e(0x241)](/([^\s])/g, '⦏$1⦎');
}

function littleSparkles(_0x5bd49c) {
    var _0xcfb45 = _0x50051f;
    return _0xcfb45(0x443) + _0x5bd49c + _0xcfb45(0x2d1);
}

function kirbyHug(_0x3a4d6c) {
    var _0x48e1c9 = _0x50051f;
    return _0x48e1c9(0x144) + _0x3a4d6c + '\x20♥';
}

function dottyJoiner(_0x574713) {
    var _0x31036c = _0x50051f;
    return '░' + _0x574713['split']('')[_0x31036c(0x4f7)]('░') + '░';
}

function wavyJoiner(_0x4dca7c) {
    var _0x176d62 = _0x50051f;
    return '≋' + _0x4dca7c[_0x176d62(0x29c)]('')[_0x176d62(0x4f7)]('≋') + '≋';
}

function diametricAngleFrame(_0x2cfcfc) {
    var _0x35442a = _0x50051f;
    return _0x2cfcfc['replace'](/([^\s])/g, _0x35442a(0x334));
}

function thickBlockFramed(_0x104f48) {
    var _0x17aee7 = _0x50051f;
    return _0x104f48[_0x17aee7(0x241)](/([^\s])/g, _0x17aee7(0x315));
}

function star0(_0x202849) {
    var _0x14447d = _0x50051f;
    return applyCharMap(italicCharMap, _0x14447d(0x354) + _0x202849 + '★彡');
}

function star1(_0x47c0a4) {
    var _0x3cb591 = _0x50051f;
    return applyCharMap(monospaceCharMap, _0x3cb591(0x53f) + _0x47c0a4 + _0x3cb591(0x1c));
}

function star2(_0x22e9b0) {
    var _0x48e647 = _0x50051f;
    return applyCharMap(currencyCharMap, _0x48e647(0x12) + _0x22e9b0 + _0x48e647(0x151));
}

function star3(_0x2c4e04) {
    var _0x5e05cf = _0x50051f;
    return applyCharMap(monospaceCharMap, _0x5e05cf(0x81) + _0x2c4e04 + _0x5e05cf(0x2cc));
}

function star4(_0x1b5a84) {
    var _0x1ca8f3 = _0x50051f;
    return applyCharMap(squaresCharMap, '`✵•.¸,✵°✵.｡.✰\x20\x20' + _0x1b5a84 + _0x1ca8f3(0x4d5));
}

function star5(_0x39dbe7) {
    var _0x20a7c9 = _0x50051f;
    return applyCharMap(doubleStruckCharMap, _0x20a7c9(0x13b) + _0x39dbe7 + _0x20a7c9(0x141));
}

function star6(_0x2f9604) {
    var _0x3b1266 = _0x50051f;
    return applyCharMap(invertedSquaresCharMap, _0x3b1266(0x153) + _0x2f9604 + _0x3b1266(0x277));
}

function star7(_0x1c2e4e) {
    var _0x2b9b90 = _0x50051f;
    return applyCharMap(asianStyleCharMap, _0x2b9b90(0x277) + _0x1c2e4e + '¨˜ˆ”°⍣~•✡⊹٭„¸');
}

function star8(_0x230c1a) {
    var _0x27664a = _0x50051f;
    return applyCharMap(asianStyle2CharMap, _0x27664a(0x414) + _0x230c1a + _0x27664a(0x444));
}

function star9(_0x287588) {
    var _0x4817ab = _0x50051f;
    return applyCharMap(neonCharMap, _0x4817ab(0x87) + _0x287588 + _0x4817ab(0x411));
}

function star10(_0x56f265) {
    var _0x3bbc15 = _0x50051f;
    return applyCharMap(squiggle6CharMap, _0x3bbc15(0x87) + _0x56f265 + _0x3bbc15(0x411));
}

function heart0(_0x43f8a0) {
    var _0x4fd3cb = _0x50051f;
    return applyCharMap(squiggle5CharMap, _0x4fd3cb(0x22) + _0x43f8a0 + _0x4fd3cb(0x425));
}

function heart1(_0x1462c7) {
    var _0x1694a6 = _0x50051f;
    return applyCharMap(futureAlienCharMap, _0x1694a6(0x36f) + _0x1462c7 + '෴❤️෴');
}

function heart2(_0x51fe09) {
    var _0x5be0d5 = _0x50051f;
    return applyCharMap(boldCharMap, _0x5be0d5(0x2) + _0x51fe09 + _0x5be0d5(0x173));
}

function heart3(_0x1cca18) {
    var _0x3ec818 = _0x50051f;
    return applyCharMap(firework, _0x3ec818(0x16e) + _0x1cca18 + _0x3ec818(0x2fc));
}

function heart4(_0x37312e) {
    var _0x5e5b5d = _0x50051f;
    return applyCharMap(symbolsCharMap, _0x5e5b5d(0x1d8) + _0x37312e + '♡❤●•◦');
}

function heart5(_0x420dcd) {
    return applyCharMap(bentTextCharMap, '🌸ξξ(∵❤◡❤∵)ξξ·¯·♩¸\x20' + _0x420dcd + '¸♩·¯·ξξ(∵❤◡❤∵)ξξ🌸');
}

function heart6(_0x4bf6e5) {
    var _0x556e2b = _0x50051f;
    return applyCharMap(upperAnglesCharMap, '♥╣[-_-]╠♥' + _0x4bf6e5 + _0x556e2b(0x203));
}

function heart7(_0x1a05ea) {
    var _0x4acfc0 = _0x50051f;
    return applyCharMap(boldCharMap, _0x4acfc0(0x178) + _0x1a05ea + _0x4acfc0(0x286));
}

function emoticon0(_0x4ae38a) {
    var _0x38685a = _0x50051f;
    return applyCharMap(oldEnglishCharMap, '彡(✿╹◡╹)\x20' + _0x4ae38a + _0x38685a(0xe3));
}

function emoticon1(_0x536704) {
    var _0xa4d6f7 = _0x50051f;
    return applyCharMap(squiggle6CharMap, _0xa4d6f7(0x1bd) + _0x536704 + ')');
}

function emoticon2(_0x2059f4) {
    var _0xd5b96c = _0x50051f;
    return applyCharMap(boldCharMap, _0xd5b96c(0x32f) + _0x2059f4 + '');
}

function emoticon3(_0x3fb1fc) {
    var _0xce15ba = _0x50051f;
    return applyCharMap(squiggle5CharMap, _0xce15ba(0x52e) + _0x3fb1fc + '');
}

function emoticon4(_0x53b783) {
    var _0x3a2fe5 = _0x50051f;
    return applyCharMap(cursiveCharMap, _0x3a2fe5(0x164) + _0x53b783 + '\x20٩(˘◡˘)۶');
}

function emoticon5(_0x322df7) {
    var _0x16e4ea = _0x50051f;
    return applyCharMap(squiggle3CharMap, _0x16e4ea(0x1a5) + _0x322df7 + '(✿ヘᴥヘ)');
}

function emoticon6(_0x204b78) {
    var _0x25d656 = _0x50051f;
    return applyCharMap(wideTextCharMap, _0x25d656(0x1f7) + _0x204b78 + _0x25d656(0x2a1));
}

function emoticon7(_0x258045) {
    var _0x414c98 = _0x50051f;
    return applyCharMap(squiggle2CharMap, _0x414c98(0x3d) + _0x258045 + _0x414c98(0x1bf));
}

function thankyou0(_0x3acb4c) {
    var _0x2e9db1 = _0x50051f;
    return applyCharMap(doubleStruckCharMap, _0x2e9db1(0x3ed) + _0x3acb4c + _0x2e9db1(0x41f));
}

function thankyou1(_0x5a6998) {
    var _0x141e62 = _0x50051f;
    return applyCharMap(cursiveCharMap, _0x141e62(0x18) + _0x5a6998 + _0x141e62(0x18));
}

function thankyou2(_0xb2f737) {
    var _0x47196c = _0x50051f;
    return applyCharMap(doubleStruckCharMap, _0x47196c(0x1e9) + _0xb2f737 + _0x47196c(0x52d));
}

function thankyou3(_0x8e3c20) {
    var _0x4fe7fc = _0x50051f;
    return applyCharMap(upperAnglesCharMap, _0x4fe7fc(0x137) + _0x8e3c20 + '');
}

function thankyou4(_0x5acfe7) {
    var _0x732c57 = _0x50051f;
    return applyCharMap(squiggle2CharMap, _0x732c57(0x2a3) + _0x5acfe7 + '');
}

function thankyou5(_0x24913d) {
    var _0x38ed41 = _0x50051f;
    return applyCharMap(asianStyleCharMap, _0x38ed41(0x462) + _0x24913d + _0x38ed41(0x3d4));
}

function thankyou6(_0x2ff5e4) {
    var _0xc6b9a2 = _0x50051f;
    return applyCharMap(medievalCharMap, _0xc6b9a2(0x69) + _0x2ff5e4 + _0xc6b9a2(0x52b));
}

function thankyou7(_0x227b67) {
    var _0x1c0536 = _0x50051f;
    return applyCharMap(neonCharMap, _0x1c0536(0x1e9) + _0x227b67 + _0x1c0536(0x1e9));
}

function sad0(_0x3a1cd9) {
    var _0x48a140 = _0x50051f;
    return applyCharMap(squiggle5CharMap, _0x48a140(0x204) + _0x3a1cd9 + '\x20(๑′°︿°๑)');
}

function sad1(_0xc961bf) {
    var _0x120ec4 = _0x50051f;
    return applyCharMap(monospaceCharMap, _0x120ec4(0x37f) + _0xc961bf + '\x20(︶︹︺)');
}

function sad2(_0x12b036) {
    var _0x397b78 = _0x50051f;
    return applyCharMap(squiggleCharMap, _0x397b78(0x244) + _0x12b036 + '\x20(⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)');
}

function sad3(_0x2a080f) {
    var _0xa5f369 = _0x50051f;
    return applyCharMap(italicCharMap, _0xa5f369(0x1b7) + _0x2a080f + '\x20(\x20◔\x20ʖ̯\x20◔\x20)');
}

function sad4(_0x6ab69d) {
    return applyCharMap(squiggle3CharMap, '(ಥ\x20͜ʖಥ)\x20' + _0x6ab69d + '\x20٩꒰´·⌢•｀꒱۶⁼³₌₃');
}

function _0x1fce(_0xa0cbb9, _0x4553c5) {
    var _0x342271 = _0x2c91();
    return _0x1fce = function(_0x11b2f3, _0x2c91d7) {
        _0x11b2f3 = _0x11b2f3 - 0x0;
        var _0x1fce36 = _0x342271[_0x11b2f3];
        return _0x1fce36;
    }, _0x1fce(_0xa0cbb9, _0x4553c5);
}

function sad5(_0x1a3e25) {
    var _0x149cb1 = _0x50051f;
    return applyCharMap(bentTextCharMap, _0x149cb1(0x4e8) + _0x1a3e25 + _0x149cb1(0x82));
}

function sad6(_0x2f6abd) {
    var _0x337939 = _0x50051f;
    return applyCharMap(medievalCharMap, _0x337939(0x2b8) + _0x2f6abd + _0x337939(0x15));
}

function sad7(_0x479179) {
    var _0x2ca2c1 = _0x50051f;
    return applyCharMap(symbolsCharMap, _0x2ca2c1(0x2e1) + _0x479179 + _0x2ca2c1(0x3a1));
}

function cuteText1(_0x1f6b7a) {
    var _0x392fba = _0x50051f;
    return applyCharMap(italicCharMap, _0x392fba(0x4d2) + _0x1f6b7a + _0x392fba(0x4d2));
}

function cuteText2(_0x2ffb8a) {
    return applyCharMap(squiggle5CharMap, '🐿\x20🎀' + _0x2ffb8a + '\x20🎀\x20🐿');
}

function cuteText3(_0x1109da) {
    var _0x7fef37 = _0x50051f;
    return applyCharMap(oldEnglishCharMap, _0x7fef37(0x1d) + _0x1109da + '\x20🎀\x20🍒');
}

function cuteText4(_0x280397) {
    var _0x2635aa = _0x50051f;
    return applyCharMap(squiggleCharMap, _0x2635aa(0x3f1) + _0x280397 + _0x2635aa(0x68));
}

function cuteText5(_0x4cd9e2) {
    var _0x1c1730 = _0x50051f;
    return applyCharMap(cursiveCharMap, _0x1c1730(0x16b) + _0x4cd9e2 + _0x1c1730(0x331));
}

function fullCrazy1(_0x5808cc) {
    var _0x3d6c02 = _0x50051f;
    return applyCharMap(boldCharMap, _0x3d6c02(0x1df) + _0x5808cc + _0x3d6c02(0x146));
}

function fullCrazy2(_0x53cf53) {
    var _0x3c485e = _0x50051f;
    return applyCharMap(squiggleCharMap, '••¤(`×[¤\x20' + _0x53cf53 + _0x3c485e(0x1b8));
}

function fullCrazy3(_0x558a93) {
    var _0x80a992 = _0x50051f;
    return applyCharMap(doubleStruckCharMap, _0x80a992(0x84) + _0x558a93 + _0x80a992(0x493));
}

function fullCrazy4(_0x309124) {
    var _0x4acb58 = _0x50051f;
    return applyCharMap(currencyCharMap, _0x4acb58(0x4ba) + _0x309124 + _0x4acb58(0x35a));
}

function fullCrazy5(_0x424cb1) {
    var _0x44783f = _0x50051f;
    return applyCharMap(wideTextCharMap, _0x44783f(0x1a9) + _0x424cb1 + '\x20✿◉●•◦');
}

function crazyWithFlourishOrSymbols3(_0x27b8a1) {
    var _0x521251 = _0x50051f;
    return applyCharMap(italicCharMap, _0x521251(0x3b) + _0x27b8a1 + _0x521251(0x457));
}

function crazyWithFlourishOrSymbols4(_0xd4d443) {
    var _0x3f181a = _0x50051f;
    return applyCharMap(asianStyle2CharMap, _0x3f181a(0x198) + _0xd4d443 + '¯_(\x20͡°\x20͜ʖ\x20͡°)_/¯');
}

function crazyWithFlourishOrSymbols1(_0x1c6073) {
    return applyCharMap(italicCharMap, '⫷\x20\x20' + _0x1c6073 + '\x20⫸');
}

function crazyWithFlourishOrSymbols2(_0x36ec00) {
    var _0x45768d = _0x50051f;
    return applyCharMap(boldItalicCharMap, _0x45768d(0x18b) + _0x36ec00 + _0x45768d(0x3a7));
}

function crazyWithFlourishOrSymbols5(_0x21a86f) {
    var _0x565757 = _0x50051f;
    return applyCharMap(squaresCharMap, _0x565757(0x4a3) + _0x21a86f + _0x565757(0x316));
}

function wrap1(_0x53fe2c) {
    var _0x40b05a = _0x50051f;
    return applyCharMap(boldCharMap, '░▒▓█►─═' + [_0x53fe2c] + _0x40b05a(0x50d));
}

function wrap2(_0x5510b6) {
    var _0x293b06 = _0x50051f;
    return applyCharMap(cursiveCharMap, _0x293b06(0x496) + [_0x5510b6] + '\x20\x20█\x20▇\x20▆\x20▅\x20▄\x20▂▁');
}

function wrap3(_0x28eb9a) {
    var _0x38f87f = _0x50051f;
    return applyCharMap(boldItalicCharMap, '▌│█║▌║▌║\x20' + [_0x28eb9a] + _0x38f87f(0x44e));
}

function wrap4(_0x27099b) {
    var _0x343975 = _0x50051f;
    return applyCharMap(neonCharMap, '꧁𓊈𒆜' + [_0x27099b] + _0x343975(0xa8));
}

function wrap5(_0x20c107) {
    var _0x1dd964 = _0x50051f;
    return applyCharMap(boldItalicCharMap, _0x1dd964(0x377) + [_0x20c107] + _0x1dd964(0x2a2));
}
var newtext = {
    's1': {
        0x1: _0x50051f(0x4bc),
        0x2: _0x50051f(0x1c4),
        0x3: _0x50051f(0x24b),
        0x4: _0x50051f(0x376),
        0x5: _0x50051f(0x261),
        0x6: '&#989;',
        0x7: _0x50051f(0xe0),
        0x8: _0x50051f(0x23a),
        0x9: _0x50051f(0x176),
        0xa: _0x50051f(0xb2),
        0xb: _0x50051f(0x211),
        0xc: _0x50051f(0x4c8),
        0xd: '&#625;',
        0xe: _0x50051f(0x1ec),
        0xf: _0x50051f(0x2bd),
        0x10: '&rho;',
        0x11: '&#985;',
        0x12: _0x50051f(0x2ad),
        0x13: _0x50051f(0x36),
        0x14: _0x50051f(0x4e1),
        0x15: _0x50051f(0x402),
        0x16: '&#651;',
        0x17: _0x50051f(0x28),
        0x18: 'x',
        0x19: _0x50051f(0x3af),
        0x1a: _0x50051f(0x3f9),
        0x1b: 'A',
        0x1c: 'B',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: 'E',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: 'K',
        0x26: 'L',
        0x27: 'M',
        0x28: 'N',
        0x29: 'O',
        0x2a: 'P',
        0x2b: 'Q',
        0x2c: 'R',
        0x2d: 'S',
        0x2e: 'T',
        0x2f: 'U',
        0x30: 'V',
        0x31: 'W',
        0x32: 'X',
        0x33: 'Y',
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's2': {
        0x1: _0x50051f(0x471),
        0x2: _0x50051f(0x298),
        0x3: _0x50051f(0x172),
        0x4: _0x50051f(0x2ba),
        0x5: '&euro;',
        0x6: _0x50051f(0x4ee),
        0x7: _0x50051f(0x2af),
        0x8: '&#9796;',
        0x9: _0x50051f(0x193),
        0xa: _0x50051f(0x322),
        0xb: _0x50051f(0x25),
        0xc: _0x50051f(0x2f5),
        0xd: _0x50051f(0x3a),
        0xe: _0x50051f(0x2b),
        0xf: _0x50051f(0x426),
        0x10: _0x50051f(0x4ab),
        0x11: '&#9773;',
        0x12: _0x50051f(0x338),
        0x13: _0x50051f(0x528),
        0x14: _0x50051f(0x42e),
        0x15: '&#9739;',
        0x16: _0x50051f(0x3a6),
        0x17: _0x50051f(0x47c),
        0x18: '&#8984;',
        0x19: _0x50051f(0x324),
        0x1a: '&#9761;',
        0x1b: _0x50051f(0x471),
        0x1c: _0x50051f(0x298),
        0x1d: _0x50051f(0x172),
        0x1e: _0x50051f(0x2ba),
        0x1f: _0x50051f(0x43f),
        0x20: _0x50051f(0x4ee),
        0x21: _0x50051f(0x2af),
        0x22: _0x50051f(0x3ad),
        0x23: _0x50051f(0x193),
        0x24: '&#9834;',
        0x25: '&#1008;',
        0x26: '&#8627;',
        0x27: '&#9812;',
        0x28: '&#9835;',
        0x29: _0x50051f(0x426),
        0x2a: _0x50051f(0x4ab),
        0x2b: _0x50051f(0x2ae),
        0x2c: _0x50051f(0x338),
        0x2d: _0x50051f(0x528),
        0x2e: _0x50051f(0x42e),
        0x2f: _0x50051f(0x1ea),
        0x30: _0x50051f(0x3a6),
        0x31: '&omega;',
        0x32: _0x50051f(0x44d),
        0x33: '&#9791;',
        0x34: _0x50051f(0x364),
        0x35: _0x50051f(0xb),
        0x36: _0x50051f(0x312),
        0x37: _0x50051f(0xc2),
        0x38: _0x50051f(0x497),
        0x39: _0x50051f(0x4fa),
        0x3a: _0x50051f(0x51b),
        0x3b: _0x50051f(0xa2),
        0x3c: _0x50051f(0x2c5),
        0x3d: '&#10130;',
        0x3e: _0x50051f(0x45b)
    },
    's3': {
        0x1: _0x50051f(0x115),
        0x2: _0x50051f(0x3b6),
        0x3: _0x50051f(0x51e),
        0x4: _0x50051f(0x123),
        0x5: _0x50051f(0x1),
        0x6: _0x50051f(0x49),
        0x7: _0x50051f(0x41e),
        0x8: _0x50051f(0x65),
        0x9: _0x50051f(0x205),
        0xa: _0x50051f(0x390),
        0xb: '&#310;',
        0xc: '&#313;',
        0xd: _0x50051f(0x494),
        0xe: '&#323;',
        0xf: _0x50051f(0x29f),
        0x10: _0x50051f(0x482),
        0x11: 'Q',
        0x12: _0x50051f(0x24a),
        0x13: _0x50051f(0x48),
        0x14: _0x50051f(0x4a),
        0x15: _0x50051f(0x24c),
        0x16: 'V',
        0x17: '&#372;',
        0x18: _0x50051f(0x225),
        0x19: _0x50051f(0x470),
        0x1a: _0x50051f(0x9f),
        0x1b: _0x50051f(0x115),
        0x1c: _0x50051f(0x3b6),
        0x1d: _0x50051f(0x51e),
        0x1e: _0x50051f(0x123),
        0x1f: _0x50051f(0x1),
        0x20: '&#358;',
        0x21: _0x50051f(0x41e),
        0x22: _0x50051f(0x65),
        0x23: _0x50051f(0x205),
        0x24: _0x50051f(0x390),
        0x25: _0x50051f(0x4c3),
        0x26: _0x50051f(0x2aa),
        0x27: _0x50051f(0x494),
        0x28: _0x50051f(0x1a7),
        0x29: _0x50051f(0x29f),
        0x2a: _0x50051f(0x482),
        0x2b: 'Q',
        0x2c: _0x50051f(0x24a),
        0x2d: '&#346;',
        0x2e: _0x50051f(0x4a),
        0x2f: _0x50051f(0x24c),
        0x30: 'V',
        0x31: _0x50051f(0xf8),
        0x32: _0x50051f(0x225),
        0x33: _0x50051f(0x470),
        0x34: _0x50051f(0x9f),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's4': {
        0x1: _0x50051f(0x251),
        0x2: 'q',
        0x3: _0x50051f(0x47d),
        0x4: 'p',
        0x5: '&#477;',
        0x6: _0x50051f(0x46e),
        0x7: _0x50051f(0x33b),
        0x8: _0x50051f(0x1a8),
        0x9: '&#7433;',
        0xa: _0x50051f(0x2ad),
        0xb: _0x50051f(0x6d),
        0xc: 'l',
        0xd: '&#623;',
        0xe: 'u',
        0xf: 'o',
        0x10: 'd',
        0x11: 'b',
        0x12: _0x50051f(0x14b),
        0x13: 's',
        0x14: '&#647;',
        0x15: 'n',
        0x16: _0x50051f(0xbe),
        0x17: _0x50051f(0xc7),
        0x18: 'x',
        0x19: '&#654;',
        0x1a: 'z',
        0x1b: _0x50051f(0x251),
        0x1c: 'q',
        0x1d: _0x50051f(0x47d),
        0x1e: 'p',
        0x1f: _0x50051f(0x342),
        0x20: _0x50051f(0x46e),
        0x21: _0x50051f(0x33b),
        0x22: _0x50051f(0x1a8),
        0x23: '&#7433;',
        0x24: _0x50051f(0x2ad),
        0x25: _0x50051f(0x6d),
        0x26: 'l',
        0x27: '&#623;',
        0x28: 'u',
        0x29: 'o',
        0x2a: 'd',
        0x2b: 'b',
        0x2c: _0x50051f(0x14b),
        0x2d: 's',
        0x2e: _0x50051f(0x1ac),
        0x2f: 'n',
        0x30: _0x50051f(0xbe),
        0x31: '&#653;',
        0x32: 'x',
        0x33: _0x50051f(0x21b),
        0x34: 'z',
        0x35: _0x50051f(0x16c),
        0x36: _0x50051f(0x8b),
        0x37: '&#400;',
        0x38: _0x50051f(0x3d1),
        0x39: _0x50051f(0xe7),
        0x3a: '9',
        0x3b: _0x50051f(0x7e),
        0x3c: '8',
        0x3d: '6',
        0x3e: '0'
    },
    's5': {
        0x1: _0x50051f(0x27f),
        0x2: _0x50051f(0x3b6),
        0x3: _0x50051f(0x382),
        0x4: '&#272;',
        0x5: _0x50051f(0x43f),
        0x6: _0x50051f(0x18d),
        0x7: _0x50051f(0x4d1),
        0x8: _0x50051f(0x88),
        0x9: '&#407;',
        0xa: _0x50051f(0x390),
        0xb: '&#1180;',
        0xc: _0x50051f(0x2cd),
        0xd: '&Mu;',
        0xe: _0x50051f(0x17b),
        0xf: _0x50051f(0xf0),
        0x10: _0x50051f(0x95),
        0x11: '&Omega;',
        0x12: _0x50051f(0x7c),
        0x13: _0x50051f(0x337),
        0x14: '&#358;',
        0x15: _0x50051f(0x34a),
        0x16: 'V',
        0x17: '&#372;',
        0x18: _0x50051f(0x225),
        0x19: _0x50051f(0x2ed),
        0x1a: _0x50051f(0x3a5),
        0x1b: _0x50051f(0x27f),
        0x1c: _0x50051f(0x3b6),
        0x1d: _0x50051f(0x382),
        0x1e: _0x50051f(0x41b),
        0x1f: _0x50051f(0x43f),
        0x20: _0x50051f(0x18d),
        0x21: _0x50051f(0x4d1),
        0x22: '&#294;',
        0x23: '&#407;',
        0x24: _0x50051f(0x390),
        0x25: _0x50051f(0x27),
        0x26: _0x50051f(0x2cd),
        0x27: _0x50051f(0x4c2),
        0x28: _0x50051f(0x17b),
        0x29: _0x50051f(0xf0),
        0x2a: _0x50051f(0x95),
        0x2b: _0x50051f(0x2f7),
        0x2c: '&#344;',
        0x2d: '&#350;',
        0x2e: _0x50051f(0x49),
        0x2f: '&#7918;',
        0x30: 'V',
        0x31: '&#372;',
        0x32: '&#1046;',
        0x33: _0x50051f(0x2ed),
        0x34: _0x50051f(0x3a5),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's6': {
        0x1: _0x50051f(0x4bc),
        0x2: '&#595;',
        0x3: _0x50051f(0x4be),
        0x4: _0x50051f(0x4da),
        0x5: _0x50051f(0xfb),
        0x6: _0x50051f(0x1aa),
        0x7: '&#608;',
        0x8: '&#614;',
        0x9: _0x50051f(0x24),
        0xa: _0x50051f(0xb2),
        0xb: _0x50051f(0x23c),
        0xc: _0x50051f(0x21),
        0xd: _0x50051f(0x499),
        0xe: '&#627;',
        0xf: _0x50051f(0x2bd),
        0x10: '&rho;',
        0x11: _0x50051f(0x50a),
        0x12: _0x50051f(0x83),
        0x13: '&#3619;',
        0x14: _0x50051f(0x13c),
        0x15: '&micro;',
        0x16: _0x50051f(0x18c),
        0x17: '&omega;',
        0x18: _0x50051f(0x1f3),
        0x19: '&#4327;',
        0x1a: _0x50051f(0xb1),
        0x1b: _0x50051f(0x4bc),
        0x1c: _0x50051f(0x207),
        0x1d: _0x50051f(0x4be),
        0x1e: '&part;',
        0x1f: _0x50051f(0xfb),
        0x20: _0x50051f(0x1aa),
        0x21: '&#608;',
        0x22: _0x50051f(0x107),
        0x23: _0x50051f(0x24),
        0x24: _0x50051f(0xb2),
        0x25: '&#1185;',
        0x26: '&#8467;',
        0x27: _0x50051f(0x499),
        0x28: _0x50051f(0x1ec),
        0x29: _0x50051f(0x2bd),
        0x2a: _0x50051f(0x4ab),
        0x2b: _0x50051f(0x50a),
        0x2c: _0x50051f(0x83),
        0x2d: _0x50051f(0x46a),
        0x2e: _0x50051f(0x13c),
        0x2f: _0x50051f(0x45f),
        0x30: _0x50051f(0x18c),
        0x31: _0x50051f(0x47c),
        0x32: _0x50051f(0x1f3),
        0x33: _0x50051f(0x3af),
        0x34: _0x50051f(0xb1),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's7': {
        0x1: _0x50051f(0x1dc),
        0x2: _0x50051f(0xcc),
        0x3: _0x50051f(0x4ff),
        0x4: _0x50051f(0x2bf),
        0x5: _0x50051f(0x1e8),
        0x6: _0x50051f(0x25b),
        0x7: '&#484;',
        0x8: _0x50051f(0x162),
        0x9: _0x50051f(0x6a),
        0xa: _0x50051f(0x1f4),
        0xb: _0x50051f(0x1fe),
        0xc: _0x50051f(0x51f),
        0xd: _0x50051f(0x308),
        0xe: '&#5198;',
        0xf: '&#5597;',
        0x10: _0x50051f(0x117),
        0x11: _0x50051f(0x1c1),
        0x12: '&#5511;',
        0x13: _0x50051f(0x10),
        0x14: _0x50051f(0x4d4),
        0x15: _0x50051f(0x34),
        0x16: '&#5167;',
        0x17: _0x50051f(0x483),
        0x18: _0x50051f(0x3a0),
        0x19: _0x50051f(0x195),
        0x1a: _0x50051f(0x317),
        0x1b: _0x50051f(0x1dc),
        0x1c: '&#5623;',
        0x1d: _0x50051f(0x4ff),
        0x1e: _0x50051f(0x2bf),
        0x1f: _0x50051f(0x1e8),
        0x20: '&#5556;',
        0x21: _0x50051f(0x4d1),
        0x22: _0x50051f(0x162),
        0x23: _0x50051f(0x6a),
        0x24: _0x50051f(0x1f4),
        0x25: _0x50051f(0x1fe),
        0x26: _0x50051f(0x51f),
        0x27: _0x50051f(0x308),
        0x28: '&#5198;',
        0x29: _0x50051f(0xab),
        0x2a: _0x50051f(0x117),
        0x2b: _0x50051f(0x1c1),
        0x2c: _0x50051f(0x249),
        0x2d: _0x50051f(0x10),
        0x2e: _0x50051f(0x4d4),
        0x2f: _0x50051f(0x34),
        0x30: _0x50051f(0x1f6),
        0x31: _0x50051f(0x483),
        0x32: _0x50051f(0x3a0),
        0x33: _0x50051f(0x195),
        0x34: _0x50051f(0x317),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's8': {
        0x1: _0x50051f(0x35f),
        0x2: '&#4329;',
        0x3: '&#4308;',
        0x4: _0x50051f(0x4a8),
        0x5: _0x50051f(0x0),
        0x6: 'f',
        0x7: '&#4330;',
        0x8: 'h',
        0x9: _0x50051f(0x3f3),
        0xa: '&#4325;',
        0xb: _0x50051f(0x116),
        0xc: 'l',
        0xd: _0x50051f(0x2c1),
        0xe: _0x50051f(0x454),
        0xf: _0x50051f(0x4c7),
        0x10: '&rho;',
        0x11: _0x50051f(0x475),
        0x12: _0x50051f(0x119),
        0x13: _0x50051f(0x157),
        0x14: '&#3923;',
        0x15: _0x50051f(0x402),
        0x16: _0x50051f(0x1d7),
        0x17: 'w',
        0x18: _0x50051f(0x2b7),
        0x19: _0x50051f(0x3af),
        0x1a: _0x50051f(0x385),
        0x1b: '&#4315;',
        0x1c: _0x50051f(0x7d),
        0x1d: _0x50051f(0x74),
        0x1e: _0x50051f(0x4a8),
        0x1f: _0x50051f(0x0),
        0x20: 'f',
        0x21: '&#4330;',
        0x22: 'h',
        0x23: _0x50051f(0x3f3),
        0x24: '&#4325;',
        0x25: _0x50051f(0x116),
        0x26: 'l',
        0x27: '&#4317;',
        0x28: '&#8134;',
        0x29: '&otilde;',
        0x2a: '&rho;',
        0x2b: _0x50051f(0x475),
        0x2c: _0x50051f(0x119),
        0x2d: _0x50051f(0x157),
        0x2e: _0x50051f(0x2d9),
        0x2f: '&upsilon;',
        0x30: _0x50051f(0x1d7),
        0x31: 'w',
        0x32: _0x50051f(0x2b7),
        0x33: _0x50051f(0x3af),
        0x34: _0x50051f(0x385),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's9': {
        0x1: '&#940;',
        0x2: _0x50051f(0x505),
        0x3: _0x50051f(0x289),
        0x4: _0x50051f(0x1c0),
        0x5: '&#941;',
        0x6: _0x50051f(0x47f),
        0x7: _0x50051f(0x12b),
        0x8: _0x50051f(0xd1),
        0x9: _0x50051f(0xa3),
        0xa: _0x50051f(0x375),
        0xb: _0x50051f(0x239),
        0xc: _0x50051f(0x2f),
        0xd: _0x50051f(0x427),
        0xe: '&#942;',
        0xf: _0x50051f(0xb9),
        0x10: _0x50051f(0x4ab),
        0x11: 'q',
        0x12: _0x50051f(0x11a),
        0x13: _0x50051f(0x437),
        0x14: '&#355;',
        0x15: _0x50051f(0x2e),
        0x16: _0x50051f(0x29d),
        0x17: _0x50051f(0x257),
        0x18: 'x',
        0x19: _0x50051f(0x3c1),
        0x1a: '&#382;',
        0x1b: '&#940;',
        0x1c: '&#1074;',
        0x1d: _0x50051f(0x289),
        0x1e: _0x50051f(0x1c0),
        0x1f: _0x50051f(0xdc),
        0x20: _0x50051f(0x47f),
        0x21: _0x50051f(0x12b),
        0x22: '&#295;',
        0x23: _0x50051f(0xa3),
        0x24: _0x50051f(0x375),
        0x25: _0x50051f(0x239),
        0x26: _0x50051f(0x2f),
        0x27: _0x50051f(0x427),
        0x28: _0x50051f(0x436),
        0x29: '&#972;',
        0x2a: '&rho;',
        0x2b: 'q',
        0x2c: '&#341;',
        0x2d: _0x50051f(0x437),
        0x2e: _0x50051f(0x133),
        0x2f: _0x50051f(0x2e),
        0x30: _0x50051f(0x29d),
        0x31: '&#974;',
        0x32: 'x',
        0x33: _0x50051f(0x3c1),
        0x34: _0x50051f(0x4bd),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's10': {
        0x1: '&#41707;',
        0x2: _0x50051f(0x156),
        0x3: _0x50051f(0x44),
        0x4: _0x50051f(0x112),
        0x5: _0x50051f(0xe9),
        0x6: _0x50051f(0x1ce),
        0x7: _0x50051f(0x35),
        0x8: _0x50051f(0xa7),
        0x9: _0x50051f(0x456),
        0xa: '&#41005;',
        0xb: _0x50051f(0xcd),
        0xc: '&#42130;',
        0xd: _0x50051f(0x206),
        0xe: _0x50051f(0x530),
        0xf: _0x50051f(0x368),
        0x10: _0x50051f(0x463),
        0x11: _0x50051f(0x4c4),
        0x12: _0x50051f(0xc8),
        0x13: '&#41754;',
        0x14: _0x50051f(0x42c),
        0x15: _0x50051f(0x184),
        0x16: _0x50051f(0x215),
        0x17: _0x50051f(0x2d0),
        0x18: _0x50051f(0x49b),
        0x19: _0x50051f(0x1cf),
        0x1a: '&#41076;',
        0x1b: '&#41707;',
        0x1c: _0x50051f(0x156),
        0x1d: _0x50051f(0x44),
        0x1e: '&#41045;',
        0x1f: _0x50051f(0xe9),
        0x20: _0x50051f(0x1ce),
        0x21: '&#41037;',
        0x22: _0x50051f(0xa7),
        0x23: '&#41105;',
        0x24: '&#41005;',
        0x25: _0x50051f(0xcd),
        0x26: _0x50051f(0x130),
        0x27: _0x50051f(0x206),
        0x28: _0x50051f(0x530),
        0x29: '&#41346;',
        0x2a: _0x50051f(0x463),
        0x2b: '&#41080;',
        0x2c: _0x50051f(0xc8),
        0x2d: _0x50051f(0x12a),
        0x2e: _0x50051f(0x42c),
        0x2f: '&#41991;',
        0x30: '&#41949;',
        0x31: _0x50051f(0x2d0),
        0x32: _0x50051f(0x49b),
        0x33: _0x50051f(0x1cf),
        0x34: _0x50051f(0x328),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's11': {
        0x1: '&#1044;',
        0x2: _0x50051f(0x1c8),
        0x3: 'C',
        0x4: 'D',
        0x5: _0x50051f(0x2f8),
        0x6: 'F',
        0x7: 'G',
        0x8: 'H',
        0x9: 'I',
        0xa: 'J',
        0xb: _0x50051f(0x27),
        0xc: 'L',
        0xd: 'M',
        0xe: _0x50051f(0x480),
        0xf: '&#1060;',
        0x10: 'P',
        0x11: _0x50051f(0x310),
        0x12: _0x50051f(0x2e7),
        0x13: 'S',
        0x14: _0x50051f(0x119),
        0x15: _0x50051f(0x287),
        0x16: 'V',
        0x17: _0x50051f(0x503),
        0x18: _0x50051f(0x225),
        0x19: _0x50051f(0x8a),
        0x1a: 'Z',
        0x1b: _0x50051f(0x138),
        0x1c: '&#1041;',
        0x1d: 'C',
        0x1e: 'D',
        0x1f: '&Xi;',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: 'I',
        0x24: 'J',
        0x25: _0x50051f(0x27),
        0x26: 'L',
        0x27: 'M',
        0x28: _0x50051f(0x480),
        0x29: _0x50051f(0x1d6),
        0x2a: 'P',
        0x2b: _0x50051f(0x310),
        0x2c: _0x50051f(0x2e7),
        0x2d: 'S',
        0x2e: _0x50051f(0x119),
        0x2f: _0x50051f(0x287),
        0x30: 'V',
        0x31: _0x50051f(0x503),
        0x32: _0x50051f(0x225),
        0x33: _0x50051f(0x8a),
        0x34: 'Z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's12': {
        0x1: _0x50051f(0x471),
        0x2: _0x50051f(0x438),
        0x3: _0x50051f(0x2ee),
        0x4: _0x50051f(0x45e),
        0x5: _0x50051f(0xe9),
        0x6: _0x50051f(0x2f1),
        0x7: _0x50051f(0x192),
        0x8: _0x50051f(0x4dd),
        0x9: _0x50051f(0x135),
        0xa: _0x50051f(0x219),
        0xb: _0x50051f(0x4b),
        0xc: _0x50051f(0x130),
        0xd: _0x50051f(0x2df),
        0xe: _0x50051f(0x23b),
        0xf: '&#41126;',
        0x10: '&#41571;',
        0x11: _0x50051f(0x1a3),
        0x12: _0x50051f(0x531),
        0x13: _0x50051f(0x32e),
        0x14: _0x50051f(0x3fe),
        0x15: _0x50051f(0x2b3),
        0x16: _0x50051f(0x254),
        0x17: _0x50051f(0x46f),
        0x18: _0x50051f(0x305),
        0x19: '&#41769;',
        0x1a: _0x50051f(0x328),
        0x1b: _0x50051f(0x471),
        0x1c: _0x50051f(0x438),
        0x1d: _0x50051f(0x2ee),
        0x1e: _0x50051f(0x45e),
        0x1f: '&#41823;',
        0x20: _0x50051f(0x2f1),
        0x21: _0x50051f(0x192),
        0x22: _0x50051f(0x4dd),
        0x23: _0x50051f(0x135),
        0x24: '&#41005;',
        0x25: _0x50051f(0x4b),
        0x26: _0x50051f(0x130),
        0x27: _0x50051f(0x2df),
        0x28: _0x50051f(0x23b),
        0x29: _0x50051f(0x14c),
        0x2a: _0x50051f(0x463),
        0x2b: _0x50051f(0x1a3),
        0x2c: _0x50051f(0x531),
        0x2d: _0x50051f(0x32e),
        0x2e: '&#42180;',
        0x2f: '&#40974;',
        0x30: _0x50051f(0x254),
        0x31: _0x50051f(0x46f),
        0x32: _0x50051f(0x305),
        0x33: _0x50051f(0x55),
        0x34: '&#41076;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's13': {
        0x1: _0x50051f(0xd0),
        0x2: _0x50051f(0xbf),
        0x3: _0x50051f(0x29),
        0x4: _0x50051f(0x405),
        0x5: _0x50051f(0x449),
        0x6: _0x50051f(0x21c),
        0x7: _0x50051f(0x37b),
        0x8: _0x50051f(0x387),
        0x9: _0x50051f(0x48c),
        0xa: _0x50051f(0x147),
        0xb: _0x50051f(0x4b),
        0xc: _0x50051f(0x130),
        0xd: _0x50051f(0x2df),
        0xe: _0x50051f(0x3b3),
        0xf: _0x50051f(0x103),
        0x10: '&#41571;',
        0x11: _0x50051f(0x1a3),
        0x12: _0x50051f(0x531),
        0x13: _0x50051f(0x16a),
        0x14: '&#42180;',
        0x15: '&#42148;',
        0x16: '&#42150;',
        0x17: _0x50051f(0x2d0),
        0x18: _0x50051f(0x2e5),
        0x19: _0x50051f(0x430),
        0x1a: _0x50051f(0x328),
        0x1b: _0x50051f(0xd0),
        0x1c: '&#41203;',
        0x1d: _0x50051f(0x29),
        0x1e: _0x50051f(0x405),
        0x1f: '&#41922;',
        0x20: _0x50051f(0x21c),
        0x21: _0x50051f(0x37b),
        0x22: _0x50051f(0x387),
        0x23: _0x50051f(0x48c),
        0x24: '&#42171;',
        0x25: '&#40984;',
        0x26: '&#42130;',
        0x27: _0x50051f(0x2df),
        0x28: _0x50051f(0x3b3),
        0x29: _0x50051f(0x103),
        0x2a: _0x50051f(0x463),
        0x2b: '&#41392;',
        0x2c: _0x50051f(0x531),
        0x2d: _0x50051f(0x16a),
        0x2e: _0x50051f(0x3fe),
        0x2f: '&#42148;',
        0x30: _0x50051f(0x1ed),
        0x31: _0x50051f(0x2d0),
        0x32: _0x50051f(0x2e5),
        0x33: _0x50051f(0x430),
        0x34: _0x50051f(0x328),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's14': {
        0x1: _0x50051f(0xf3),
        0x2: _0x50051f(0x3d8),
        0x3: _0x50051f(0x4e),
        0x4: _0x50051f(0x296),
        0x5: _0x50051f(0x369),
        0x6: 'F',
        0x7: _0x50051f(0x380),
        0x8: '&#1085;',
        0x9: _0x50051f(0x386),
        0xa: '&#65420;',
        0xb: _0x50051f(0x351),
        0xc: _0x50051f(0x2cd),
        0xd: '&#3057;',
        0xe: '&#1051;',
        0xf: _0x50051f(0xf0),
        0x10: _0x50051f(0x40b),
        0x11: _0x50051f(0x1ae),
        0x12: _0x50051f(0x464),
        0x13: '&#12425;',
        0x14: _0x50051f(0x4a),
        0x15: _0x50051f(0x287),
        0x16: _0x50051f(0xb6),
        0x17: _0x50051f(0x233),
        0x18: _0x50051f(0x466),
        0x19: '&#996;',
        0x1a: _0x50051f(0x422),
        0x1b: _0x50051f(0xf3),
        0x1c: _0x50051f(0x3d8),
        0x1d: _0x50051f(0x4e),
        0x1e: _0x50051f(0x296),
        0x1f: _0x50051f(0x369),
        0x20: 'F',
        0x21: _0x50051f(0x380),
        0x22: _0x50051f(0x3b4),
        0x23: '&#618;',
        0x24: _0x50051f(0x10b),
        0x25: _0x50051f(0x351),
        0x26: _0x50051f(0x2cd),
        0x27: _0x50051f(0x413),
        0x28: _0x50051f(0x39a),
        0x29: '&Oslash;',
        0x2a: _0x50051f(0x40b),
        0x2b: _0x50051f(0x1ae),
        0x2c: _0x50051f(0x464),
        0x2d: _0x50051f(0x39),
        0x2e: _0x50051f(0x4a),
        0x2f: _0x50051f(0x287),
        0x30: _0x50051f(0xb6),
        0x31: '&#412;',
        0x32: _0x50051f(0x466),
        0x33: _0x50051f(0x288),
        0x34: _0x50051f(0x422),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's15': {
        0x1: _0x50051f(0x2e6),
        0x2: _0x50051f(0x76),
        0x3: _0x50051f(0x1ad),
        0x4: _0x50051f(0x43b),
        0x5: _0x50051f(0x16),
        0x6: _0x50051f(0x3c2),
        0x7: _0x50051f(0x380),
        0x8: '&#1223;',
        0x9: _0x50051f(0x16c),
        0xa: _0x50051f(0xca),
        0xb: _0x50051f(0x502),
        0xc: '&#1340;',
        0xd: 'M',
        0xe: _0x50051f(0x8e),
        0xf: _0x50051f(0x8f),
        0x10: _0x50051f(0x95),
        0x11: _0x50051f(0x145),
        0x12: _0x50051f(0xb7),
        0x13: _0x50051f(0x32d),
        0x14: _0x50051f(0x431),
        0x15: _0x50051f(0x253),
        0x16: _0x50051f(0xb6),
        0x17: _0x50051f(0x233),
        0x18: _0x50051f(0x209),
        0x19: _0x50051f(0x195),
        0x1a: _0x50051f(0x2ca),
        0x1b: '&#411;',
        0x1c: _0x50051f(0x76),
        0x1d: _0x50051f(0x1ad),
        0x1e: _0x50051f(0x43b),
        0x1f: _0x50051f(0x16),
        0x20: _0x50051f(0x3c2),
        0x21: '&#403;',
        0x22: '&#1223;',
        0x23: _0x50051f(0x16c),
        0x24: '&#646;',
        0x25: _0x50051f(0x502),
        0x26: _0x50051f(0x42f),
        0x27: 'M',
        0x28: _0x50051f(0x8e),
        0x29: _0x50051f(0x8f),
        0x2a: '&#420;',
        0x2b: '&#418;',
        0x2c: _0x50051f(0xb7),
        0x2d: _0x50051f(0x32d),
        0x2e: _0x50051f(0x431),
        0x2f: _0x50051f(0x253),
        0x30: _0x50051f(0xb6),
        0x31: _0x50051f(0x233),
        0x32: '&#1202;',
        0x33: '&#435;',
        0x34: _0x50051f(0x2ca),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's16': {
        0x1: _0x50051f(0x1ca),
        0x2: _0x50051f(0x4bf),
        0x3: _0x50051f(0x259),
        0x4: _0x50051f(0x210),
        0x5: _0x50051f(0x32),
        0x6: '&#41246;',
        0x7: _0x50051f(0x192),
        0x8: _0x50051f(0x474),
        0x9: _0x50051f(0x456),
        0xa: _0x50051f(0x147),
        0xb: _0x50051f(0xcd),
        0xc: _0x50051f(0x130),
        0xd: _0x50051f(0x2df),
        0xe: _0x50051f(0x3b3),
        0xf: _0x50051f(0x14c),
        0x10: _0x50051f(0x463),
        0x11: _0x50051f(0x1d4),
        0x12: _0x50051f(0x121),
        0x13: _0x50051f(0x12a),
        0x14: _0x50051f(0x487),
        0x15: '&#41991;',
        0x16: '&#41008;',
        0x17: _0x50051f(0x46f),
        0x18: _0x50051f(0x1ee),
        0x19: _0x50051f(0x4a9),
        0x1a: '&#41076;',
        0x1b: _0x50051f(0x1ca),
        0x1c: _0x50051f(0x4bf),
        0x1d: _0x50051f(0x259),
        0x1e: _0x50051f(0x210),
        0x1f: _0x50051f(0x32),
        0x20: '&#41246;',
        0x21: '&#41029;',
        0x22: _0x50051f(0x474),
        0x23: _0x50051f(0x456),
        0x24: _0x50051f(0x147),
        0x25: '&#40983;',
        0x26: '&#42130;',
        0x27: _0x50051f(0x2df),
        0x28: '&#41674;',
        0x29: '&#41126;',
        0x2a: '&#41571;',
        0x2b: _0x50051f(0x1d4),
        0x2c: _0x50051f(0x121),
        0x2d: _0x50051f(0x12a),
        0x2e: _0x50051f(0x487),
        0x2f: _0x50051f(0x184),
        0x30: _0x50051f(0x92),
        0x31: _0x50051f(0x46f),
        0x32: _0x50051f(0x1ee),
        0x33: _0x50051f(0x4a9),
        0x34: _0x50051f(0x328),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's17': {
        0x1: _0x50051f(0x3),
        0x2: '&#1349;',
        0x3: _0x50051f(0x49f),
        0x4: _0x50051f(0x44f),
        0x5: _0x50051f(0x448),
        0x6: _0x50051f(0x3b0),
        0x7: '&#1331;',
        0x8: '&#615;',
        0x9: '&#639;',
        0xa: _0x50051f(0xb2),
        0xb: '&#409;',
        0xc: _0x50051f(0x4c8),
        0xd: '&#653;',
        0xe: _0x50051f(0x452),
        0xf: '&#1342;',
        0x10: '&rho;',
        0x11: '&phi;',
        0x12: '&#1360;',
        0x13: _0x50051f(0xec),
        0x14: _0x50051f(0x4ca),
        0x15: _0x50051f(0x373),
        0x16: _0x50051f(0x2c9),
        0x17: _0x50051f(0x37d),
        0x18: '&#1347;',
        0x19: _0x50051f(0x268),
        0x1a: _0x50051f(0x432),
        0x1b: _0x50051f(0x3),
        0x1c: _0x50051f(0x399),
        0x1d: _0x50051f(0x49f),
        0x1e: _0x50051f(0x44f),
        0x1f: _0x50051f(0x448),
        0x20: '&#1330;',
        0x21: _0x50051f(0x4fe),
        0x22: '&#615;',
        0x23: _0x50051f(0x1ba),
        0x24: _0x50051f(0xb2),
        0x25: _0x50051f(0x211),
        0x26: _0x50051f(0x4c8),
        0x27: '&#653;',
        0x28: _0x50051f(0x452),
        0x29: '&#1342;',
        0x2a: _0x50051f(0x4ab),
        0x2b: _0x50051f(0x50a),
        0x2c: '&#1360;',
        0x2d: _0x50051f(0xec),
        0x2e: '&#1333;',
        0x2f: _0x50051f(0x373),
        0x30: _0x50051f(0x2c9),
        0x31: _0x50051f(0x37d),
        0x32: _0x50051f(0x33e),
        0x33: '&#1358;',
        0x34: '&#1344;',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's18': {
        0x1: _0x50051f(0x4bc),
        0x2: _0x50051f(0x2c3),
        0x3: _0x50051f(0x289),
        0x4: 'd',
        0x5: _0x50051f(0xfb),
        0x6: '&fnof;',
        0x7: 'g',
        0x8: 'h',
        0x9: _0x50051f(0xf1),
        0xa: _0x50051f(0x34c),
        0xb: _0x50051f(0x116),
        0xc: _0x50051f(0x453),
        0xd: 'm',
        0xe: '&eta;',
        0xf: _0x50051f(0x3fd),
        0x10: 'p',
        0x11: _0x50051f(0x2f7),
        0x12: 'r',
        0x13: _0x50051f(0x4e9),
        0x14: _0x50051f(0x52c),
        0x15: 'u',
        0x16: _0x50051f(0xa4),
        0x17: _0x50051f(0x47c),
        0x18: 'x',
        0x19: _0x50051f(0x524),
        0x1a: 'z',
        0x1b: _0x50051f(0x4bc),
        0x1c: _0x50051f(0x2c3),
        0x1d: _0x50051f(0x289),
        0x1e: 'd',
        0x1f: '&epsilon;',
        0x20: _0x50051f(0x1aa),
        0x21: 'g',
        0x22: 'h',
        0x23: _0x50051f(0xf1),
        0x24: _0x50051f(0x34c),
        0x25: _0x50051f(0x116),
        0x26: _0x50051f(0x453),
        0x27: 'm',
        0x28: _0x50051f(0x229),
        0x29: _0x50051f(0x3fd),
        0x2a: 'p',
        0x2b: '&Omega;',
        0x2c: 'r',
        0x2d: _0x50051f(0x4e9),
        0x2e: '&dagger;',
        0x2f: 'u',
        0x30: _0x50051f(0xa4),
        0x31: _0x50051f(0x47c),
        0x32: 'x',
        0x33: _0x50051f(0x524),
        0x34: 'z',
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's19': {
        0x1: _0x50051f(0x4b2),
        0x2: _0x50051f(0x27b),
        0x3: _0x50051f(0x343),
        0x4: _0x50051f(0x4a8),
        0x5: _0x50051f(0x2b0),
        0x6: _0x50051f(0x3b0),
        0x7: _0x50051f(0x6c),
        0x8: _0x50051f(0x3e4),
        0x9: _0x50051f(0x1ba),
        0xa: '&#646;',
        0xb: _0x50051f(0x248),
        0xc: _0x50051f(0x397),
        0xd: _0x50051f(0x499),
        0xe: _0x50051f(0x4e4),
        0xf: _0x50051f(0xc6),
        0x10: '&#447;',
        0x11: _0x50051f(0x29e),
        0x12: _0x50051f(0x255),
        0x13: '&sigmaf;',
        0x14: _0x50051f(0x1d5),
        0x15: _0x50051f(0x402),
        0x16: '&#3182;',
        0x17: _0x50051f(0x47c),
        0x18: '&#2794;',
        0x19: '&#1506;',
        0x1a: _0x50051f(0x5d),
        0x1b: '&#3588;',
        0x1c: '&#4330;',
        0x1d: '&#2414;',
        0x1e: '&#4331;',
        0x1f: '&#2799;',
        0x20: '&#1330;',
        0x21: _0x50051f(0x6c),
        0x22: _0x50051f(0x3e4),
        0x23: '&#639;',
        0x24: '&#646;',
        0x25: _0x50051f(0x248),
        0x26: _0x50051f(0x397),
        0x27: '&#625;',
        0x28: _0x50051f(0x4e4),
        0x29: _0x50051f(0xc6),
        0x2a: _0x50051f(0x504),
        0x2b: _0x50051f(0x29e),
        0x2c: _0x50051f(0x255),
        0x2d: _0x50051f(0x289),
        0x2e: _0x50051f(0x1d5),
        0x2f: '&upsilon;',
        0x30: _0x50051f(0x3b9),
        0x31: '&omega;',
        0x32: _0x50051f(0x149),
        0x33: _0x50051f(0x2c9),
        0x34: _0x50051f(0x5d),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's20': {
        0x1: '&#1072;',
        0x2: _0x50051f(0x41d),
        0x3: 'c',
        0x4: '&#1076;',
        0x5: _0x50051f(0x3ef),
        0x6: 'f',
        0x7: 'g',
        0x8: _0x50051f(0x3b4),
        0x9: _0x50051f(0x18e),
        0xa: 'j',
        0xb: _0x50051f(0x109),
        0xc: _0x50051f(0x20f),
        0xd: _0x50051f(0x410),
        0xe: _0x50051f(0xd7),
        0xf: _0x50051f(0x4d0),
        0x10: 'p',
        0x11: _0x50051f(0x49a),
        0x12: _0x50051f(0x40e),
        0x13: '$',
        0x14: _0x50051f(0x450),
        0x15: _0x50051f(0x408),
        0x16: _0x50051f(0x18c),
        0x17: _0x50051f(0x7a),
        0x18: '&#1078;',
        0x19: _0x50051f(0x3c1),
        0x1a: _0x50051f(0x53b),
        0x1b: '&#1040;',
        0x1c: _0x50051f(0x1c8),
        0x1d: 'C',
        0x1e: '&#1044;',
        0x1f: '&#1028;',
        0x20: 'F',
        0x21: 'G',
        0x22: 'H',
        0x23: '&#1031;',
        0x24: 'J',
        0x25: '&#1050;',
        0x26: _0x50051f(0x4bb),
        0x27: '&#1130;',
        0x28: '&#1049;',
        0x29: _0x50051f(0x31e),
        0x2a: 'P',
        0x2b: _0x50051f(0x1d6),
        0x2c: _0x50051f(0x2e7),
        0x2d: '$',
        0x2e: 'T',
        0x2f: _0x50051f(0x287),
        0x30: '&#1140;',
        0x31: '&#1064;',
        0x32: _0x50051f(0x225),
        0x33: '&#1063;',
        0x34: _0x50051f(0x477),
        0x35: '1',
        0x36: '2',
        0x37: '3',
        0x38: '4',
        0x39: '5',
        0x3a: '6',
        0x3b: '7',
        0x3c: '8',
        0x3d: '9',
        0x3e: '0'
    },
    's21': {
        0x1: _0x50051f(0x42b),
        0x2: 'b&#830;',
        0x3: 'c&#830;',
        0x4: _0x50051f(0x25c),
        0x5: _0x50051f(0x4a5),
        0x6: _0x50051f(0x136),
        0x7: _0x50051f(0x48d),
        0x8: _0x50051f(0x266),
        0x9: _0x50051f(0x1ef),
        0xa: 'j&#830;',
        0xb: 'k&#830;',
        0xc: _0x50051f(0x3aa),
        0xd: _0x50051f(0xaf),
        0xe: 'n&#830;',
        0xf: _0x50051f(0x4f),
        0x10: _0x50051f(0x41a),
        0x11: _0x50051f(0x460),
        0x12: _0x50051f(0x213),
        0x13: 's&#830;',
        0x14: _0x50051f(0x34f),
        0x15: _0x50051f(0x4ed),
        0x16: 'v&#830;',
        0x17: _0x50051f(0x4e6),
        0x18: _0x50051f(0x90),
        0x19: _0x50051f(0x25e),
        0x1a: 'z&#830;',
        0x1b: 'A&#830;',
        0x1c: _0x50051f(0x282),
        0x1d: _0x50051f(0xc1),
        0x1e: 'D&#830;',
        0x1f: _0x50051f(0x72),
        0x20: _0x50051f(0x6f),
        0x21: _0x50051f(0x1e5),
        0x22: _0x50051f(0x13d),
        0x23: _0x50051f(0x28f),
        0x24: 'J&#830;',
        0x25: 'K&#830;',
        0x26: _0x50051f(0x32a),
        0x27: _0x50051f(0x264),
        0x28: _0x50051f(0x276),
        0x29: _0x50051f(0x127),
        0x2a: 'P&#830;',
        0x2b: _0x50051f(0x2dc),
        0x2c: _0x50051f(0x165),
        0x2d: 'S&#830;',
        0x2e: 'T&#830;',
        0x2f: _0x50051f(0x34d),
        0x30: _0x50051f(0x325),
        0x31: _0x50051f(0x50f),
        0x32: 'X&#830;',
        0x33: _0x50051f(0x39c),
        0x34: _0x50051f(0x294),
        0x35: _0x50051f(0x3e8),
        0x36: '2&#830;',
        0x37: _0x50051f(0x24e),
        0x38: '4&#830;',
        0x39: _0x50051f(0x2a9),
        0x3a: '6&#830;',
        0x3b: _0x50051f(0x230),
        0x3c: _0x50051f(0x326),
        0x3d: '9&#830;',
        0x3e: '0&#830;'
    },
    's22': {
        0x1: _0x50051f(0x2a6),
        0x2: _0x50051f(0x42a),
        0x3: 'c&#838;',
        0x4: _0x50051f(0x120),
        0x5: _0x50051f(0x42),
        0x6: 'f&#838;',
        0x7: _0x50051f(0x367),
        0x8: 'h&#838;',
        0x9: _0x50051f(0x4cb),
        0xa: _0x50051f(0x102),
        0xb: _0x50051f(0x185),
        0xc: _0x50051f(0x23),
        0xd: _0x50051f(0x258),
        0xe: 'n&#838;',
        0xf: _0x50051f(0x489),
        0x10: _0x50051f(0x220),
        0x11: 'q&#838;',
        0x12: _0x50051f(0x4ac),
        0x13: _0x50051f(0x512),
        0x14: _0x50051f(0x3f0),
        0x15: _0x50051f(0x7f),
        0x16: _0x50051f(0x200),
        0x17: _0x50051f(0x122),
        0x18: 'x&#838;',
        0x19: _0x50051f(0x279),
        0x1a: 'z&#838;',
        0x1b: _0x50051f(0x46c),
        0x1c: _0x50051f(0x4de),
        0x1d: _0x50051f(0x459),
        0x1e: _0x50051f(0x36d),
        0x1f: _0x50051f(0x182),
        0x20: _0x50051f(0x49d),
        0x21: _0x50051f(0x529),
        0x22: _0x50051f(0x1fd),
        0x23: 'I&#838;',
        0x24: 'J&#838;',
        0x25: _0x50051f(0x9a),
        0x26: _0x50051f(0x1a1),
        0x27: _0x50051f(0x41c),
        0x28: _0x50051f(0x38),
        0x29: _0x50051f(0x1a6),
        0x2a: _0x50051f(0x49c),
        0x2b: _0x50051f(0x30c),
        0x2c: _0x50051f(0x340),
        0x2d: 'S&#838;',
        0x2e: _0x50051f(0x363),
        0x2f: 'U&#838;',
        0x30: _0x50051f(0x19d),
        0x31: _0x50051f(0x16f),
        0x32: 'X&#838;',
        0x33: _0x50051f(0x439),
        0x34: 'Z&#838;',
        0x35: '1&#838;',
        0x36: '2&#838;',
        0x37: _0x50051f(0x3e),
        0x38: '4&#838;',
        0x39: '5&#838;',
        0x3a: _0x50051f(0x3a9),
        0x3b: _0x50051f(0xa9),
        0x3c: '8&#838;',
        0x3d: _0x50051f(0x511),
        0x3e: _0x50051f(0x392)
    },
    's23': {
        0x1: _0x50051f(0x19),
        0x2: _0x50051f(0x384),
        0x3: 'c&#826;',
        0x4: 'd&#826;',
        0x5: _0x50051f(0xc5),
        0x6: _0x50051f(0x19c),
        0x7: _0x50051f(0x11e),
        0x8: _0x50051f(0x2c),
        0x9: _0x50051f(0x1c7),
        0xa: _0x50051f(0x38d),
        0xb: 'k&#826;',
        0xc: _0x50051f(0x4ce),
        0xd: _0x50051f(0x441),
        0xe: _0x50051f(0x2b2),
        0xf: _0x50051f(0x36c),
        0x10: _0x50051f(0x1a),
        0x11: 'q&#826;',
        0x12: _0x50051f(0x21f),
        0x13: _0x50051f(0x46b),
        0x14: _0x50051f(0x13a),
        0x15: 'u&#826;',
        0x16: _0x50051f(0x295),
        0x17: _0x50051f(0x148),
        0x18: _0x50051f(0x3c7),
        0x19: _0x50051f(0x80),
        0x1a: 'z&#826;',
        0x1b: _0x50051f(0xe5),
        0x1c: _0x50051f(0x372),
        0x1d: _0x50051f(0xea),
        0x1e: _0x50051f(0x442),
        0x1f: _0x50051f(0x7),
        0x20: _0x50051f(0x4b7),
        0x21: _0x50051f(0x3a3),
        0x22: _0x50051f(0x2da),
        0x23: 'I&#826;',
        0x24: _0x50051f(0x4f6),
        0x25: 'K&#826;',
        0x26: _0x50051f(0x2fe),
        0x27: 'M&#826;',
        0x28: 'N&#826;',
        0x29: 'O&#826;',
        0x2a: 'P&#826;',
        0x2b: _0x50051f(0x2db),
        0x2c: _0x50051f(0x97),
        0x2d: _0x50051f(0x3a4),
        0x2e: _0x50051f(0x2f3),
        0x2f: _0x50051f(0x169),
        0x30: _0x50051f(0x40c),
        0x31: _0x50051f(0x45a),
        0x32: 'X&#826;',
        0x33: 'Y&#826;',
        0x34: 'Z&#826;',
        0x35: _0x50051f(0x3dc),
        0x36: _0x50051f(0x218),
        0x37: _0x50051f(0x4b8),
        0x38: '4&#826;',
        0x39: _0x50051f(0x486),
        0x3a: '6&#826;',
        0x3b: _0x50051f(0xa6),
        0x3c: '8&#826;',
        0x3d: _0x50051f(0x51),
        0x3e: '0&#826;'
    },
    's24': {
        0x1: _0x50051f(0x4b0),
        0x2: _0x50051f(0x26e),
        0x3: _0x50051f(0x51d),
        0x4: _0x50051f(0x478),
        0x5: _0x50051f(0x421),
        0x6: _0x50051f(0x15d),
        0x7: _0x50051f(0x226),
        0x8: 'h&#857;',
        0x9: 'i&#857;',
        0xa: _0x50051f(0xf5),
        0xb: _0x50051f(0x4f1),
        0xc: _0x50051f(0x3e3),
        0xd: _0x50051f(0x168),
        0xe: 'n&#857;',
        0xf: 'o&#857;',
        0x10: _0x50051f(0x495),
        0x11: _0x50051f(0x440),
        0x12: _0x50051f(0x2bb),
        0x13: _0x50051f(0x1e7),
        0x14: _0x50051f(0x2c7),
        0x15: 'u&#857;',
        0x16: _0x50051f(0x1e4),
        0x17: _0x50051f(0x299),
        0x18: _0x50051f(0x481),
        0x19: 'y&#857;',
        0x1a: _0x50051f(0x3d7),
        0x1b: _0x50051f(0x52f),
        0x1c: _0x50051f(0x535),
        0x1d: 'C&#857;',
        0x1e: _0x50051f(0x501),
        0x1f: 'E&#857;',
        0x20: _0x50051f(0x38a),
        0x21: _0x50051f(0x388),
        0x22: _0x50051f(0x3c9),
        0x23: _0x50051f(0x26f),
        0x24: _0x50051f(0x4ea),
        0x25: 'K&#857;',
        0x26: _0x50051f(0xba),
        0x27: _0x50051f(0x520),
        0x28: _0x50051f(0x533),
        0x29: _0x50051f(0x4a7),
        0x2a: _0x50051f(0xda),
        0x2b: 'Q&#857;',
        0x2c: _0x50051f(0x31b),
        0x2d: _0x50051f(0xe1),
        0x2e: _0x50051f(0x256),
        0x2f: _0x50051f(0x11),
        0x30: _0x50051f(0x3e0),
        0x31: _0x50051f(0x403),
        0x32: _0x50051f(0x3d3),
        0x33: _0x50051f(0x358),
        0x34: _0x50051f(0x1fa),
        0x35: _0x50051f(0x232),
        0x36: _0x50051f(0x20c),
        0x37: '3&#857;',
        0x38: _0x50051f(0x284),
        0x39: _0x50051f(0x2e8),
        0x3a: _0x50051f(0x507),
        0x3b: _0x50051f(0x77),
        0x3c: _0x50051f(0x41),
        0x3d: _0x50051f(0x406),
        0x3e: _0x50051f(0x352)
    },
    's25': {
        0x1: _0x50051f(0x19f),
        0x2: 'b&#799;',
        0x3: _0x50051f(0x1b6),
        0x4: _0x50051f(0x1f1),
        0x5: _0x50051f(0x53d),
        0x6: _0x50051f(0x91),
        0x7: _0x50051f(0x2ff),
        0x8: _0x50051f(0x234),
        0x9: 'i&#799;',
        0xa: _0x50051f(0x271),
        0xb: 'k&#799;',
        0xc: _0x50051f(0x3e5),
        0xd: 'm&#799;',
        0xe: _0x50051f(0x2b6),
        0xf: _0x50051f(0x4b6),
        0x10: _0x50051f(0x5a),
        0x11: 'q&#799;',
        0x12: _0x50051f(0xff),
        0x13: _0x50051f(0x409),
        0x14: _0x50051f(0x281),
        0x15: _0x50051f(0x500),
        0x16: _0x50051f(0xd3),
        0x17: 'w&#799;',
        0x18: 'x&#799;',
        0x19: _0x50051f(0x9b),
        0x1a: _0x50051f(0x269),
        0x1b: 'A&#799;',
        0x1c: _0x50051f(0x428),
        0x1d: _0x50051f(0x509),
        0x1e: _0x50051f(0x4f3),
        0x1f: 'E&#799;',
        0x20: _0x50051f(0x186),
        0x21: _0x50051f(0x3ba),
        0x22: 'H&#799;',
        0x23: _0x50051f(0x113),
        0x24: _0x50051f(0x31f),
        0x25: _0x50051f(0x94),
        0x26: _0x50051f(0x1b0),
        0x27: _0x50051f(0x1c6),
        0x28: _0x50051f(0x3db),
        0x29: _0x50051f(0x3bf),
        0x2a: _0x50051f(0xfe),
        0x2b: 'Q&#799;',
        0x2c: 'R&#799;',
        0x2d: _0x50051f(0x37a),
        0x2e: _0x50051f(0x3b2),
        0x2f: _0x50051f(0x467),
        0x30: _0x50051f(0x89),
        0x31: _0x50051f(0x3b7),
        0x32: 'X&#799;',
        0x33: 'Y&#799;',
        0x34: _0x50051f(0xd8),
        0x35: _0x50051f(0x1eb),
        0x36: _0x50051f(0x4c0),
        0x37: _0x50051f(0x29a),
        0x38: _0x50051f(0x424),
        0x39: '5&#799;',
        0x3a: '6&#799;',
        0x3b: '7&#799;',
        0x3c: _0x50051f(0xd6),
        0x3d: _0x50051f(0x33f),
        0x3e: '0&#799;'
    },
    's26': {
        0x1: _0x50051f(0x4fb),
        0x2: _0x50051f(0x11b),
        0x3: 'c&#846;',
        0x4: _0x50051f(0x154),
        0x5: 'e&#846;',
        0x6: _0x50051f(0x378),
        0x7: 'g&#846;',
        0x8: _0x50051f(0x3ee),
        0x9: _0x50051f(0x423),
        0xa: 'j&#846;',
        0xb: _0x50051f(0x22f),
        0xc: _0x50051f(0x1d0),
        0xd: 'm&#846;',
        0xe: _0x50051f(0x1b2),
        0xf: _0x50051f(0x2b5),
        0x10: _0x50051f(0x43a),
        0x11: 'q&#846;',
        0x12: 'r&#846;',
        0x13: _0x50051f(0x2c8),
        0x14: _0x50051f(0x2a7),
        0x15: _0x50051f(0x3c5),
        0x16: _0x50051f(0x93),
        0x17: _0x50051f(0x435),
        0x18: _0x50051f(0x238),
        0x19: _0x50051f(0xed),
        0x1a: _0x50051f(0x101),
        0x1b: _0x50051f(0x1e0),
        0x1c: _0x50051f(0x513),
        0x1d: 'C&#846;',
        0x1e: _0x50051f(0x63),
        0x1f: 'E&#846;',
        0x20: _0x50051f(0x75),
        0x21: 'G&#846;',
        0x22: _0x50051f(0x488),
        0x23: _0x50051f(0x160),
        0x24: _0x50051f(0x1bb),
        0x25: _0x50051f(0x3f),
        0x26: _0x50051f(0x20),
        0x27: 'M&#846;',
        0x28: _0x50051f(0x451),
        0x29: _0x50051f(0x134),
        0x2a: _0x50051f(0x4f0),
        0x2b: _0x50051f(0x2be),
        0x2c: 'R&#846;',
        0x2d: 'S&#846;',
        0x2e: _0x50051f(0x27d),
        0x2f: _0x50051f(0x447),
        0x30: _0x50051f(0x104),
        0x31: _0x50051f(0x10d),
        0x32: _0x50051f(0x124),
        0x33: _0x50051f(0x252),
        0x34: _0x50051f(0x6b),
        0x35: _0x50051f(0x20b),
        0x36: _0x50051f(0x476),
        0x37: _0x50051f(0x70),
        0x38: _0x50051f(0x31a),
        0x39: _0x50051f(0x2dd),
        0x3a: _0x50051f(0x126),
        0x3b: _0x50051f(0x1d1),
        0x3c: _0x50051f(0x1ff),
        0x3d: _0x50051f(0x2ec),
        0x3e: _0x50051f(0x396)
    },
    's27': {
        0x1: _0x50051f(0x2f6),
        0x2: _0x50051f(0x3d2),
        0x3: 'c&#829;&#851;',
        0x4: _0x50051f(0x532),
        0x5: _0x50051f(0x250),
        0x6: _0x50051f(0x62),
        0x7: _0x50051f(0x263),
        0x8: 'h&#829;&#851;',
        0x9: 'i&#829;&#851;',
        0xa: _0x50051f(0x38f),
        0xb: 'k&#829;&#851;',
        0xc: _0x50051f(0x4e5),
        0xd: _0x50051f(0xae),
        0xe: _0x50051f(0x4fc),
        0xf: 'o&#829;&#851;',
        0x10: 'p&#829;&#851;',
        0x11: _0x50051f(0x28d),
        0x12: _0x50051f(0x3b1),
        0x13: _0x50051f(0x12f),
        0x14: _0x50051f(0x4b1),
        0x15: _0x50051f(0x38b),
        0x16: _0x50051f(0x2de),
        0x17: _0x50051f(0x223),
        0x18: _0x50051f(0x4cc),
        0x19: _0x50051f(0x20d),
        0x1a: _0x50051f(0x393),
        0x1b: _0x50051f(0x455),
        0x1c: 'B&#829;&#851;',
        0x1d: _0x50051f(0x1db),
        0x1e: _0x50051f(0x2c6),
        0x1f: _0x50051f(0x246),
        0x20: _0x50051f(0x515),
        0x21: _0x50051f(0x61),
        0x22: _0x50051f(0x1ab),
        0x23: _0x50051f(0x362),
        0x24: _0x50051f(0xbd),
        0x25: _0x50051f(0x2d3),
        0x26: _0x50051f(0x4e7),
        0x27: _0x50051f(0x1b4),
        0x28: _0x50051f(0x86),
        0x29: 'O&#829;&#851;',
        0x2a: _0x50051f(0x40f),
        0x2b: _0x50051f(0x4e0),
        0x2c: _0x50051f(0x43d),
        0x2d: _0x50051f(0x150),
        0x2e: _0x50051f(0x50c),
        0x2f: _0x50051f(0x2e9),
        0x30: _0x50051f(0x221),
        0x31: _0x50051f(0x16d),
        0x32: _0x50051f(0x1c5),
        0x33: 'Y&#829;&#851;',
        0x34: _0x50051f(0xd2),
        0x35: _0x50051f(0x39d),
        0x36: _0x50051f(0x1b9),
        0x37: _0x50051f(0x5f),
        0x38: '4&#829;&#851;',
        0x39: _0x50051f(0x6e),
        0x3a: _0x50051f(0x9d),
        0x3b: _0x50051f(0x3f2),
        0x3c: _0x50051f(0x2e0),
        0x3d: '9&#829;&#851;',
        0x3e: _0x50051f(0x2d2)
    },
    's29': {
        0x1: _0x50051f(0x11f),
        0x2: _0x50051f(0x3e1),
        0x3: _0x50051f(0x1cc),
        0x4: '&#120461;&#823;',
        0x5: _0x50051f(0x43),
        0x6: _0x50051f(0x4c5),
        0x7: _0x50051f(0x3ea),
        0x8: _0x50051f(0x3ce),
        0x9: '&#120466;&#823;',
        0xa: '&#120467;&#823;',
        0xb: _0x50051f(0xf7),
        0xc: _0x50051f(0x170),
        0xd: _0x50051f(0x1bc),
        0xe: '&#120471;&#823;',
        0xf: '&#120472;&#823;',
        0x10: _0x50051f(0x5),
        0x11: _0x50051f(0x521),
        0x12: _0x50051f(0x44a),
        0x13: '&#120476;&#823;',
        0x14: _0x50051f(0x47a),
        0x15: _0x50051f(0xe6),
        0x16: _0x50051f(0x158),
        0x17: _0x50051f(0x3ca),
        0x18: '&#120481;&#823;',
        0x19: _0x50051f(0x4aa),
        0x1a: _0x50051f(0x13e),
        0x1b: _0x50051f(0x20a),
        0x1c: _0x50051f(0x3c8),
        0x1d: _0x50051f(0x516),
        0x1e: _0x50051f(0x4c9),
        0x1f: _0x50051f(0x51a),
        0x20: _0x50051f(0x395),
        0x21: _0x50051f(0xad),
        0x22: _0x50051f(0x4b9),
        0x23: _0x50051f(0x40d),
        0x24: _0x50051f(0x34e),
        0x25: '&#120442;&#823;',
        0x26: _0x50051f(0x4b5),
        0x27: _0x50051f(0x3bc),
        0x28: _0x50051f(0x22a),
        0x29: _0x50051f(0x469),
        0x2a: _0x50051f(0x3e7),
        0x2b: _0x50051f(0x3e6),
        0x2c: _0x50051f(0xe2),
        0x2d: '&#120450;&#823;',
        0x2e: _0x50051f(0x303),
        0x2f: _0x50051f(0x4a0),
        0x30: _0x50051f(0x420),
        0x31: _0x50051f(0x356),
        0x32: _0x50051f(0x4f2),
        0x33: _0x50051f(0x24f),
        0x34: '&#120457;&#823;',
        0x35: _0x50051f(0x14d),
        0x36: _0x50051f(0x332),
        0x37: _0x50051f(0x171),
        0x38: _0x50051f(0x25f),
        0x39: _0x50051f(0x4a2),
        0x3a: _0x50051f(0x129),
        0x3b: _0x50051f(0x50b),
        0x3c: _0x50051f(0x2c0),
        0x3d: '&#120831;&#823;',
        0x3e: _0x50051f(0x208)
    },
    's30': {
        0x1: 'a&#866;',
        0x2: _0x50051f(0x4f5),
        0x3: _0x50051f(0x28a),
        0x4: _0x50051f(0x361),
        0x5: 'e&#866;',
        0x6: _0x50051f(0x222),
        0x7: _0x50051f(0x30f),
        0x8: _0x50051f(0x2f4),
        0x9: 'i&#866;',
        0xa: 'j&#866;',
        0xb: _0x50051f(0x360),
        0xc: _0x50051f(0x11d),
        0xd: _0x50051f(0x283),
        0xe: _0x50051f(0x187),
        0xf: 'o&#866;',
        0x10: _0x50051f(0x314),
        0x11: 'q&#866;',
        0x12: 'r&#866;',
        0x13: _0x50051f(0x468),
        0x14: _0x50051f(0xb0),
        0x15: _0x50051f(0x71),
        0x16: _0x50051f(0x197),
        0x17: _0x50051f(0x27c),
        0x18: _0x50051f(0x4fd),
        0x19: _0x50051f(0x240),
        0x1a: 'z&#866;',
        0x1b: _0x50051f(0x13f),
        0x1c: _0x50051f(0x159),
        0x1d: 'C&#866;',
        0x1e: _0x50051f(0x2ac),
        0x1f: _0x50051f(0xee),
        0x20: _0x50051f(0x391),
        0x21: _0x50051f(0x47e),
        0x22: _0x50051f(0x412),
        0x23: _0x50051f(0x4d7),
        0x24: _0x50051f(0x3df),
        0x25: _0x50051f(0x3fc),
        0x26: _0x50051f(0x49e),
        0x27: 'M&#866;',
        0x28: 'N&#866;',
        0x29: _0x50051f(0x389),
        0x2a: 'P&#866;',
        0x2b: _0x50051f(0x2c4),
        0x2c: 'R&#866;',
        0x2d: 'S&#866;',
        0x2e: _0x50051f(0x190),
        0x2f: 'U&#866;',
        0x30: _0x50051f(0x25a),
        0x31: 'W&#866;',
        0x32: 'X&#866;',
        0x33: _0x50051f(0x400),
        0x34: _0x50051f(0xac),
        0x35: _0x50051f(0xb5),
        0x36: _0x50051f(0x3fb),
        0x37: _0x50051f(0x15c),
        0x38: _0x50051f(0x3cd),
        0x39: _0x50051f(0x48f),
        0x3a: _0x50051f(0x3b8),
        0x3b: _0x50051f(0x445),
        0x3c: '8&#866;',
        0x3d: _0x50051f(0x2d5),
        0x3e: _0x50051f(0x3b5)
    },
    's31': {
        0x1: _0x50051f(0x433),
        0x2: _0x50051f(0x35c),
        0x3: _0x50051f(0x265),
        0x4: _0x50051f(0x30b),
        0x5: _0x50051f(0x231),
        0x6: _0x50051f(0x4f8),
        0x7: 'g&#828;',
        0x8: _0x50051f(0x37c),
        0x9: 'i&#828;',
        0xa: _0x50051f(0x1c9),
        0xb: _0x50051f(0x111),
        0xc: _0x50051f(0x19e),
        0xd: 'm&#828;',
        0xe: _0x50051f(0x5b),
        0xf: _0x50051f(0x108),
        0x10: _0x50051f(0x2fd),
        0x11: 'q&#828;',
        0x12: _0x50051f(0x2eb),
        0x13: _0x50051f(0x40),
        0x14: _0x50051f(0x33d),
        0x15: _0x50051f(0x348),
        0x16: _0x50051f(0x1c2),
        0x17: 'w&#828;',
        0x18: _0x50051f(0x96),
        0x19: _0x50051f(0x4a1),
        0x1a: _0x50051f(0x1b3),
        0x1b: 'A&#828;',
        0x1c: 'B&#828;',
        0x1d: _0x50051f(0x202),
        0x1e: _0x50051f(0x139),
        0x1f: _0x50051f(0x28c),
        0x20: _0x50051f(0x330),
        0x21: _0x50051f(0x1b5),
        0x22: _0x50051f(0x167),
        0x23: _0x50051f(0x357),
        0x24: 'J&#828;',
        0x25: _0x50051f(0x18a),
        0x26: 'L&#828;',
        0x27: 'M&#828;',
        0x28: _0x50051f(0x2ef),
        0x29: _0x50051f(0x4f4),
        0x2a: _0x50051f(0xf4),
        0x2b: 'Q&#828;',
        0x2c: _0x50051f(0x36b),
        0x2d: 'S&#828;',
        0x2e: _0x50051f(0x1dd),
        0x2f: 'U&#828;',
        0x30: 'V&#828;',
        0x31: _0x50051f(0x46d),
        0x32: _0x50051f(0x25d),
        0x33: _0x50051f(0x12c),
        0x34: _0x50051f(0x1e1),
        0x35: _0x50051f(0x301),
        0x36: _0x50051f(0x26d),
        0x37: _0x50051f(0x492),
        0x38: _0x50051f(0x1e3),
        0x39: _0x50051f(0x20e),
        0x3a: _0x50051f(0x23f),
        0x3b: _0x50051f(0x519),
        0x3c: '8&#828;',
        0x3d: '9&#828;',
        0x3e: _0x50051f(0x5c)
    }
};

function Change(_0xd018d5, _0x45275c) {
    var _0x1f94ac = _0x50051f,
        _0x70233e = '',
        _0xd018d5 = _0xd018d5;
    if (_0xd018d5[_0x1f94ac(0x353)] == 0x0) return;
    for (i = 0x0; i < _0xd018d5[_0x1f94ac(0x353)]; i++) {
        var _0x32ce67 = _0xd018d5['charAt'](i),
            _0x34c120 = normal[_0x1f94ac(0x290)](_0x32ce67) + 0x1;
        if (_0x32ce67 == '\x20') _0x70233e += '\x20';
        else !_0x34c120 ? _0x70233e += _0x32ce67 : _0x70233e += newtext[_0x45275c][_0x34c120];
    }
    return _0x70233e;
}
const futureAlienCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑢ',
        'd': 'ᕲ',
        'e': 'ᘿ',
        'f': 'ᖴ',
        'g': 'ᘜ',
        'h': 'ᕼ',
        'i': 'ᓰ',
        'j': 'ᒚ',
        'k': 'ᖽᐸ',
        'l': 'ᒪ',
        'm': 'ᘻ',
        'n': 'ᘉ',
        'o': 'ᓍ',
        'p': 'ᕵ',
        'q': 'ᕴ',
        'r': 'ᖇ',
        's': 'S',
        't': 'ᖶ',
        'u': 'ᑘ',
        'v': 'ᐺ',
        'w': 'ᘺ',
        'x': '᙭',
        'y': 'ᖻ',
        'z': 'ᗱ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑢ',
        'D': 'ᕲ',
        'E': 'ᘿ',
        'F': 'ᖴ',
        'G': 'ᘜ',
        'H': 'ᕼ',
        'I': 'ᓰ',
        'J': 'ᒚ',
        'K': 'ᖽᐸ',
        'L': 'ᒪ',
        'M': 'ᘻ',
        'N': 'ᘉ',
        'O': 'ᓍ',
        'P': 'ᕵ',
        'Q': 'ᕴ',
        'R': 'ᖇ',
        'S': 'S',
        'T': 'ᖶ',
        'U': 'ᑘ',
        'V': 'ᐺ',
        'W': 'ᘺ',
        'X': '᙭',
        'Y': 'ᖻ',
        'Z': 'ᗱ'
    },
    squiggle6CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๖',
        'c': '¢',
        'd': '໓',
        'e': 'ē',
        'f': 'f',
        'g': 'ງ',
        'h': 'h',
        'i': 'i',
        'j': 'ว',
        'k': 'k',
        'l': 'l',
        'm': '๓',
        'n': 'ຖ',
        'o': '໐',
        'p': 'p',
        'q': '๑',
        'r': 'r',
        's': 'Ş',
        't': 't',
        'u': 'น',
        'v': 'ง',
        'w': 'ຟ',
        'x': 'x',
        'y': 'ฯ',
        'z': 'ຊ',
        'A': 'ค',
        'B': '๖',
        'C': '¢',
        'D': '໓',
        'E': 'ē',
        'F': 'f',
        'G': 'ງ',
        'H': 'h',
        'I': 'i',
        'J': 'ว',
        'K': 'k',
        'L': 'l',
        'M': '๓',
        'N': 'ຖ',
        'O': '໐',
        'P': 'p',
        'Q': '๑',
        'R': 'r',
        'S': 'Ş',
        'T': 't',
        'U': 'น',
        'V': 'ง',
        'W': 'ຟ',
        'X': 'x',
        'Y': 'ฯ',
        'Z': 'ຊ'
    },
    squiggle5CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ą',
        'b': 'ც',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɠ',
        'h': 'ɧ',
        'i': 'ı',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'Ɩ',
        'm': 'ɱ',
        'n': 'ŋ',
        'o': 'ơ',
        'p': '℘',
        'q': 'զ',
        'r': 'ཞ',
        's': 'ʂ',
        't': 'ɬ',
        'u': 'ų',
        'v': '۷',
        'w': 'ῳ',
        'x': 'ҳ',
        'y': 'ყ',
        'z': 'ʑ',
        'A': 'ą',
        'B': 'ც',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɠ',
        'H': 'ɧ',
        'I': 'ı',
        'J': 'ʝ',
        'K': 'ƙ',
        'L': 'Ɩ',
        'M': 'ɱ',
        'N': 'ŋ',
        'O': 'ơ',
        'P': '℘',
        'Q': 'զ',
        'R': 'ཞ',
        'S': 'ʂ',
        'T': 'ɬ',
        'U': 'ų',
        'V': '۷',
        'W': 'ῳ',
        'X': 'ҳ',
        'Y': 'ყ',
        'Z': 'ʑ'
    },
    asianStyle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ﾑ',
        'b': '乃',
        'c': 'ᄃ',
        'd': 'り',
        'e': '乇',
        'f': 'ｷ',
        'g': 'ム',
        'h': 'ん',
        'i': 'ﾉ',
        'j': 'ﾌ',
        'k': 'ズ',
        'l': 'ﾚ',
        'm': 'ﾶ',
        'n': '刀',
        'o': 'の',
        'p': 'ｱ',
        'q': 'ゐ',
        'r': '尺',
        's': '丂',
        't': 'ｲ',
        'u': 'ひ',
        'v': '√',
        'w': 'W',
        'x': 'ﾒ',
        'y': 'ﾘ',
        'z': '乙',
        'A': 'ﾑ',
        'B': '乃',
        'C': 'ᄃ',
        'D': 'り',
        'E': '乇',
        'F': 'ｷ',
        'G': 'ム',
        'H': 'ん',
        'I': 'ﾉ',
        'J': 'ﾌ',
        'K': 'ズ',
        'L': 'ﾚ',
        'M': 'ﾶ',
        'N': '刀',
        'O': 'の',
        'P': 'ｱ',
        'Q': 'ゐ',
        'R': '尺',
        'S': '丂',
        'T': 'ｲ',
        'U': 'ひ',
        'V': '√',
        'W': 'W',
        'X': 'ﾒ',
        'Y': 'ﾘ',
        'Z': '乙'
    },
    asianStyleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '卂',
        'b': '乃',
        'c': '匚',
        'd': 'ᗪ',
        'e': '乇',
        'f': '千',
        'g': 'Ꮆ',
        'h': '卄',
        'i': '丨',
        'j': 'ﾌ',
        'k': 'Ҝ',
        'l': 'ㄥ',
        'm': '爪',
        'n': '几',
        'o': 'ㄖ',
        'p': '卩',
        'q': 'Ɋ',
        'r': '尺',
        's': '丂',
        't': 'ㄒ',
        'u': 'ㄩ',
        'v': 'ᐯ',
        'w': '山',
        'x': '乂',
        'y': 'ㄚ',
        'z': '乙',
        'A': '卂',
        'B': '乃',
        'C': '匚',
        'D': 'ᗪ',
        'E': '乇',
        'F': '千',
        'G': 'Ꮆ',
        'H': '卄',
        'I': '丨',
        'J': 'ﾌ',
        'K': 'Ҝ',
        'L': 'ㄥ',
        'M': '爪',
        'N': '几',
        'O': 'ㄖ',
        'P': '卩',
        'Q': 'Ɋ',
        'R': '尺',
        'S': '丂',
        'T': 'ㄒ',
        'U': 'ㄩ',
        'V': 'ᐯ',
        'W': '山',
        'X': '乂',
        'Y': 'ㄚ',
        'Z': '乙'
    },
    squaresCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '🄰',
        'b': '🄱',
        'c': '🄲',
        'd': '🄳',
        'e': '🄴',
        'f': '🄵',
        'g': '🄶',
        'h': '🄷',
        'i': '🄸',
        'j': '🄹',
        'k': '🄺',
        'l': '🄻',
        'm': '🄼',
        'n': '🄽',
        'o': '🄾',
        'p': '🄿',
        'q': '🅀',
        'r': '🅁',
        's': '🅂',
        't': '🅃',
        'u': '🅄',
        'v': '🅅',
        'w': '🅆',
        'x': '🅇',
        'y': '🅈',
        'z': '🅉',
        'A': '🄰',
        'B': '🄱',
        'C': '🄲',
        'D': '🄳',
        'E': '🄴',
        'F': '🄵',
        'G': '🄶',
        'H': '🄷',
        'I': '🄸',
        'J': '🄹',
        'K': '🄺',
        'L': '🄻',
        'M': '🄼',
        'N': '🄽',
        'O': '🄾',
        'P': '🄿',
        'Q': '🅀',
        'R': '🅁',
        'S': '🅂',
        'T': '🅃',
        'U': '🅄',
        'V': '🅅',
        'W': '🅆',
        'X': '🅇',
        'Y': '🅈',
        'Z': '🅉'
    },
    squiggle4CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Ꮧ',
        'b': 'Ᏸ',
        'c': 'ፈ',
        'd': 'Ꮄ',
        'e': 'Ꮛ',
        'f': 'Ꭶ',
        'g': 'Ꮆ',
        'h': 'Ꮒ',
        'i': 'Ꭵ',
        'j': 'Ꮰ',
        'k': 'Ꮶ',
        'l': 'Ꮭ',
        'm': 'Ꮇ',
        'n': 'Ꮑ',
        'o': 'Ꭷ',
        'p': 'Ꭾ',
        'q': 'Ꭴ',
        'r': 'Ꮢ',
        's': 'Ꮥ',
        't': 'Ꮦ',
        'u': 'Ꮼ',
        'v': 'Ꮙ',
        'w': 'Ꮗ',
        'x': 'ጀ',
        'y': 'Ꭹ',
        'z': 'ፚ',
        'A': 'Ꮧ',
        'B': 'Ᏸ',
        'C': 'ፈ',
        'D': 'Ꮄ',
        'E': 'Ꮛ',
        'F': 'Ꭶ',
        'G': 'Ꮆ',
        'H': 'Ꮒ',
        'I': 'Ꭵ',
        'J': 'Ꮰ',
        'K': 'Ꮶ',
        'L': 'Ꮭ',
        'M': 'Ꮇ',
        'N': 'Ꮑ',
        'O': 'Ꭷ',
        'P': 'Ꭾ',
        'Q': 'Ꭴ',
        'R': 'Ꮢ',
        'S': 'Ꮥ',
        'T': 'Ꮦ',
        'U': 'Ꮼ',
        'V': 'Ꮙ',
        'W': 'Ꮗ',
        'X': 'ጀ',
        'Y': 'Ꭹ',
        'Z': 'ፚ'
    },
    neonCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ᗩ',
        'b': 'ᗷ',
        'c': 'ᑕ',
        'd': 'ᗪ',
        'e': 'E',
        'f': 'ᖴ',
        'g': 'G',
        'h': 'ᕼ',
        'i': 'I',
        'j': 'ᒍ',
        'k': 'K',
        'l': 'ᒪ',
        'm': 'ᗰ',
        'n': 'ᑎ',
        'o': 'O',
        'p': 'ᑭ',
        'q': 'ᑫ',
        'r': 'ᖇ',
        's': 'ᔕ',
        't': 'T',
        'u': 'ᑌ',
        'v': 'ᐯ',
        'w': 'ᗯ',
        'x': '᙭',
        'y': 'Y',
        'z': 'ᘔ',
        'A': 'ᗩ',
        'B': 'ᗷ',
        'C': 'ᑕ',
        'D': 'ᗪ',
        'E': 'E',
        'F': 'ᖴ',
        'G': 'G',
        'H': 'ᕼ',
        'I': 'I',
        'J': 'ᒍ',
        'K': 'K',
        'L': 'ᒪ',
        'M': 'ᗰ',
        'N': 'ᑎ',
        'O': 'O',
        'P': 'ᑭ',
        'Q': 'ᑫ',
        'R': 'ᖇ',
        'S': 'ᔕ',
        'T': 'T',
        'U': 'ᑌ',
        'V': 'ᐯ',
        'W': 'ᗯ',
        'X': '᙭',
        'Y': 'Y',
        'Z': 'ᘔ'
    },
    squiggle3CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ǟ',
        'b': 'ɮ',
        'c': 'ƈ',
        'd': 'ɖ',
        'e': 'ɛ',
        'f': 'ʄ',
        'g': 'ɢ',
        'h': 'ɦ',
        'i': 'ɨ',
        'j': 'ʝ',
        'k': 'ӄ',
        'l': 'ʟ',
        'm': 'ʍ',
        'n': 'ռ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ʀ',
        's': 'ֆ',
        't': 'ȶ',
        'u': 'ʊ',
        'v': 'ʋ',
        'w': 'ա',
        'x': 'Ӽ',
        'y': 'ʏ',
        'z': 'ʐ',
        'A': 'ǟ',
        'B': 'ɮ',
        'C': 'ƈ',
        'D': 'ɖ',
        'E': 'ɛ',
        'F': 'ʄ',
        'G': 'ɢ',
        'H': 'ɦ',
        'I': 'ɨ',
        'J': 'ʝ',
        'K': 'ӄ',
        'L': 'ʟ',
        'M': 'ʍ',
        'N': 'ռ',
        'O': 'օ',
        'P': 'ք',
        'Q': 'զ',
        'R': 'ʀ',
        'S': 'ֆ',
        'T': 'ȶ',
        'U': 'ʊ',
        'V': 'ʋ',
        'W': 'ա',
        'X': 'Ӽ',
        'Y': 'ʏ',
        'Z': 'ʐ'
    },
    monospaceCharMap = {
        0x0: '𝟶',
        0x1: '𝟷',
        0x2: '𝟸',
        0x3: '𝟹',
        0x4: '𝟺',
        0x5: '𝟻',
        0x6: '𝟼',
        0x7: '𝟽',
        0x8: '𝟾',
        0x9: '𝟿',
        'a': '𝚊',
        'b': '𝚋',
        'c': '𝚌',
        'd': '𝚍',
        'e': '𝚎',
        'f': '𝚏',
        'g': '𝚐',
        'h': '𝚑',
        'i': '𝚒',
        'j': '𝚓',
        'k': '𝚔',
        'l': '𝚕',
        'm': '𝚖',
        'n': '𝚗',
        'o': '𝚘',
        'p': '𝚙',
        'q': '𝚚',
        'r': '𝚛',
        's': '𝚜',
        't': '𝚝',
        'u': '𝚞',
        'v': '𝚟',
        'w': '𝚠',
        'x': '𝚡',
        'y': '𝚢',
        'z': '𝚣',
        'A': '𝙰',
        'B': '𝙱',
        'C': '𝙲',
        'D': '𝙳',
        'E': '𝙴',
        'F': '𝙵',
        'G': '𝙶',
        'H': '𝙷',
        'I': '𝙸',
        'J': '𝙹',
        'K': '𝙺',
        'L': '𝙻',
        'M': '𝙼',
        'N': '𝙽',
        'O': '𝙾',
        'P': '𝙿',
        'Q': '𝚀',
        'R': '𝚁',
        'S': '𝚂',
        'T': '𝚃',
        'U': '𝚄',
        'V': '𝚅',
        'W': '𝚆',
        'X': '𝚇',
        'Y': '𝚈',
        'Z': '𝚉'
    },
    boldItalicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝙖',
        'b': '𝙗',
        'c': '𝙘',
        'd': '𝙙',
        'e': '𝙚',
        'f': '𝙛',
        'g': '𝙜',
        'h': '𝙝',
        'i': '𝙞',
        'j': '𝙟',
        'k': '𝙠',
        'l': '𝙡',
        'm': '𝙢',
        'n': '𝙣',
        'o': '𝙤',
        'p': '𝙥',
        'q': '𝙦',
        'r': '𝙧',
        's': '𝙨',
        't': '𝙩',
        'u': '𝙪',
        'v': '𝙫',
        'w': '𝙬',
        'x': '𝙭',
        'y': '𝙮',
        'z': '𝙯',
        'A': '𝘼',
        'B': '𝘽',
        'C': '𝘾',
        'D': '𝘿',
        'E': '𝙀',
        'F': '𝙁',
        'G': '𝙂',
        'H': '𝙃',
        'I': '𝙄',
        'J': '𝙅',
        'K': '𝙆',
        'L': '𝙇',
        'M': '𝙈',
        'N': '𝙉',
        'O': '𝙊',
        'P': '𝙋',
        'Q': '𝙌',
        'R': '𝙍',
        'S': '𝙎',
        'T': '𝙏',
        'U': '𝙐',
        'V': '𝙑',
        'W': '𝙒',
        'X': '𝙓',
        'Y': '𝙔',
        'Z': '𝙕'
    },
    boldCharMap = {
        0x0: '𝟎',
        0x1: '𝟏',
        0x2: '𝟐',
        0x3: '𝟑',
        0x4: '𝟒',
        0x5: '𝟓',
        0x6: '𝟔',
        0x7: '𝟕',
        0x8: '𝟖',
        0x9: '𝟗',
        'a': '𝐚',
        'b': '𝐛',
        'c': '𝐜',
        'd': '𝐝',
        'e': '𝐞',
        'f': '𝐟',
        'g': '𝐠',
        'h': '𝐡',
        'i': '𝐢',
        'j': '𝐣',
        'k': '𝐤',
        'l': '𝐥',
        'm': '𝐦',
        'n': '𝐧',
        'o': '𝐨',
        'p': '𝐩',
        'q': '𝐪',
        'r': '𝐫',
        's': '𝐬',
        't': '𝐭',
        'u': '𝐮',
        'v': '𝐯',
        'w': '𝐰',
        'x': '𝐱',
        'y': '𝐲',
        'z': '𝐳',
        'A': '𝐀',
        'B': '𝐁',
        'C': '𝐂',
        'D': '𝐃',
        'E': '𝐄',
        'F': '𝐅',
        'G': '𝐆',
        'H': '𝐇',
        'I': '𝐈',
        'J': '𝐉',
        'K': '𝐊',
        'L': '𝐋',
        'M': '𝐌',
        'N': '𝐍',
        'O': '𝐎',
        'P': '𝐏',
        'Q': '𝐐',
        'R': '𝐑',
        'S': '𝐒',
        'T': '𝐓',
        'U': '𝐔',
        'V': '𝐕',
        'W': '𝐖',
        'X': '𝐗',
        'Y': '𝐘',
        'Z': '𝐙'
    },
    italicCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝘢',
        'b': '𝘣',
        'c': '𝘤',
        'd': '𝘥',
        'e': '𝘦',
        'f': '𝘧',
        'g': '𝘨',
        'h': '𝘩',
        'i': '𝘪',
        'j': '𝘫',
        'k': '𝘬',
        'l': '𝘭',
        'm': '𝘮',
        'n': '𝘯',
        'o': '𝘰',
        'p': '𝘱',
        'q': '𝘲',
        'r': '𝘳',
        's': '𝘴',
        't': '𝘵',
        'u': '𝘶',
        'v': '𝘷',
        'w': '𝘸',
        'x': '𝘹',
        'y': '𝘺',
        'z': '𝘻',
        'A': '𝘈',
        'B': '𝘉',
        'C': '𝘊',
        'D': '𝘋',
        'E': '𝘌',
        'F': '𝘍',
        'G': '𝘎',
        'H': '𝘏',
        'I': '𝘐',
        'J': '𝘑',
        'K': '𝘒',
        'L': '𝘓',
        'M': '𝘔',
        'N': '𝘕',
        'O': '𝘖',
        'P': '𝘗',
        'Q': '𝘘',
        'R': '𝘙',
        'S': '𝘚',
        'T': '𝘛',
        'U': '𝘜',
        'V': '𝘝',
        'W': '𝘞',
        'X': '𝘟',
        'Y': '𝘠',
        'Z': '𝘡'
    },
    squiggle2CharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'Ⴆ',
        'c': 'ƈ',
        'd': 'ԃ',
        'e': 'ҽ',
        'f': 'ϝ',
        'g': 'ɠ',
        'h': 'ԋ',
        'i': 'ι',
        'j': 'ʝ',
        'k': 'ƙ',
        'l': 'ʅ',
        'm': 'ɱ',
        'n': 'ɳ',
        'o': 'σ',
        'p': 'ρ',
        'q': 'ϙ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'ƚ',
        'u': 'υ',
        'v': 'ʋ',
        'w': 'ɯ',
        'x': 'x',
        'y': 'ყ',
        'z': 'ȥ',
        'A': 'A',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'E',
        'F': 'F',
        'G': 'G',
        'H': 'H',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'N',
        'O': 'O',
        'P': 'P',
        'Q': 'Q',
        'R': 'R',
        'S': 'S',
        'T': 'T',
        'U': 'U',
        'V': 'V',
        'W': 'W',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    currencyCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '₳',
        'b': '฿',
        'c': '₵',
        'd': 'Đ',
        'e': 'Ɇ',
        'f': '₣',
        'g': '₲',
        'h': 'Ⱨ',
        'i': 'ł',
        'j': 'J',
        'k': '₭',
        'l': 'Ⱡ',
        'm': '₥',
        'n': '₦',
        'o': 'Ø',
        'p': '₱',
        'q': 'Q',
        'r': 'Ɽ',
        's': '₴',
        't': '₮',
        'u': 'Ʉ',
        'v': 'V',
        'w': '₩',
        'x': 'Ӿ',
        'y': 'Ɏ',
        'z': 'Ⱬ',
        'A': '₳',
        'B': '฿',
        'C': '₵',
        'D': 'Đ',
        'E': 'Ɇ',
        'F': '₣',
        'G': '₲',
        'H': 'Ⱨ',
        'I': 'ł',
        'J': 'J',
        'K': '₭',
        'L': 'Ⱡ',
        'M': '₥',
        'N': '₦',
        'O': 'Ø',
        'P': '₱',
        'Q': 'Q',
        'R': 'Ɽ',
        'S': '₴',
        'T': '₮',
        'U': 'Ʉ',
        'V': 'V',
        'W': '₩',
        'X': 'Ӿ',
        'Y': 'Ɏ',
        'Z': 'Ⱬ'
    },
    symbolsCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'å',
        'b': 'ß',
        'c': '¢',
        'd': 'Ð',
        'e': 'ê',
        'f': '£',
        'g': 'g',
        'h': 'h',
        'i': 'ï',
        'j': 'j',
        'k': 'k',
        'l': 'l',
        'm': 'm',
        'n': 'ñ',
        'o': 'ð',
        'p': 'þ',
        'q': 'q',
        'r': 'r',
        's': '§',
        't': '†',
        'u': 'µ',
        'v': 'v',
        'w': 'w',
        'x': 'x',
        'y': '¥',
        'z': 'z',
        'A': 'Ä',
        'B': 'ß',
        'C': 'Ç',
        'D': 'Ð',
        'E': 'È',
        'F': '£',
        'G': 'G',
        'H': 'H',
        'I': 'Ì',
        'J': 'J',
        'K': 'K',
        'L': 'L',
        'M': 'M',
        'N': 'ñ',
        'O': 'Ö',
        'P': 'þ',
        'Q': 'Q',
        'R': 'R',
        'S': '§',
        'T': '†',
        'U': 'Ú',
        'V': 'V',
        'W': 'W',
        'X': '×',
        'Y': '¥',
        'Z': 'Z'
    },
    greekCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'α',
        'b': 'в',
        'c': '¢',
        'd': '∂',
        'e': 'є',
        'f': 'ƒ',
        'g': 'g',
        'h': 'н',
        'i': 'ι',
        'j': 'נ',
        'k': 'к',
        'l': 'ℓ',
        'm': 'м',
        'n': 'η',
        'o': 'σ',
        'p': 'ρ',
        'q': 'q',
        'r': 'я',
        's': 'ѕ',
        't': 'т',
        'u': 'υ',
        'v': 'ν',
        'w': 'ω',
        'x': 'χ',
        'y': 'у',
        'z': 'z',
        'A': 'α',
        'B': 'в',
        'C': '¢',
        'D': '∂',
        'E': 'є',
        'F': 'ƒ',
        'G': 'g',
        'H': 'н',
        'I': 'ι',
        'J': 'נ',
        'K': 'к',
        'L': 'ℓ',
        'M': 'м',
        'N': 'η',
        'O': 'σ',
        'P': 'ρ',
        'Q': 'q',
        'R': 'я',
        'S': 'ѕ',
        'T': 'т',
        'U': 'υ',
        'V': 'ν',
        'W': 'ω',
        'X': 'χ',
        'Y': 'у',
        'Z': 'z'
    },
    bentTextCharMap = {
        0x0: '⊘',
        0x1: '𝟙',
        0x2: 'ϩ',
        0x3: 'Ӡ',
        0x4: '५',
        0x5: 'Ƽ',
        0x6: 'Ϭ',
        0x7: '7',
        0x8: '𝟠',
        0x9: '९',
        'a': 'ą',
        'b': 'ҍ',
        'c': 'ç',
        'd': 'ժ',
        'e': 'ҽ',
        'f': 'ƒ',
        'g': 'ց',
        'h': 'հ',
        'i': 'ì',
        'j': 'ʝ',
        'k': 'ҟ',
        'l': 'Ӏ',
        'm': 'ʍ',
        'n': 'ղ',
        'o': 'օ',
        'p': 'ք',
        'q': 'զ',
        'r': 'ɾ',
        's': 'ʂ',
        't': 'է',
        'u': 'մ',
        'v': 'ѵ',
        'w': 'ա',
        'x': '×',
        'y': 'վ',
        'z': 'Հ',
        'A': 'Ⱥ',
        'B': 'β',
        'C': '↻',
        'D': 'Ꭰ',
        'E': 'Ɛ',
        'F': 'Ƒ',
        'G': 'Ɠ',
        'H': 'Ƕ',
        'I': 'į',
        'J': 'ل',
        'K': 'Ҡ',
        'L': 'Ꝉ',
        'M': 'Ɱ',
        'N': 'ហ',
        'O': 'ට',
        'P': 'φ',
        'Q': 'Ҩ',
        'R': 'འ',
        'S': 'Ϛ',
        'T': 'Ͳ',
        'U': 'Ա',
        'V': 'Ỽ',
        'W': 'చ',
        'X': 'ჯ',
        'Y': 'Ӌ',
        'Z': 'ɀ'
    },
    upperAnglesCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'Λ',
        'b': 'B',
        'c': 'ᄃ',
        'd': 'D',
        'e': 'Σ',
        'f': 'F',
        'g': 'G',
        'h': 'Ή',
        'i': 'I',
        'j': 'J',
        'k': 'K',
        'l': 'ᄂ',
        'm': 'M',
        'n': 'П',
        'o': 'Ө',
        'p': 'P',
        'q': 'Q',
        'r': 'Я',
        's': 'Ƨ',
        't': 'Ƭ',
        'u': 'Ц',
        'v': 'V',
        'w': 'Щ',
        'x': 'X',
        'y': 'Y',
        'z': 'Z',
        'A': 'Λ',
        'B': 'B',
        'C': 'ᄃ',
        'D': 'D',
        'E': 'Σ',
        'F': 'F',
        'G': 'G',
        'H': 'Ή',
        'I': 'I',
        'J': 'J',
        'K': 'K',
        'L': 'ᄂ',
        'M': 'M',
        'N': 'П',
        'O': 'Ө',
        'P': 'P',
        'Q': 'Q',
        'R': 'Я',
        'S': 'Ƨ',
        'T': 'Ƭ',
        'U': 'Ц',
        'V': 'V',
        'W': 'Щ',
        'X': 'X',
        'Y': 'Y',
        'Z': 'Z'
    },
    subscriptCharMap = {
        0x0: '₀',
        0x1: '₁',
        0x2: '₂',
        0x3: '₃',
        0x4: '₄',
        0x5: '₅',
        0x6: '₆',
        0x7: '₇',
        0x8: '₈',
        0x9: '₉',
        'a': 'ₐ',
        'b': 'b',
        'c': 'c',
        'd': 'd',
        'e': 'ₑ',
        'f': 'f',
        'g': 'g',
        'h': 'ₕ',
        'i': 'ᵢ',
        'j': 'ⱼ',
        'k': 'ₖ',
        'l': 'ₗ',
        'm': 'ₘ',
        'n': 'ₙ',
        'o': 'ₒ',
        'p': 'ₚ',
        'q': 'q',
        'r': 'ᵣ',
        's': 'ₛ',
        't': 'ₜ',
        'u': 'ᵤ',
        'v': 'ᵥ',
        'w': 'w',
        'x': 'ₓ',
        'y': 'y',
        'z': 'z',
        'A': 'ₐ',
        'B': 'B',
        'C': 'C',
        'D': 'D',
        'E': 'ₑ',
        'F': 'F',
        'G': 'G',
        'H': 'ₕ',
        'I': 'ᵢ',
        'J': 'ⱼ',
        'K': 'ₖ',
        'L': 'ₗ',
        'M': 'ₘ',
        'N': 'ₙ',
        'O': 'ₒ',
        'P': 'ₚ',
        'Q': 'Q',
        'R': 'ᵣ',
        'S': 'ₛ',
        'T': 'ₜ',
        'U': 'ᵤ',
        'V': 'ᵥ',
        'W': 'W',
        'X': 'ₓ',
        'Y': 'Y',
        'Z': 'Z',
        '+': '₊',
        '-': '₋',
        '=': '₌',
        '(': '₍',
        ')': '₎'
    },
    superscriptCharMap = {
        0x0: '⁰',
        0x1: '¹',
        0x2: '²',
        0x3: '³',
        0x4: '⁴',
        0x5: '⁵',
        0x6: '⁶',
        0x7: '⁷',
        0x8: '⁸',
        0x9: '⁹',
        'a': 'ᵃ',
        'b': 'ᵇ',
        'c': 'ᶜ',
        'd': 'ᵈ',
        'e': 'ᵉ',
        'f': 'ᶠ',
        'g': 'ᵍ',
        'h': 'ʰ',
        'i': 'ⁱ',
        'j': 'ʲ',
        'k': 'ᵏ',
        'l': 'ˡ',
        'm': 'ᵐ',
        'n': 'ⁿ',
        'o': 'ᵒ',
        'p': 'ᵖ',
        'q': 'q',
        'r': 'ʳ',
        's': 'ˢ',
        't': 'ᵗ',
        'u': 'ᵘ',
        'v': 'ᵛ',
        'w': 'ʷ',
        'x': 'ˣ',
        'y': 'ʸ',
        'z': 'ᶻ',
        'A': 'ᴬ',
        'B': 'ᴮ',
        'C': 'ᶜ',
        'D': 'ᴰ',
        'E': 'ᴱ',
        'F': 'ᶠ',
        'G': 'ᴳ',
        'H': 'ᴴ',
        'I': 'ᴵ',
        'J': 'ᴶ',
        'K': 'ᴷ',
        'L': 'ᴸ',
        'M': 'ᴹ',
        'N': 'ᴺ',
        'O': 'ᴼ',
        'P': 'ᴾ',
        'Q': 'Q',
        'R': 'ᴿ',
        'S': 'ˢ',
        'T': 'ᵀ',
        'U': 'ᵁ',
        'V': 'ⱽ',
        'W': 'ᵂ',
        'X': 'ˣ',
        'Y': 'ʸ',
        'Z': 'ᶻ',
        '+': '⁺',
        '-': '⁻',
        '=': '⁼',
        '(': '⁽',
        ')': '⁾'
    },
    squiggleCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': 'ค',
        'b': '๒',
        'c': 'ς',
        'd': '๔',
        'e': 'є',
        'f': 'Ŧ',
        'g': 'ﻮ',
        'h': 'ђ',
        'i': 'เ',
        'j': 'ן',
        'k': 'к',
        'l': 'ɭ',
        'm': '๓',
        'n': 'ภ',
        'o': '๏',
        'p': 'ק',
        'q': 'ợ',
        'r': 'г',
        's': 'ร',
        't': 'Շ',
        'u': 'ย',
        'v': 'ש',
        'w': 'ฬ',
        'x': 'א',
        'y': 'ץ',
        'z': 'չ',
        'A': 'ค',
        'B': '๒',
        'C': 'ς',
        'D': '๔',
        'E': 'є',
        'F': 'Ŧ',
        'G': 'ﻮ',
        'H': 'ђ',
        'I': 'เ',
        'J': 'ן',
        'K': 'к',
        'L': 'ɭ',
        'M': '๓',
        'N': 'ภ',
        'O': '๏',
        'P': 'ק',
        'Q': 'ợ',
        'R': 'г',
        'S': 'ร',
        'T': 'Շ',
        'U': 'ย',
        'V': 'ש',
        'W': 'ฬ',
        'X': 'א',
        'Y': 'ץ',
        'Z': 'չ'
    },
    doubleStruckCharMap = {
        0x0: '𝟘',
        0x1: '𝟙',
        0x2: '𝟚',
        0x3: '𝟛',
        0x4: '𝟜',
        0x5: '𝟝',
        0x6: '𝟞',
        0x7: '𝟟',
        0x8: '𝟠',
        0x9: '𝟡',
        'a': '𝕒',
        'b': '𝕓',
        'c': '𝕔',
        'd': '𝕕',
        'e': '𝕖',
        'f': '𝕗',
        'g': '𝕘',
        'h': '𝕙',
        'i': '𝕚',
        'j': '𝕛',
        'k': '𝕜',
        'l': '𝕝',
        'm': '𝕞',
        'n': '𝕟',
        'o': '𝕠',
        'p': '𝕡',
        'q': '𝕢',
        'r': '𝕣',
        's': '𝕤',
        't': '𝕥',
        'u': '𝕦',
        'v': '𝕧',
        'w': '𝕨',
        'x': '𝕩',
        'y': '𝕪',
        'z': '𝕫',
        'A': '𝔸',
        'B': '𝔹',
        'C': 'ℂ',
        'D': '𝔻',
        'E': '𝔼',
        'F': '𝔽',
        'G': '𝔾',
        'H': 'ℍ',
        'I': '𝕀',
        'J': '𝕁',
        'K': '𝕂',
        'L': '𝕃',
        'M': '𝕄',
        'N': 'ℕ',
        'O': '𝕆',
        'P': 'ℙ',
        'Q': 'ℚ',
        'R': 'ℝ',
        'S': '𝕊',
        'T': '𝕋',
        'U': '𝕌',
        'V': '𝕍',
        'W': '𝕎',
        'X': '𝕏',
        'Y': '𝕐',
        'Z': 'ℤ'
    },
    medievalCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝖆',
        'b': '𝖇',
        'c': '𝖈',
        'd': '𝖉',
        'e': '𝖊',
        'f': '𝖋',
        'g': '𝖌',
        'h': '𝖍',
        'i': '𝖎',
        'j': '𝖏',
        'k': '𝖐',
        'l': '𝖑',
        'm': '𝖒',
        'n': '𝖓',
        'o': '𝖔',
        'p': '𝖕',
        'q': '𝖖',
        'r': '𝖗',
        's': '𝖘',
        't': '𝖙',
        'u': '𝖚',
        'v': '𝖛',
        'w': '𝖜',
        'x': '𝖝',
        'y': '𝖞',
        'z': '𝖟',
        'A': '𝕬',
        'B': '𝕭',
        'C': '𝕮',
        'D': '𝕯',
        'E': '𝕰',
        'F': '𝕱',
        'G': '𝕲',
        'H': '𝕳',
        'I': '𝕴',
        'J': '𝕵',
        'K': '𝕶',
        'L': '𝕷',
        'M': '𝕸',
        'N': '𝕹',
        'O': '𝕺',
        'P': '𝕻',
        'Q': '𝕼',
        'R': '𝕽',
        'S': '𝕾',
        'T': '𝕿',
        'U': '𝖀',
        'V': '𝖁',
        'W': '𝖂',
        'X': '𝖃',
        'Y': '𝖄',
        'Z': '𝖅'
    },
    invertedSquaresCharMap = {
        'q': '🆀',
        'w': '🆆',
        'e': '🅴',
        'r': '🆁',
        't': '🆃',
        'y': '🆈',
        'u': '🆄',
        'i': '🅸',
        'o': '🅾',
        'p': '🅿',
        'a': '🅰',
        's': '🆂',
        'd': '🅳',
        'f': '🅵',
        'g': '🅶',
        'h': '🅷',
        'j': '🅹',
        'k': '🅺',
        'l': '🅻',
        'z': '🆉',
        'x': '🆇',
        'c': '🅲',
        'v': '🆅',
        'b': '🅱',
        'n': '🅽',
        'm': '🅼'
    },
    cursiveCharMap = {
        0x0: '0',
        0x1: '1',
        0x2: '2',
        0x3: '3',
        0x4: '4',
        0x5: '5',
        0x6: '6',
        0x7: '7',
        0x8: '8',
        0x9: '9',
        'a': '𝓪',
        'b': '𝓫',
        'c': '𝓬',
        'd': '𝓭',
        'e': '𝓮',
        'f': '𝓯',
        'g': '𝓰',
        'h': '𝓱',
        'i': '𝓲',
        'j': '𝓳',
        'k': '𝓴',
        'l': '𝓵',
        'm': '𝓶',
        'n': '𝓷',
        'o': '𝓸',
        'p': '𝓹',
        'q': '𝓺',
        'r': '𝓻',
        's': '𝓼',
        't': '𝓽',
        'u': '𝓾',
        'v': '𝓿',
        'w': '𝔀',
        'x': '𝔁',
        'y': '𝔂',
        'z': '𝔃',
        'A': '𝓐',
        'B': '𝓑',
        'C': '𝓒',
        'D': '𝓓',
        'E': '𝓔',
        'F': '𝓕',
        'G': '𝓖',
        'H': '𝓗',
        'I': '𝓘',
        'J': '𝓙',
        'K': '𝓚',
        'L': '𝓛',
        'M': '𝓜',
        'N': '𝓝',
        'O': '𝓞',
        'P': '𝓟',
        'Q': '𝓠',
        'R': '𝓡',
        'S': '𝓢',
        'T': '𝓣',
        'U': '𝓤',
        'V': '𝓥',
        'W': '𝓦',
        'X': '𝓧',
        'Y': '𝓨',
        'Z': '𝓩'
    },
    oldEnglishCharMap = {
        'a': '𝔞',
        'b': '𝔟',
        'c': '𝔠',
        'd': '𝔡',
        'e': '𝔢',
        'f': '𝔣',
        'g': '𝔤',
        'h': '𝔥',
        'i': '𝔦',
        'j': '𝔧',
        'k': '𝔨',
        'l': '𝔩',
        'm': '𝔪',
        'n': '𝔫',
        'o': '𝔬',
        'p': '𝔭',
        'q': '𝔮',
        'r': '𝔯',
        's': '𝔰',
        't': '𝔱',
        'u': '𝔲',
        'v': '𝔳',
        'w': '𝔴',
        'x': '𝔵',
        'y': '𝔶',
        'z': '𝔷',
        'A': '𝔄',
        'B': '𝔅',
        'C': 'ℭ',
        'D': '𝔇',
        'E': '𝔈',
        'F': '𝔉',
        'G': '𝔊',
        'H': 'ℌ',
        'I': 'ℑ',
        'J': '𝔍',
        'K': '𝔎',
        'L': '𝔏',
        'M': '𝔐',
        'N': '𝔑',
        'O': '𝔒',
        'P': '𝔓',
        'Q': '𝔔',
        'R': 'ℜ',
        'S': '𝔖',
        'T': '𝔗',
        'U': '𝔘',
        'V': '𝔙',
        'W': '𝔚',
        'X': '𝔛',
        'Y': '𝔜',
        'Z': 'ℨ'
    },
    wideTextCharMap = {
        '`': '`',
        0x1: '１',
        0x2: '２',
        0x3: '３',
        0x4: '４',
        0x5: '５',
        0x6: '６',
        0x7: '７',
        0x8: '８',
        0x9: '９',
        0x0: '０',
        '-': '－',
        '=': '＝',
        '~': '~',
        '!': '！',
        '@': '＠',
        '#': '＃',
        '$': '＄',
        '%': '％',
        '^': '^',
        '&': '＆',
        '*': '＊',
        '(': '（',
        ')': '）',
        '_': '_',
        '+': '＋',
        'q': 'ｑ',
        'w': 'ｗ',
        'e': 'ｅ',
        'r': 'ｒ',
        't': 'ｔ',
        'y': 'ｙ',
        'u': 'ｕ',
        'i': 'ｉ',
        'o': 'ｏ',
        'p': 'ｐ',
        '[': '[',
        ']': ']',
        '\x5c': '\x5c',
        'Q': 'Ｑ',
        'W': 'Ｗ',
        'E': 'Ｅ',
        'R': 'Ｒ',
        'T': 'Ｔ',
        'Y': 'Ｙ',
        'U': 'Ｕ',
        'I': 'Ｉ',
        'O': 'Ｏ',
        'P': 'Ｐ',
        '{': '{',
        '}': '}',
        '|': '|',
        'a': 'ａ',
        's': 'ｓ',
        'd': 'ｄ',
        'f': 'ｆ',
        'g': 'ｇ',
        'h': 'ｈ',
        'j': 'ｊ',
        'k': 'ｋ',
        'l': 'ｌ',
        ';': '；',
        '\x27': '＇',
        'A': 'Ａ',
        'S': 'Ｓ',
        'D': 'Ｄ',
        'F': 'Ｆ',
        'G': 'Ｇ',
        'H': 'Ｈ',
        'J': 'Ｊ',
        'K': 'Ｋ',
        'L': 'Ｌ',
        ':': '：',
        '\x22': '\x22',
        'z': 'ｚ',
        'x': 'ｘ',
        'c': 'ｃ',
        'v': 'ｖ',
        'b': 'ｂ',
        'n': 'ｎ',
        'm': 'ｍ',
        ',': '，',
        '.': '．',
        '/': '／',
        'Z': 'Ｚ',
        'X': 'Ｘ',
        'C': 'Ｃ',
        'V': 'Ｖ',
        'B': 'Ｂ',
        'N': 'Ｎ',
        'M': 'Ｍ',
        '<': '<',
        '>': '>',
        '?': '？'
    };

function Lunicode() {
    var _0x3e2e41 = _0x50051f;
    this['tools'] = {
        'flip': {
            'init': function() {
                var _0x4c3853 = _0x1fce;
                for (i in this[_0x4c3853(0x485)]) this[_0x4c3853(0x485)][this[_0x4c3853(0x485)][i]] = i;
            },
            'encode': function(_0x192279) {
                var _0x454a6d = _0x1fce;
                for (var _0x4ef59b, _0x1f413f = [], _0x439066 = 0x0, _0xfd3627 = _0x192279['length']; _0xfd3627 > _0x439066; _0x439066++) _0x4ef59b = _0x192279[_0x454a6d(0x3f4)](_0x439066), _0x439066 > 0x0 && ('̤' == _0x4ef59b || '̗' == _0x4ef59b || '̖' == _0x4ef59b || '̮' == _0x4ef59b) ? (_0x4ef59b = this['map'][_0x192279[_0x454a6d(0x3f4)](_0x439066 - 0x1) + _0x4ef59b], _0x1f413f['pop']()) : (_0x4ef59b = this['map'][_0x4ef59b], _0x454a6d(0x407) == typeof _0x4ef59b && (_0x4ef59b = _0x192279[_0x454a6d(0x3f4)](_0x439066))), _0x1f413f[_0x454a6d(0xd)](_0x4ef59b);
                return _0x1f413f[_0x454a6d(0xef)]()[_0x454a6d(0x4f7)]('');
            },
            'decode': function(_0xca2bd) {
                var _0x56caff = _0x1fce;
                for (var _0x3d3e72, _0xda7057 = [], _0x52d809 = 0x0, _0x3527c7 = _0xca2bd[_0x56caff(0x353)]; _0x3527c7 > _0x52d809; _0x52d809++) _0x3d3e72 = _0xca2bd[_0x56caff(0x3f4)](_0x52d809), _0x52d809 > 0x0 && ('̤' == _0x3d3e72 || '̗' == _0x3d3e72 || '̖' == _0x3d3e72 || '̮' == _0x3d3e72) ? (_0x3d3e72 = this[_0x56caff(0x485)][_0xca2bd['charAt'](_0x52d809 - 0x1) + _0x3d3e72], _0xda7057['pop']()) : (_0x3d3e72 = this[_0x56caff(0x485)][_0x3d3e72], 'undefined' == typeof _0x3d3e72 && (_0x3d3e72 = _0xca2bd[_0x56caff(0x3f4)](_0x52d809))), _0xda7057[_0x56caff(0xd)](_0x3d3e72);
                return _0xda7057[_0x56caff(0xef)]()[_0x56caff(0x4f7)]('');
            },
            'map': {
                'a': 'ɐ',
                'b': 'q',
                'c': 'ɔ',
                'd': 'p',
                'e': 'ǝ',
                'f': 'ɟ',
                'g': 'ɓ',
                'h': 'ɥ',
                'i': 'ı',
                'j': 'ɾ',
                'k': 'ʞ',
                'l': 'l',
                'm': 'ɯ',
                'n': 'u',
                'r': 'ɹ',
                't': 'ʇ',
                'v': 'ʌ',
                'w': 'ʍ',
                'y': 'ʎ',
                'A': '∀',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'Ⅎ',
                'G': '⅁',
                'J': 'ſ',
                'K': '⋊',
                'L': '˥',
                'M': 'W',
                'P': 'Ԁ',
                'Q': 'Ό',
                'R': 'ᴚ',
                'T': '⊥',
                'U': '∩',
                'V': 'Λ',
                'Y': '⅄',
                0x1: '⇂',
                0x2: 'ᄅ',
                0x3: 'Ɛ',
                0x4: 'ㄣ',
                0x5: 'ގ',
                0x6: '9',
                0x7: 'ㄥ',
                '&': '⅋',
                '.': '˙',
                '\x22': '„',
                ';': '؛',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '¿',
                '!': '¡',
                '\x27': ',',
                '<': '>',
                '‾': '_',
                '¯': '_',
                '‿': '⁀',
                '⁅': '⁆',
                '∴': '∵',
                '\x0d': '\x0a',
                'ß': 'ᙠ',
                '̈': '̤',
                'ä': 'ɐ̤',
                'ö': 'o̤',
                'ü': 'n̤',
                'Ä': '∀̤',
                'Ö': 'O̤',
                'Ü': '∩̤',
                '´': '\x20̗',
                'é': 'ǝ̗',
                'á': 'ɐ̗',
                'ó': 'o̗',
                'ú': 'n̗',
                'É': 'Ǝ̗',
                'Á': '∀̗',
                'Ó': 'O̗',
                'Ú': '∩̗',
                '`': '\x20̖',
                'è': 'ǝ̖',
                'à': 'ɐ̖',
                'ò': 'o̖',
                'ù': 'n̖',
                'È': 'Ǝ̖',
                'À': '∀̖',
                'Ò': 'O̖',
                'Ù': '∩̖',
                '^': '\x20̮',
                'ê': 'ǝ̮',
                'â': 'ɐ̮',
                'ô': 'o̮',
                'û': 'n̮',
                'Ê': 'Ǝ̮',
                'Â': '∀̮',
                'Ô': 'O̮',
                'Û': '∩̮'
            }
        },
        'mirror': {
            'init': function() {
                var _0x5c4993 = _0x1fce;
                for (i in this[_0x5c4993(0x485)]) this[_0x5c4993(0x485)][this['map'][i]] = i;
            },
            'encode': function(_0x417334) {
                var _0x367c19 = _0x1fce;
                for (var _0x5192cf, _0x74948d = [], _0xac791d = [], _0xd4b329 = 0x0, _0x578e5d = _0x417334['length']; _0x578e5d > _0xd4b329; _0xd4b329++) _0x5192cf = _0x417334[_0x367c19(0x3f4)](_0xd4b329), _0xd4b329 > 0x0 && ('̈' == _0x5192cf || '̀' == _0x5192cf || '́' == _0x5192cf || '̂' == _0x5192cf) ? (_0x5192cf = this[_0x367c19(0x485)][_0x417334[_0x367c19(0x3f4)](_0xd4b329 - 0x1) + _0x5192cf], _0x74948d[_0x367c19(0x3ac)]()) : (_0x5192cf = this[_0x367c19(0x485)][_0x5192cf], 'undefined' == typeof _0x5192cf && (_0x5192cf = _0x417334[_0x367c19(0x3f4)](_0xd4b329))), '\x0a' == _0x5192cf ? (_0xac791d[_0x367c19(0xd)](_0x74948d[_0x367c19(0xef)]()[_0x367c19(0x4f7)]('')), _0x74948d = []) : _0x74948d[_0x367c19(0xd)](_0x5192cf);
                return _0xac791d[_0x367c19(0xd)](_0x74948d[_0x367c19(0xef)]()[_0x367c19(0x4f7)]('')), _0xac791d[_0x367c19(0x4f7)]('\x0a');
            },
            'decode': function(_0x3313d4) {
                var _0x4b7095 = _0x1fce;
                for (var _0x553298, _0x1f2b2a = [], _0x3f839d = [], _0x53895d = 0x0, _0x46f366 = _0x3313d4[_0x4b7095(0x353)]; _0x46f366 > _0x53895d; _0x53895d++) _0x553298 = _0x3313d4[_0x4b7095(0x3f4)](_0x53895d), _0x53895d > 0x0 && ('̈' == _0x553298 || '̀' == _0x553298 || '́' == _0x553298 || '̂' == _0x553298) ? (_0x553298 = this[_0x4b7095(0x485)][_0x3313d4[_0x4b7095(0x3f4)](_0x53895d - 0x1) + _0x553298], _0x1f2b2a[_0x4b7095(0x3ac)]()) : (_0x553298 = this[_0x4b7095(0x485)][_0x553298], _0x4b7095(0x407) == typeof _0x553298 && (_0x553298 = _0x3313d4[_0x4b7095(0x3f4)](_0x53895d))), '\x0a' == _0x553298 ? (_0x3f839d[_0x4b7095(0xd)](_0x1f2b2a[_0x4b7095(0xef)]()[_0x4b7095(0x4f7)]('')), _0x1f2b2a = []) : _0x1f2b2a[_0x4b7095(0xd)](_0x553298);
                return _0x3f839d[_0x4b7095(0xd)](_0x1f2b2a[_0x4b7095(0xef)]()['join']('')), _0x3f839d[_0x4b7095(0x4f7)]('\x0a');
            },
            'map': {
                'a': 'ɒ',
                'b': 'd',
                'c': 'ɔ',
                'e': 'ɘ',
                'f': 'Ꮈ',
                'g': 'ǫ',
                'h': 'ʜ',
                'j': 'ꞁ',
                'k': 'ʞ',
                'l': '|',
                'n': 'ᴎ',
                'p': 'q',
                'r': 'ɿ',
                's': 'ꙅ',
                't': 'ƚ',
                'y': 'ʏ',
                'z': 'ƹ',
                'B': 'ᙠ',
                'C': 'Ɔ',
                'D': 'ᗡ',
                'E': 'Ǝ',
                'F': 'ꟻ',
                'G': 'Ꭾ',
                'J': 'Ⴑ',
                'K': '⋊',
                'L': '⅃',
                'N': 'Ͷ',
                'P': 'ꟼ',
                'Q': 'Ọ',
                'R': 'Я',
                'S': 'Ꙅ',
                'Z': 'Ƹ',
                0x1: '',
                0x2: '',
                0x3: '',
                0x4: '',
                0x5: '',
                0x6: '',
                0x7: '',
                '&': '',
                ';': '',
                '[': ']',
                '(': ')',
                '{': '}',
                '?': '⸮',
                '<': '>',
                'ä': 'ɒ̈',
                'ß': 'ᙠ',
                '´': '`',
                'é': 'ɘ̀',
                'á': 'ɒ̀',
                'ó': 'ò',
                'ú': 'ù',
                'É': 'Ǝ̀',
                'Á': 'À',
                'Ó': 'Ò',
                'Ú': 'Ù',
                '`': '´',
                'è': 'ɘ́',
                'à': 'ɒ́',
                'È': 'Ǝ́',
                'ê': 'ɘ̂',
                'â': 'ɒ̂',
                'Ê': 'Ǝ̂',
                'Ø': 'ᴓ',
                'ø': 'ᴓ'
            }
        },
        'creepify': {
            'init': function() {
                var _0x206de4 = _0x1fce;
                for (var _0x47be3a = 0x300; 0x315 >= _0x47be3a; _0x47be3a++) this['diacriticsTop'][_0x206de4(0xd)](String['fromCharCode'](_0x47be3a));
                for (var _0x47be3a = 0x316; 0x333 >= _0x47be3a; _0x47be3a++) 0x31a != _0x47be3a && 0x31b != _0x47be3a && this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](_0x47be3a));
                this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x31a)), this[_0x206de4(0x484)]['push'](String[_0x206de4(0x1be)](0x31b));
                for (var _0x47be3a = 0x334; 0x338 >= _0x47be3a; _0x47be3a++) this[_0x206de4(0x339)]['push'](String[_0x206de4(0x1be)](_0x47be3a));
                for (var _0x47be3a = 0x339; 0x33c >= _0x47be3a; _0x47be3a++) this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](_0x47be3a));
                for (var _0x47be3a = 0x33d; 0x344 >= _0x47be3a; _0x47be3a++) this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](_0x47be3a));
                this[_0x206de4(0x484)][_0x206de4(0xd)](String['fromCharCode'](0x344)), this['diacriticsBottom'][_0x206de4(0xd)](String['fromCharCode'](0x345)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x346)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x347)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x348)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x349)), this['diacriticsTop'][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x34a)), this[_0x206de4(0x484)][_0x206de4(0xd)](String['fromCharCode'](0x34b)), this[_0x206de4(0x484)][_0x206de4(0xd)](String['fromCharCode'](0x34c)), this[_0x206de4(0x10f)]['push'](String[_0x206de4(0x1be)](0x34d)), this[_0x206de4(0x10f)]['push'](String[_0x206de4(0x1be)](0x34e)), this['diacriticsTop']['push'](String[_0x206de4(0x1be)](0x350)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x351)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x352)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x353)), this[_0x206de4(0x10f)]['push'](String[_0x206de4(0x1be)](0x354)), this['diacriticsBottom'][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x355)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x356)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x357)), this['diacriticsTop']['push'](String[_0x206de4(0x1be)](0x358)), this[_0x206de4(0x10f)]['push'](String['fromCharCode'](0x359)), this['diacriticsBottom'][_0x206de4(0xd)](String['fromCharCode'](0x35a)), this[_0x206de4(0x484)]['push'](String['fromCharCode'](0x35b)), this[_0x206de4(0x10f)][_0x206de4(0xd)](String['fromCharCode'](0x35c)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x35d)), this[_0x206de4(0x484)][_0x206de4(0xd)](String['fromCharCode'](0x35d)), this[_0x206de4(0x10f)]['push'](String[_0x206de4(0x1be)](0x35f)), this[_0x206de4(0x484)][_0x206de4(0xd)](String[_0x206de4(0x1be)](0x360)), this[_0x206de4(0x484)]['push'](String['fromCharCode'](0x361));
            },
            'encode': function(_0x500bae) {
                var _0x3accfb = _0x1fce,
                    _0x48b84, _0x244373 = '';
                for (i in _0x500bae) {
                    if (_0x48b84 = _0x500bae[i], this[_0x3accfb(0x100)][_0x3accfb(0x275)] && (_0x48b84 += this['diacriticsMiddle'][Math[_0x3accfb(0x4c)](Math[_0x3accfb(0x58)]() * this[_0x3accfb(0x339)][_0x3accfb(0x353)])]), this[_0x3accfb(0x100)]['top']) {
                        for (var _0x1abe97 = this['diacriticsTop'][_0x3accfb(0x353)] - 0x1, _0x37ab0 = 0x0, _0x3bab1a = this[_0x3accfb(0x100)][_0x3accfb(0x311)] - Math[_0x3accfb(0x58)]() * (this['options']['randomization'] / 0x64 * this[_0x3accfb(0x100)][_0x3accfb(0x311)]); _0x3bab1a > _0x37ab0; _0x37ab0++) _0x48b84 += this['diacriticsTop'][Math[_0x3accfb(0x4c)](Math['random']() * _0x1abe97)];
                    }
                    if (this[_0x3accfb(0x100)][_0x3accfb(0x3a8)]) {
                        for (var _0x347d10 = this[_0x3accfb(0x10f)][_0x3accfb(0x353)] - 0x1, _0x37ab0 = 0x0, _0x3bab1a = this['options'][_0x3accfb(0x311)] - Math[_0x3accfb(0x58)]() * (this[_0x3accfb(0x100)][_0x3accfb(0x5e)] / 0x64 * this[_0x3accfb(0x100)]['maxHeight']); _0x3bab1a > _0x37ab0; _0x37ab0++) _0x48b84 += this[_0x3accfb(0x10f)][Math[_0x3accfb(0x4c)](Math[_0x3accfb(0x58)]() * _0x347d10)];
                    }
                    _0x244373 += _0x48b84;
                }
                return _0x244373;
            },
            'decode': function(_0x2f5e8e) {
                var _0x27af17 = _0x1fce,
                    _0x439f74, _0x527b6f = '';
                for (i in _0x2f5e8e) _0x439f74 = _0x2f5e8e[i][_0x27af17(0xc9)](0x0), (0x300 > _0x439f74 || _0x439f74 > 0x361) && (_0x527b6f += _0x2f5e8e[i]);
                return _0x527b6f;
            },
            'diacriticsTop': [],
            'diacriticsMiddle': [],
            'diacriticsBottom': [],
            'options': {
                'top': !0x0,
                'middle': !0x0,
                'bottom': !0x0,
                'maxHeight': 0xf,
                'randomization': 0x64
            }
        },
        'bubbles': {
            'init': function() {
                var _0x2fc36e = _0x1fce;
                for (var _0x42ff31 = 0x31; 0x39 >= _0x42ff31; _0x42ff31++) this[_0x2fc36e(0x485)][String[_0x2fc36e(0x1be)](_0x42ff31)] = String['fromCharCode'](_0x42ff31 + 0x242f);
                this[_0x2fc36e(0x485)][0x0] = '⓪';
                for (var _0x42ff31 = 0x41; 0x5a >= _0x42ff31; _0x42ff31++) this[_0x2fc36e(0x485)][String[_0x2fc36e(0x1be)](_0x42ff31)] = String[_0x2fc36e(0x1be)](_0x42ff31 + 0x2475);
                for (var _0x42ff31 = 0x61; 0x7a >= _0x42ff31; _0x42ff31++) this[_0x2fc36e(0x485)][String['fromCharCode'](_0x42ff31)] = String['fromCharCode'](_0x42ff31 + 0x246f);
                for (_0x42ff31 in this[_0x2fc36e(0x485)]) this[_0x2fc36e(0x383)][this['map'][_0x42ff31]] = _0x42ff31;
            },
            'encode': function(_0x50423c) {
                var _0x33502f = _0x1fce,
                    _0x38dcd0, _0x178683 = '',
                    _0x4e6a59 = !0x0;
                for (i in _0x50423c) _0x38dcd0 = this[_0x33502f(0x485)][_0x50423c[i]], _0x33502f(0x407) == typeof _0x38dcd0 && (_0x50423c[i][_0x33502f(0xc9)](0x0) >= 0x21 ? (_0x38dcd0 = _0x50423c[i] + String[_0x33502f(0x1be)](0x20dd), _0x4e6a59 || (_0x38dcd0 = String[_0x33502f(0x1be)](0x202f) + String[_0x33502f(0x1be)](0xa0) + String['fromCharCode'](0xa0) + String[_0x33502f(0x1be)](0x202f) + _0x38dcd0)) : _0x38dcd0 = _0x50423c[i]), _0x178683 += _0x38dcd0, _0x4e6a59 = '\x0a' == _0x38dcd0;
                return _0x178683;
            },
            'decode': function(_0x29b34c) {
                var _0x232a39 = _0x1fce,
                    _0x26e970, _0xadc8ef = '',
                    _0x340cea = '';
                for (i in _0x29b34c) _0x26e970 = this['mapInverse'][_0x29b34c[i]], _0xadc8ef += _0x232a39(0x407) == typeof _0x26e970 ? _0x29b34c[i] : _0x26e970;
                for (i in _0xadc8ef) _0x26e970 = _0xadc8ef[i]['charCodeAt'](0x0), 0xa0 != _0x26e970 && 0x202f != _0x26e970 && 0x20dd != _0x26e970 && (_0x340cea += _0xadc8ef[i]);
                return _0x340cea;
            },
            'map': {},
            'mapInverse': {}
        },
        'squares': {
            'init': function() {},
            'encode': function(_0x524474) {
                var _0x61a678 = _0x1fce,
                    _0x278984, _0x2e6a4a = '',
                    _0x221138 = !0x0;
                for (i in _0x524474) _0x524474[i][_0x61a678(0xc9)](0x0) >= 0x21 ? (_0x278984 = _0x524474[i] + String[_0x61a678(0x1be)](0x20de), _0x221138 || (_0x278984 = String[_0x61a678(0x1be)](0x202f) + String[_0x61a678(0x1be)](0xa0) + String[_0x61a678(0x1be)](0xa0) + String[_0x61a678(0x1be)](0x202f) + _0x278984)) : _0x278984 = _0x524474[i], _0x2e6a4a += _0x278984, _0x221138 = '\x0a' == _0x278984;
                return _0x2e6a4a;
            },
            'decode': function(_0x488616) {
                var _0x145184 = _0x1fce,
                    _0x20f01a, _0x1469a0 = '';
                for (i in _0x488616) _0x20f01a = _0x488616[i][_0x145184(0xc9)](0x0), 0xa0 != _0x20f01a && 0x202f != _0x20f01a && 0x20de != _0x20f01a && (_0x1469a0 += _0x488616[i]);
                return _0x1469a0;
            }
        },
        'roundsquares': {
            'init': function() {},
            'encode': function(_0x31b69d) {
                var _0x15cb70 = _0x1fce,
                    _0x31d5b0, _0x49c118 = '',
                    _0x1c375b = !0x0;
                for (i in _0x31b69d) _0x31b69d[i][_0x15cb70(0xc9)](0x0) >= 0x21 ? (_0x31d5b0 = _0x31b69d[i] + String[_0x15cb70(0x1be)](0x20e3), _0x1c375b || (_0x31d5b0 = String[_0x15cb70(0x1be)](0xa0) + String['fromCharCode'](0xa0) + String['fromCharCode'](0xa0) + _0x31d5b0)) : _0x31d5b0 = _0x31b69d[i], _0x49c118 += _0x31d5b0, _0x1c375b = '\x0a' == _0x31d5b0;
                return _0x49c118;
            },
            'decode': function(_0x450b5d) {
                var _0x5897b5, _0x2a90c1 = '';
                for (i in _0x450b5d) _0x5897b5 = _0x450b5d[i]['charCodeAt'](0x0), 0xa0 != _0x5897b5 && 0x202f != _0x5897b5 && 0x20e3 != _0x5897b5 && (_0x2a90c1 += _0x450b5d[i]);
                return _0x2a90c1;
            }
        },
        'bent': {
            'init': function() {
                var _0x4fc37b = _0x1fce;
                for (i in this[_0x4fc37b(0x485)]) this[_0x4fc37b(0x485)][this['map'][i]] = i;
            },
            'encode': function(_0x52ab37) {
                var _0x3c0e4d = _0x1fce;
                for (var _0x17ac58, _0x59e093 = '', _0x42a223 = 0x0, _0x1cab78 = _0x52ab37[_0x3c0e4d(0x353)]; _0x1cab78 > _0x42a223; _0x42a223++) _0x17ac58 = this[_0x3c0e4d(0x485)][_0x52ab37[_0x3c0e4d(0x3f4)](_0x42a223)], _0x3c0e4d(0x407) == typeof _0x17ac58 && (_0x17ac58 = _0x52ab37[_0x3c0e4d(0x3f4)](_0x42a223)), _0x59e093 += _0x17ac58;
                return _0x59e093;
            },
            'decode': function(_0x1be320) {
                var _0x59416d = _0x1fce;
                for (var _0x4c760b, _0x5e12dc = '', _0x5f30c5 = 0x0, _0x145831 = _0x1be320['length']; _0x145831 > _0x5f30c5; _0x5f30c5++) _0x4c760b = this[_0x59416d(0x485)][_0x1be320[_0x59416d(0x3f4)](_0x5f30c5)], _0x59416d(0x407) == typeof _0x4c760b && (_0x4c760b = _0x1be320[_0x59416d(0x3f4)](_0x5f30c5)), _0x5e12dc += _0x4c760b;
                return _0x5e12dc;
            },
            'map': {
                'a': 'ą',
                'b': 'ҍ',
                'c': 'ç',
                'd': 'ժ',
                'e': 'ҽ',
                'f': 'ƒ',
                'g': 'ց',
                'h': 'հ',
                'i': 'ì',
                'j': 'ʝ',
                'k': 'ҟ',
                'l': 'Ӏ',
                'm': 'ʍ',
                'n': 'ղ',
                'o': 'օ',
                'p': 'ք',
                'q': 'զ',
                'r': 'ɾ',
                's': 'ʂ',
                't': 'է',
                'u': 'մ',
                'v': 'ѵ',
                'w': 'ա',
                'x': '×',
                'y': 'վ',
                'z': 'Հ',
                'A': 'Ⱥ',
                'B': 'β',
                'C': '↻',
                'D': 'Ꭰ',
                'E': 'Ɛ',
                'F': 'Ƒ',
                'G': 'Ɠ',
                'H': 'Ƕ',
                'I': 'į',
                'J': 'ل',
                'K': 'Ҡ',
                'L': 'Ꝉ',
                'M': 'Ɱ',
                'N': 'ហ',
                'O': 'ට',
                'P': 'φ',
                'Q': 'Ҩ',
                'R': 'འ',
                'S': 'Ϛ',
                'T': 'Ͳ',
                'U': 'Ա',
                'V': 'Ỽ',
                'W': 'చ',
                'X': 'ჯ',
                'Y': 'Ӌ',
                'Z': 'ɀ',
                0x0: '⊘',
                0x1: _0x3e2e41(0x132),
                0x2: 'ϩ',
                0x3: 'Ӡ',
                0x4: '५',
                0x5: 'Ƽ',
                0x6: 'Ϭ',
                0x7: '7',
                0x8: '������',
                0x9: '९',
                '&': '⅋',
                '(': '{',
                ')': '}',
                '{': '(',
                '}': ')',
                'ä': 'ą̈',
                'ö': 'օ̈',
                'ü': 'մ̈',
                'Ä': 'Ⱥ̈',
                'Ö': 'ට̈',
                'Ü': 'Ա̈',
                'é': 'ҽ́',
                'á': 'ą́',
                'ó': 'օ́',
                'ú': 'մ́',
                'É': 'Ɛ́',
                'Á': 'Ⱥ́',
                'Ó': 'ට́',
                'Ú': 'Ա́',
                'è': 'ҽ̀',
                'à': 'ą̀',
                'ò': 'օ̀',
                'ù': 'մ̀',
                'È': 'Ɛ̀',
                'À': 'Ⱥ̀',
                'Ò': 'ට̀',
                'Ù': 'Ա̀',
                'ê': 'ҽ̂',
                'â': 'ą̂',
                'ô': 'օ̂',
                'û': 'մ̂',
                'Ê': 'Ɛ̂',
                'Â': 'Ⱥ̂',
                'Ô': 'ට̂',
                'Û': 'Ա̂'
            }
        },
        'tiny': {
            'init': function() {
                var _0x199b3b = _0x3e2e41;
                for (i in this['map']) this[_0x199b3b(0x485)][this[_0x199b3b(0x485)][i]] = i;
            },
            'encode': function(_0x19af17) {
                var _0x2a880a = _0x3e2e41,
                    _0x6f9b76, _0xc6955a = '';
                _0x19af17 = _0x19af17[_0x2a880a(0x319)]();
                for (var _0x3f298e = 0x0, _0x2e95a2 = _0x19af17[_0x2a880a(0x353)]; _0x2e95a2 > _0x3f298e; _0x3f298e++) _0x6f9b76 = this[_0x2a880a(0x485)][_0x19af17['charAt'](_0x3f298e)], 'undefined' == typeof _0x6f9b76 && (_0x6f9b76 = _0x19af17[_0x2a880a(0x3f4)](_0x3f298e)), _0xc6955a += _0x6f9b76;
                return _0xc6955a;
            },
            'decode': function(_0x569874) {
                var _0xdfb352 = _0x3e2e41;
                for (var _0x167a3d, _0x117276 = '', _0x370f1e = 0x0, _0x4ac9ed = _0x569874[_0xdfb352(0x353)]; _0x4ac9ed > _0x370f1e; _0x370f1e++) _0x167a3d = this[_0xdfb352(0x485)][_0x569874[_0xdfb352(0x3f4)](_0x370f1e)], _0xdfb352(0x407) == typeof _0x167a3d && (_0x167a3d = _0x569874[_0xdfb352(0x3f4)](_0x370f1e)), _0x117276 += _0x167a3d;
                return _0x117276;
            },
            'map': {
                'A': 'ᴀ',
                'B': 'ʙ',
                'C': 'ᴄ',
                'D': 'ᴅ',
                'E': 'ᴇ',
                'F': 'ꜰ',
                'G': 'ɢ',
                'H': 'ʜ',
                'I': 'ɪ',
                'J': 'ᴊ',
                'K': 'ᴋ',
                'L': 'ʟ',
                'M': 'ᴍ',
                'N': 'ɴ',
                'O': 'ᴏ',
                'P': 'ᴘ',
                'Q': 'Q',
                'R': 'ʀ',
                'S': 'ꜱ',
                'T': 'ᴛ',
                'U': 'ᴜ',
                'V': 'ᴠ',
                'W': 'ᴡ',
                'X': 'x',
                'Y': 'ʏ',
                'Z': 'ᴢ'
            }
        }
    };
    for (i in this['tools']) this[_0x3e2e41(0x2d8)][i][_0x3e2e41(0x201)]();
    this[_0x3e2e41(0x14e)] = function(_0x354366) {
        var _0x26390e = _0x3e2e41;
        for (var _0x122495, _0x4c33ec = '', _0x2c4df0 = !0x0, _0x13c3bb = 0x0, _0x35e548 = 0x0, _0x11f46c = 0x0, _0xd85301 = _0x354366['length']; _0xd85301 > _0x11f46c; _0x11f46c++) _0x122495 = _0x354366[_0x26390e(0xc9)](_0x11f46c), 0xa == _0x122495 || 0xd == _0x122495 ? (_0x4c33ec += _0x26390e(0x4c1), _0x2c4df0 = !0x0) : 0x20 == _0x122495 ? _0x2c4df0 ? (_0x4c33ec += '\x20', _0x2c4df0 = !0x1) : (_0x4c33ec += '\x20', _0x2c4df0 = !0x0) : (_0x122495 >= 0xd800 && 0xdbff >= _0x122495 ? (_0x13c3bb = _0x122495, _0x35e548 = 0x0) : _0x13c3bb > 0x0 ? (_0x122495 >= 0xdc00 && 0xdfff >= _0x122495 && (_0x35e548 = 0x400 * (_0x13c3bb - 0xd800) + (_0x122495 - 0xdc00) + 0x10000), _0x13c3bb = 0x0) : _0x35e548 = _0x122495, 0x0 != _0x35e548 && (_0x4c33ec += _0x26390e(0x30a) + _0x35e548['toString'](0x10) + ';', _0x2c4df0 = !0x0));
        return _0x4c33ec;
    };
}

function cuteText(_0x4f7903) {
    var _0x58e467 = _0x50051f;
    if (_0x4f7903[_0x58e467(0x8d)]() === '') return '';
    qi = -0x1;
    var _0x515d50 = boundingString(Math[_0x58e467(0x4c)](Math[_0x58e467(0x58)]() * 0x2) + 0x1);
    return _0x515d50 + _0x58e467(0x536) + _0x4f7903[_0x58e467(0x29c)](/([!?.]+)/gi)['map'](cuteSentence)['join']('') + _0x58e467(0x536) + esrever[_0x58e467(0xef)](_0x515d50);
}

function cuteSentence(_0x4ad899) {
    var _0x835a54 = _0x50051f;
    return _0x4ad899[_0x835a54(0x29c)](/([\s,]+)/gi)[_0x835a54(0x485)](cuteWord)[_0x835a54(0x4f7)]('');
}

function cuteWord(_0x479496) {
    var _0x3b5835 = _0x50051f;
    if (_0x479496 === '' || /[[!?.\s,]+]/gi [_0x3b5835(0x35d)](_0x479496)) return _0x479496;
    return _0x479496 = roundReplace(_0x479496), _0x479496 = punctReplace(_0x479496), _0x479496 = emojiReplace(_0x479496), scriptify(_0x479496);
}
var qi = -0x1,
    qa = ['❝', '❞'];

function quotes() {
    qi++;
    if (qi === 0x2) qi = 0x0;
    return qa[qi];
}

function punctReplace(_0x973ab) {
    var _0x44c234 = _0x50051f;
    return _0x973ab[_0x44c234(0x29c)]('')[_0x44c234(0x485)](function(_0x34555f) {
        if (_0x34555f === '!') return randomElement(['❣', '❢']);
        else {
            if (_0x34555f === '?') return randomElement(['¿', '?']);
            else {
                if (_0x34555f === '\x22') return quotes();
                else return _0x34555f;
            }
        }
    })['join']('');
}

function emojiReplace(_0x578240) {
    var _0x234cdc = _0x50051f;
    return _0x578240[_0x234cdc(0x241)](':)', randomElement(emoji[':)']))[_0x234cdc(0x241)]('(:', randomElement(emoji[':)']))[_0x234cdc(0x241)]('^^', randomElement(emoji['^^']))[_0x234cdc(0x241)](':P', randomElement(emoji[':p']))[_0x234cdc(0x241)](':p', randomElement(emoji[':p']))[_0x234cdc(0x241)](':D', randomElement(emoji[':D']))[_0x234cdc(0x241)]('<3', randomElement(emoji['<3']))[_0x234cdc(0x241)]('(y)', randomElement(emoji[_0x234cdc(0x306)]))['replace'](_0x234cdc(0x3be), randomElement(emoji[_0x234cdc(0x306)]));
}

function roundReplace(_0x118db1) {
    var _0x286263 = _0x50051f;
    return _0x118db1['split']('')[_0x286263(0x485)](function(_0x226833) {
        var _0x274639 = _0x286263;
        return _0x226833[_0x274639(0x22c)]() === 'o' || _0x226833 === '0' ? randomElement(round) : _0x226833;
    })[_0x286263(0x4f7)]('');
}
var emoji = {
        ':)': [_0x50051f(0x3ec), '(•◡•)', '(ɔ◔‿◔)ɔ', _0x50051f(0x39b), _0x50051f(0x114), '●‿●', '◕‿◕', '😍', 'ツ', '(✿ヘᴥヘ)', _0x50051f(0x1d3), '(づ｡◕‿‿◕｡)づ', _0x50051f(0x2c2), _0x50051f(0x31d), _0x50051f(0x3d), _0x50051f(0x4), _0x50051f(0x180)],
        '^^': [_0x50051f(0x291), _0x50051f(0x2a1), _0x50051f(0x285), _0x50051f(0x2a8), '(≧◡≦)', _0x50051f(0x329), '^ㅂ^', _0x50051f(0x14f), _0x50051f(0x1e), '⁀‿⁀', ''],
        ':p': [':Þ', ''],
        ':D': [_0x50051f(0x341), _0x50051f(0x44b), _0x50051f(0x2fa)],
        '<3': ['♡', '❤', '♥', '❥', '💘', '💙', '💗', '💖', '💕', '💓', '💞', '💝', '💟'],
        '(y)': ['👍', '👌']
    },
    round = ['❁', '🌺', '❀', '💮', '🏵', '🌸', '☯', '😍', '♡', '🍩', '🍬', '💙', '🌞', '💍', '🍪', '❤', '💗', '🍑', '💞'],
    food = ['🍬', '🍭', '🍒', '🍎', '🍉', '🍇', '🍓', '🍌', '🍑', '🍰', '🎂', '🍩', '🍪', '🍧', '🍦', '🍫', '🍡'],
    flowers = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    twinkles = ['⚛', '🌌', '🌠', '*', ':', '｡', '･ﾟ', '✧', '✮', '★', '✩', '⋆', '.', '°', '`', '✴', '｡', '✴', '⋆', '✳', '✶', '✷', '❈'],
    animals = ['🐯', '🐎', '🐖', '🐷', '🐏', '🐑', '🐐', '🐫', '🐘', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🐻', '🐨', '🐼', '🐾', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🐧', '🕊', '🐸', '🐢', '🐳', '🐋', '🐬', '🐟', '🐠', '🐡', '🐙', '🐚', '🐌', '🐞'],
    plants = ['✿', '⚘', '❦', '❧', '✾', '❁', '❀', '💐', '🌸', '💮', '🏵', '🌹', '🌺', '🌻', '🌷', '☘', '🌱', '🌲', '🌳', '🌴', '🌿', '🍂'],
    misc = ['🌌', '🌠', '🎉', '🎊', '🎈', '💌', '🎎', '🎁', '🎀', '🕯', '🔮', '🛀', '🎖', '🏆', '🏅', '👑', '💍', '👶', '👼', '👸', '👯', '👒', '👻'],
    music = ['♫', '♬', '♪', '♩', '°', '｡', '✧', '🎻', '🎺', '🎸', '🎷', '📯'],
    flourish = [_0x50051f(0x273), _0x50051f(0x4af), _0x50051f(0x28e), _0x50051f(0x458), _0x50051f(0x67), _0x50051f(0x4d), '•]••´º´•»\x20', _0x50051f(0x39e), _0x50051f(0x4a4), '•°¯`••\x20', _0x50051f(0x19a), _0x50051f(0x293), _0x50051f(0x381), _0x50051f(0x3a2), _0x50051f(0xb4), _0x50051f(0x394), _0x50051f(0x53), _0x50051f(0x73), '•´¯`•»\x20', '`•.,¸¸,.•´¯\x20', '¸,ø¤º°`°º¤ø,¸\x20', _0x50051f(0x4ba), _0x50051f(0x416), '`•.¸¸.•´´¯`••._.•\x20', '—(••÷', '¤¸¸.•´¯`•¸¸.•..>>\x20', _0x50051f(0x39f), _0x50051f(0x300), _0x50051f(0x50), '-漫~*\x27¨¯¨\x27*·舞~\x20', _0x50051f(0x3fa), _0x50051f(0x235), _0x50051f(0xd9), _0x50051f(0x3e2)];

function boundingString(_0x297f9f) {
    return randomElement([foodString, twinkleString, animalString, flourishString])(_0x297f9f);
}

function foodString(_0x2da564) {
    var _0x5acfee = _0x50051f;
    return new Array(_0x2da564 + 0x1)[_0x5acfee(0x4f7)]('0')['split']('')[_0x5acfee(0x485)](function(_0x476767) {
        return randomElement(food);
    })[_0x5acfee(0x4f7)](_0x5acfee(0x9));
}

function twinkleString(_0x371e54) {
    var _0x3ee821 = _0x50051f;
    return new Array(_0x371e54 + 0x1)[_0x3ee821(0x4f7)]('0')['split']('')[_0x3ee821(0x485)](function() {
        return randomElement(twinkles);
    })['join']('');
}

function animalString(_0x19a22e) {
    var _0x478b92 = _0x50051f;
    return new Array(_0x19a22e + 0x1)['join']('0')[_0x478b92(0x29c)]('')[_0x478b92(0x485)](function(_0x1b645a) {
        return randomElement(animals);
    })[_0x478b92(0x4f7)](_0x478b92(0x9));
}

function flourishString(_0x3529e2) {
    return randomElement(flourish);
}

function scriptify(_0xa7444) {
    var _0x10c636 = _0x50051f,
        _0x1bdbfd = {
            0x0: '𝟢',
            0x1: '𝟣',
            0x2: '𝟤',
            0x3: '𝟥',
            0x4: '𝟦',
            0x5: '𝟧',
            0x6: '𝟨',
            0x7: '𝟩',
            0x8: '𝟪',
            0x9: '𝟫',
            'a': '𝒶',
            'b': '𝒷',
            'c': '𝒸',
            'd': '𝒹',
            'e': '𝑒',
            'f': '𝒻',
            'g': '𝑔',
            'h': '𝒽',
            'i': '𝒾',
            'j': '𝒿',
            'k': '𝓀',
            'l': '𝓁',
            'm': '𝓂',
            'n': '𝓃',
            'o': '𝑜',
            'p': '𝓅',
            'q': '𝓆',
            'r': '𝓇',
            's': '𝓈',
            't': '𝓉',
            'u': '𝓊',
            'v': '𝓋',
            'w': '𝓌',
            'x': '𝓍',
            'y': '𝓎',
            'z': '𝓏',
            'A': '𝒜',
            'B': '𝐵',
            'C': '𝒞',
            'D': '𝒟',
            'E': '𝐸',
            'F': '𝐹',
            'G': '𝒢',
            'H': '𝐻',
            'I': '𝐼',
            'J': '𝒥',
            'K': '𝒦',
            'L': '𝐿',
            'M': '𝑀',
            'N': '𝒩',
            'O': '𝒪',
            'P': '𝒫',
            'Q': '𝒬',
            'R': '𝑅',
            'S': '𝒮',
            'T': '𝒯',
            'U': '𝒰',
            'V': '𝒱',
            'W': '𝒲',
            'X': '𝒳',
            'Y': '𝒴',
            'Z': '𝒵'
        },
        _0x7203ea = _0xa7444[_0x10c636(0x29c)]('');
    for (var _0xf56a37 = 0x0; _0xf56a37 < _0x7203ea[_0x10c636(0x353)]; _0xf56a37++) {
        _0x1bdbfd[_0x7203ea[_0xf56a37][_0x10c636(0x22c)]()] && (_0x7203ea[_0xf56a37] = _0x1bdbfd[_0x7203ea[_0xf56a37]]);
    }
    return _0xa7444 = _0x7203ea['join'](''), _0xa7444;
}

function shuffleArray(_0x1adb0c) {
    var _0x1b63b3 = _0x50051f,
        _0x27a328 = _0x1adb0c[_0x1b63b3(0x353)],
        _0x34bf89, _0x5b73b1;
    while (0x0 !== _0x27a328) {
        _0x5b73b1 = Math[_0x1b63b3(0x4c)](Math[_0x1b63b3(0x58)]() * _0x27a328), _0x27a328 -= 0x1, _0x34bf89 = _0x1adb0c[_0x27a328], _0x1adb0c[_0x27a328] = _0x1adb0c[_0x5b73b1], _0x1adb0c[_0x5b73b1] = _0x34bf89;
    }
    return _0x1adb0c;
}

function randomElement(_0x43e0e4) {
    var _0x3a64e8 = _0x50051f;
    return _0x43e0e4[Math[_0x3a64e8(0x4c)](Math[_0x3a64e8(0x58)]() * _0x43e0e4[_0x3a64e8(0x353)])];
}! function(_0x5663c2) {
    var _0x526b0a = _0x50051f,
        _0xf6a589 = _0x526b0a(0x4cd) == typeof exports && exports,
        _0x511ada = 'object' == typeof module && module && module[_0x526b0a(0x45c)] == _0xf6a589 && module,
        _0x3d997a = _0x526b0a(0x4cd) == typeof global && global;
    (_0x3d997a[_0x526b0a(0x350)] === _0x3d997a || _0x3d997a[_0x526b0a(0x2a5)] === _0x3d997a) && (_0x5663c2 = _0x3d997a);
    var _0x126830 = /(<%= allExceptCombiningMarks %>)(<%= combiningMarks %>+)/g,
        _0x26d380 = /([\uD800-\uDBFF])([\uDC00-\uDFFF])/g,
        _0x2cbf30 = function(_0x48d75a) {
            var _0x34f499 = _0x526b0a;
            _0x48d75a = _0x48d75a['replace'](_0x126830, function(_0x5290ae, _0x49c743, _0x437140) {
                return _0x2cbf30(_0x437140) + _0x49c743;
            })['replace'](_0x26d380, _0x34f499(0x327));
            for (var _0x1eadc1 = '', _0x154ece = _0x48d75a[_0x34f499(0x353)]; _0x154ece--;) _0x1eadc1 += _0x48d75a[_0x34f499(0x3f4)](_0x154ece);
            return _0x1eadc1;
        },
        _0x501daf = {
            'version': _0x526b0a(0x4d9),
            'reverse': _0x2cbf30
        };
    if (_0x526b0a(0x32b) == typeof define && _0x526b0a(0x4cd) == typeof define[_0x526b0a(0x1b1)] && define[_0x526b0a(0x1b1)]) define(function() {
        return _0x501daf;
    });
    else {
        if (_0xf6a589 && !_0xf6a589[_0x526b0a(0x24d)]) {
            if (_0x511ada) _0x511ada['exports'] = _0x501daf;
            else {
                for (var _0x3779fa in _0x501daf) _0x501daf[_0x526b0a(0x4eb)](_0x3779fa) && (_0xf6a589[_0x3779fa] = _0x501daf[_0x3779fa]);
            }
        } else _0x5663c2[_0x526b0a(0xaa)] = _0x501daf;
    }
}(this);

function fullCrazy(_0x25cc11) {
    var _0x1df9e2 = _0x50051f;
    if (_0x25cc11[_0x1df9e2(0x8d)]() === '') return '';
    return randomSymbols(0x2) + '\x20\x20' + crazifyText(_0x25cc11) + '\x20\x20' + randomSymbols(0x2);
}

function crazifyText(_0x4f8853) {
    var _0x13aa7e = _0x50051f;
    _0x4f8853 = _0x4f8853[_0x13aa7e(0x29c)]('');
    for (var _0x2086d2 = 0x0; _0x2086d2 < _0x4f8853['length']; _0x2086d2++) {
        _0x4f8853[_0x2086d2] = crazifyCharacter(_0x4f8853[_0x2086d2]);
    }
    return _0x4f8853['join']('');
}

function crazifyCharacter(_0x5982a6) {
    var _0x5923b1 = _0x50051f;
    _0x5982a6 = _0x5982a6['toLowerCase']();
    var _0x25c6f1 = {
        '&': '⅋',
        '%': ['⅍', '℀', '℁', '℆', '℅'],
        0x0: ['０', 'Ѳ', 'ʘ'],
        0x1: ['➀', '❶', '１'],
        0x2: ['２', '❷', '➁'],
        0x3: ['３', '❸', '➂'],
        0x4: ['４', '❹', '➃'],
        0x5: ['❺', '➄', '５'],
        0x6: ['６', '❻', '➅'],
        0x7: ['７', '❼', '➆'],
        0x8: ['８', '➇', '❽'],
        0x9: ['➈', '❾', '９'],
        '<': ['≼', '≺', '≪', '☾', '≾', '⋜', '⋞', '⋐', '⊂', '⊏', '⊑', '《', '＜', '❮', '❰', '⫷'],
        '>': _0x5923b1(0x26a),
        '[': _0x5923b1(0x297),
        ']': _0x5923b1(0xdb),
        '*': _0x5923b1(0x446),
        'a': ['Ⓐ', 'ⓐ', 'α', 'Ａ', 'ａ', 'ᗩ', '卂', 'Δ', 'ค', 'α', 'ά', 'Ã', '𝔞', '𝓪', '𝒶', '𝓐', '𝐀', '𝐚', '𝔸', '𝕒', 'ᵃ'],
        'b': ['Ⓑ', 'ⓑ', 'в', 'Ｂ', '乃', 'ｂ', 'ᗷ', 'β', '๒', 'в', 'в', 'β', '𝔟', '𝓫', '𝒷', '𝓑', '𝐁', '𝐛', '𝔹', '𝕓', 'ᵇ'],
        'c': ['Ⓒ', 'ⓒ', '匚', '¢', 'Ｃ', 'ｃ', 'ᑕ', 'Ć', 'ς', 'c', 'ς', 'Č', '℃', '𝔠', '𝓬', '𝒸', '𝓒', '𝐂', '𝐜', 'ℂ', '𝕔', 'ᶜ'],
        'd': ['Ⓓ', 'ⓓ', '∂', 'Ｄ', 'ｄ', 'ᗪ', 'Đ', '๔', '∂', 'đ', 'Ď', '𝔡', '𝓭', '𝒹', '𝓓', '𝐃', 'ᗪ', '𝐝', '𝔻', '𝕕', 'ᵈ'],
        'e': ['Ⓔ', '乇', 'ⓔ', 'є', 'Ｅ', 'ｅ', 'ᗴ', '€', 'є', 'ε', 'έ', 'Ẹ', '𝔢', '𝒆', '𝑒', '𝓔', '𝐄', '𝐞', '𝔼', '𝕖', 'ᵉ'],
        'f': ['Ⓕ', 'ⓕ', 'ƒ', 'Ｆ', 'ｆ', '千', 'ᖴ', 'ℱ', 'Ŧ', 'ғ', 'ғ', 'Ƒ', '𝔣', '𝒇', '𝒻', '𝓕', '𝐅', '𝐟', '𝔽', '𝕗', 'ᶠ'],
        'g': ['Ⓖ', 'ⓖ', 'ق', 'g', 'Ｇ', 'ｇ', 'Ǥ', 'Ꮆ', 'ﻮ', 'g', 'ģ', 'Ğ', '𝔤', '𝓰', '𝑔', '𝓖', '𝐆', '𝐠', '𝔾', '𝕘', 'ᵍ', 'Ꮆ'],
        'h': ['Ⓗ', '卄', 'ⓗ', 'н', 'Ｈ', 'ｈ', 'ᕼ', 'Ħ', 'ђ', 'н', 'ħ', 'Ĥ', '𝔥', '𝓱', '𝒽', '𝓗', '𝐇', '𝐡', 'ℍ', '𝕙', 'ʰ'],
        'i': ['Ⓘ', 'ⓘ', 'ι', 'Ｉ', 'ｉ', 'Ꭵ', '丨', 'Ɨ', 'เ', 'ι', 'ί', 'Į', '𝔦', '𝓲', '𝒾', '𝓘', '𝐈', '𝐢', '𝕀', '𝕚', 'ᶤ'],
        'j': ['Ⓙ', 'ⓙ', 'נ', 'Ｊ', 'ڶ', 'ｊ', 'ᒎ', 'Ĵ', 'ן', 'נ', 'ј', 'Ĵ', '𝔧', '𝓳', '𝒿', '𝓙', '𝐉', '𝐣', '𝕁', '𝕛', 'ʲ'],
        'k': ['Ⓚ', 'ⓚ', 'к', 'Ｋ', 'ｋ', 'ᛕ', 'Ҝ', 'к', 'к', 'ķ', 'Ќ', '𝔨', '𝓴', '𝓀', '𝓚', '𝐊', '𝐤', '𝕂', '𝕜', 'ᵏ', 'Ҝ'],
        'l': ['Ⓛ', 'ⓛ', 'ℓ', 'ㄥ', 'Ｌ', 'ｌ', 'ᒪ', 'Ł', 'l', 'ℓ', 'Ļ', 'Ĺ', '𝔩', '𝓵', '𝓁', '𝓛', '𝐋', '𝐥', '𝕃', '𝕝', 'ˡ'],
        'm': ['Ⓜ', 'ⓜ', 'м', 'Ｍ', 'ｍ', 'ᗰ', 'Μ', '๓', 'м', 'м', 'ϻ', '𝔪', '𝓶', '𝓂', '𝓜', '𝐌', '𝐦', '𝕄', '𝕞', 'ᵐ', '爪'],
        'n': ['Ⓝ', '几', 'ⓝ', 'η', 'Ｎ', 'ｎ', 'ᑎ', 'Ň', 'ภ', 'η', 'ή', 'Ň', '𝔫', '𝓷', '𝓃', '𝓝', '𝐍', '𝐧', 'ℕ', '𝕟', 'ᶰ'],
        'o': ['Ⓞ', 'ㄖ', 'ⓞ', 'σ', 'Ｏ', 'ｏ', 'ᗝ', 'Ø', '๏', 'σ', 'ό', 'Ỗ', '𝔬', '𝓸', '𝑜', '𝓞', '𝐎', '𝐨', '𝕆', '𝕠', 'ᵒ'],
        'p': ['Ⓟ', 'ⓟ', 'ρ', 'Ｐ', 'ｐ', '卩', 'ᑭ', 'Ƥ', 'ק', 'ρ', 'ρ', 'Ƥ', '𝔭', '𝓹', '𝓅', '𝓟', '𝐏', '𝐩', 'ℙ', '𝕡', 'ᵖ'],
        'q': ['Ⓠ', 'ⓠ', 'q', 'Ｑ', 'ｑ', 'Ɋ', 'Ω', 'ợ', 'q', 'q', 'Ǫ', '𝔮', '𝓺', '𝓆', '𝓠', '𝐐', '𝐪', 'ℚ', '𝕢', 'ᵠ'],
        'r': ['Ⓡ', 'ⓡ', 'я', '尺', 'Ｒ', 'ｒ', 'ᖇ', 'Ř', 'г', 'я', 'ŕ', 'Ř', '𝔯', '𝓻', '𝓇', '𝓡', '𝐑', '𝐫', 'ℝ', '𝕣', 'ʳ'],
        's': ['Ⓢ', 'ⓢ', 'ѕ', 'Ｓ', '丂', 'ｓ', 'ᔕ', 'Ş', 'ร', 's', 'ş', 'Ŝ', '𝔰', '𝓼', '𝓈', '𝓢', '𝐒', '𝐬', '𝕊', '𝕤', 'ˢ'],
        't': ['Ⓣ', 'ⓣ', 'т', 'Ｔ', 'ｔ', '丅', 'Ŧ', 't', 'т', 'ţ', 'Ť', '𝔱', '𝓽', '𝓉', '𝓣', '𝐓', '𝐭', '𝕋', '𝕥', 'ᵗ'],
        'u': ['Ⓤ', 'ⓤ', 'υ', 'Ｕ', 'ｕ', 'ᑌ', 'Ữ', 'ย', 'υ', 'ù', 'Ǘ', '𝔲', '𝓾', '𝓊', '𝓤', '𝐔', '𝐮', '𝕌', '𝕦', 'ᵘ'],
        'v': ['Ⓥ', 'ⓥ', 'ν', 'Ｖ', 'ｖ', 'ᐯ', 'V', 'ש', 'v', 'ν', 'Ѷ', '𝔳', '𝓿', '𝓋', '𝓥', '𝐕', '𝐯', '𝕍', '𝕧', 'ᵛ'],
        'w': ['Ⓦ', 'ⓦ', 'ω', 'Ｗ', 'ｗ', 'ᗯ', 'Ŵ', 'ฬ', 'ω', 'ώ', 'Ŵ', '𝔴', '𝔀', '𝓌', '𝓦', '𝐖', '𝐰', '𝕎', '𝕨', 'ʷ', '山'],
        'x': ['Ⓧ', 'ⓧ', 'χ', 'Ｘ', '乂', 'ｘ', '᙭', 'Ж', 'א', 'x', 'x', 'Ж', '𝔵', '𝔁', '𝓍', '𝓧', '𝐗', '𝐱', '𝕏', '𝕩', 'ˣ'],
        'y': ['Ⓨ', 'ㄚ', 'ⓨ', 'у', 'Ｙ', 'ｙ', 'Ƴ', '¥', 'ץ', 'ү', 'ч', 'Ў', '𝔶', '𝔂', '𝓎', '𝓨', '𝐘', '𝐲', '𝕐', '𝕪', 'ʸ'],
        'z': ['Ⓩ', 'ⓩ', 'z', '乙', 'Ｚ', 'ｚ', 'Ƶ', 'Ž', 'z', 'z', 'ž', 'Ż', '𝔷', '𝔃', '𝓏', '𝓩', '𝐙', '𝐳', 'ℤ', '𝕫', 'ᶻ']
    };
    return _0x25c6f1[_0x5982a6] ? randomElement(_0x25c6f1[_0x5982a6]) : _0x5982a6;
}

function randomElement(_0x3423d5) {
    var _0x2600ad = _0x50051f;
    return _0x3423d5[Math[_0x2600ad(0x4c)](Math['random']() * _0x3423d5[_0x2600ad(0x353)])];
}

function randomSymbols(_0x27b135) {
    var _0x4e405d = _0x50051f,
        _0x442ea0 = ['🐙', '🐉', '🐊', '🐒', '🐝', '🐜', '🐚', '🐲', '🐳', '🐸', '👑', '👹', '👺', '👤', '💲', '💣', '💙', '💚', '💛', '💜', '💝', '💗', '💘', '💞', '💔', '💥', '🐯', '🐼', '🐻', '🐺', '👌', '🐍', '🐧', '🐟', '🐠', '🐨', '🎯', '🏆', '🎁', '🎀', '🎉', '🎈', '🍮', '🍭', '🍬', '🍫', '🍪', '🍧', '🌷', '🍓', '😺', '😾', '✎', '😎', '😝', '😂', '😈', '😡', '😲', '😳', '🍔', '🍟', '🍩', '🎃', '🎄', '🎅', '🐣', '🐤', '👍', '👊', '👻', '👽', '👮', '💎', '💋', '👣', '💀', '💢', '🔥', '♔', '♕', '♖', '♗', '♘', '♙', '♚', '♛', '♜', '♝', '♞', '♟', '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧', '♨', '♩', '♪', '♬', '★', '☆', '☺', '☹', '☯', '☮', '☢', '☠', '☟', '☞', '☝', '☜', '✌', '✋', '✊', '⛵', 'ൠ', '✌', 'ඏ'],
        _0x10fb40 = [];
    for (var _0x417fb2 = 0x0; _0x417fb2 < _0x27b135; _0x417fb2++) _0x10fb40[_0x4e405d(0xd)](randomElement(_0x442ea0));
    return _0x10fb40['join']('');
}

function randInt(_0x153e95, _0x22542c) {
    var _0x2e1ab4 = _0x50051f;
    return _0x153e95 + Math[_0x2e1ab4(0x4c)](Math[_0x2e1ab4(0x58)]() * (_0x22542c - _0x153e95 + 0x1));
}
$(document)[_0x50051f(0x17c)](function() {
    var _0x2c113b = _0x50051f;
    $(_0x2c113b(0x194))[_0x2c113b(0x4dc)](_0x2c113b(0x302)), $('#fontSize')['on']('input\x20change', function() {
        var _0x4ad633 = _0x2c113b;
        $(_0x4ad633(0x1a2) + $(this)['val']() + _0x4ad633(0x292))[_0x4ad633(0x4dc)](_0x4ad633(0x302));
    }), _0x4730b5(default_text), $(_0x2c113b(0x3d6))['on'](_0x2c113b(0x35e), function(_0x28225e) {
        var _0x5e2ce6 = _0x2c113b;
        if ($(_0x5e2ce6(0x9e))[_0x5e2ce6(0x398)]() < 0x1) _0x4730b5(default_text);
        else {
            var _0x56f25e = $(_0x5e2ce6(0x9e))['val']();
            _0x4730b5(_0x56f25e);
        }
    });
    var _0x1ad52a = window[_0x2c113b(0x15b)][_0x2c113b(0x110)],
        _0x4ef0a5 = _0x1ad52a[_0x2c113b(0x29c)](_0x2c113b(0x212));
    urltext = _0x4ef0a5[0x1];
    urltext && (urltext = decodeURIComponent(urltext), $(_0x2c113b(0x9e))['val'](urltext), _0x4730b5(urltext));

    function _0x4730b5(_0xfa253b) {
        var _0x2ed2be = _0x2c113b;
        _0xfa253b = _0xfa253b['trim'](), $(_0x2ed2be(0x3cc))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's1')), $(_0x2ed2be(0x346))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's2')), $('.result-s3')['html'](Change(_0xfa253b, 's3')), $('.result-s4')[_0x2ed2be(0x8c)](Change(_0xfa253b, 's4')), $(_0x2ed2be(0x538))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's5')), $('.result-s6')[_0x2ed2be(0x8c)](Change(_0xfa253b, 's6')), $(_0x2ed2be(0x2a0))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's7')), $('.result-s8')[_0x2ed2be(0x8c)](Change(_0xfa253b, 's8')), $(_0x2ed2be(0x125))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's9')), $(_0x2ed2be(0x3f5))['html'](Change(_0xfa253b, 's10')), $(_0x2ed2be(0x37))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0xf6))), $(_0x2ed2be(0x31c))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0xe4))), $(_0x2ed2be(0x18f))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's13')), $(_0x2ed2be(0x1cd))['html'](Change(_0xfa253b, _0x2ed2be(0x365))), $(_0x2ed2be(0x1f2))['html'](Change(_0xfa253b, _0x2ed2be(0x1f9))), $(_0x2ed2be(0x3f7))['html'](Change(_0xfa253b, _0x2ed2be(0x419))), $(_0x2ed2be(0x142))['html'](Change(_0xfa253b, _0x2ed2be(0x166))), $(_0x2ed2be(0x465))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x15f))), $(_0x2ed2be(0x2d6))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x57))), $(_0x2ed2be(0x4ae))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x359))), $(_0x2ed2be(0x404))[_0x2ed2be(0x8c)](Change(_0xfa253b, 's21')), $(_0x2ed2be(0x53e))['html'](Change(_0xfa253b, _0x2ed2be(0x236))), $(_0x2ed2be(0x152))['html'](Change(_0xfa253b, _0x2ed2be(0x105))), $(_0x2ed2be(0x196))['html'](Change(_0xfa253b, 's24')), $(_0x2ed2be(0x118))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x183))), $(_0x2ed2be(0xe8))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x128))), $(_0x2ed2be(0x3ff))['html'](Change(_0xfa253b, _0x2ed2be(0x140))), $(_0x2ed2be(0x318))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x66))), $(_0x2ed2be(0xbc))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x309))), $(_0x2ed2be(0x304))[_0x2ed2be(0x8c)](Change(_0xfa253b, _0x2ed2be(0x189))), $(_0x2ed2be(0x2a4))[_0x2ed2be(0x8c)](luni['tools'][_0x2ed2be(0xa1)][_0x2ed2be(0x79)](_0xfa253b)), $(_0x2ed2be(0x4e2))['html'](applyCharMap(invertedSquaresCharMap, _0xfa253b)), $('.illuminati')[_0x2ed2be(0x8c)](illuminati(_0xfa253b)), $(_0x2ed2be(0x4d3))['html'](textgun(_0xfa253b)), $(_0x2ed2be(0x7b))[_0x2ed2be(0x8c)](minigame(_0xfa253b)), $('.pubggame1')[_0x2ed2be(0x8c)](pubggame1(_0xfa253b)), $('.pubggame2')[_0x2ed2be(0x8c)](pubggame2(_0xfa253b)), $(_0x2ed2be(0x1fc))['html'](pubggame3(_0xfa253b)), $(_0x2ed2be(0x379))[_0x2ed2be(0x8c)](bricks(_0xfa253b)), $(_0x2ed2be(0xbb))['html'](bigrus(_0xfa253b)), $(_0x2ed2be(0xa))[_0x2ed2be(0x8c)](applyCharMap(wideTextCharMap, _0xfa253b)), $(_0x2ed2be(0x2e2))[_0x2ed2be(0x8c)](luni[_0x2ed2be(0x2d8)][_0x2ed2be(0x199)][_0x2ed2be(0x79)](_0xfa253b)), $('.lunitoolsflipencode')[_0x2ed2be(0x8c)](luni[_0x2ed2be(0x2d8)][_0x2ed2be(0x280)][_0x2ed2be(0x79)](_0xfa253b)), $(_0x2ed2be(0x3e9))[_0x2ed2be(0x8c)](applyCharMap(squaresCharMap, _0xfa253b)), $(_0x2ed2be(0x44c))[_0x2ed2be(0x8c)](luni[_0x2ed2be(0x2d8)][_0x2ed2be(0x33c)][_0x2ed2be(0x79)](_0xfa253b)), $(_0x2ed2be(0x42d))[_0x2ed2be(0x8c)](applyCharMap(subscriptCharMap, _0xfa253b)), $(_0x2ed2be(0x26))[_0x2ed2be(0x8c)](applyCharMap(superscriptCharMap, _0xfa253b)), $(_0x2ed2be(0x1a0))[_0x2ed2be(0x8c)](applyCharMap(bentTextCharMap, _0xfa253b)), $(_0x2ed2be(0x1f0))[_0x2ed2be(0x8c)](applyCharMap(neonCharMap, _0xfa253b)), $(_0x2ed2be(0x27e))[_0x2ed2be(0x8c)](applyCharMap(futureAlienCharMap, _0xfa253b)), $(_0x2ed2be(0x21a))['html'](strikeThrough(_0xfa253b)), $(_0x2ed2be(0x174))[_0x2ed2be(0x8c)](tildeStrikeThrough(_0xfa253b)), $(_0x2ed2be(0x307))[_0x2ed2be(0x8c)](slashThrough(_0xfa253b)), $('.underline')[_0x2ed2be(0x8c)](underline(_0xfa253b)), $('.doubleUnderline')[_0x2ed2be(0x8c)](doubleUnderline(_0xfa253b)), $(_0x2ed2be(0x366))['html'](luni['tools'][_0x2ed2be(0x4b3)][_0x2ed2be(0x79)](_0xfa253b)), $(_0x2ed2be(0x37e))[_0x2ed2be(0x8c)](applyCharMap(squiggleCharMap, _0xfa253b)), $(_0x2ed2be(0x214))[_0x2ed2be(0x8c)](applyCharMap(squiggle2CharMap, _0xfa253b)), $(_0x2ed2be(0x237))[_0x2ed2be(0x8c)](applyCharMap(squiggle3CharMap, _0xfa253b)), $(_0x2ed2be(0x2d7))[_0x2ed2be(0x8c)](applyCharMap(squiggle4CharMap, _0xfa253b)), $(_0x2ed2be(0x335))[_0x2ed2be(0x8c)](applyCharMap(squiggle5CharMap, _0xfa253b)), $('.squiggle6CharMap')[_0x2ed2be(0x8c)](applyCharMap(squiggle6CharMap, _0xfa253b)), $(_0x2ed2be(0x2ce))[_0x2ed2be(0x8c)](applyCharMap(boldCharMap, _0xfa253b)), $(_0x2ed2be(0x28b))[_0x2ed2be(0x8c)](luni[_0x2ed2be(0x2d8)][_0x2ed2be(0x1d9)][_0x2ed2be(0x79)](_0xfa253b)), $(_0x2ed2be(0x539))[_0x2ed2be(0x8c)](luni[_0x2ed2be(0x2d8)][_0x2ed2be(0xd5)]['encode'](_0xfa253b[_0x2ed2be(0x319)]())), $(_0x2ed2be(0xa5))['html'](applyCharMap(oldEnglishCharMap, _0xfa253b)), $('.medievalCharMap')[_0x2ed2be(0x8c)](applyCharMap(medievalCharMap, _0xfa253b)), $(_0x2ed2be(0x2b1))['html'](applyCharMap(cursiveCharMap, _0xfa253b)), $(_0x2ed2be(0x4f9))[_0x2ed2be(0x8c)](scriptify(_0xfa253b)), $(_0x2ed2be(0x131))[_0x2ed2be(0x8c)](applyCharMap(doubleStruckCharMap, _0xfa253b)), $(_0x2ed2be(0x10e))[_0x2ed2be(0x8c)](applyCharMap(italicCharMap, _0xfa253b)), $(_0x2ed2be(0x3c0))[_0x2ed2be(0x8c)](applyCharMap(boldItalicCharMap, _0xfa253b)), $('.monospaceCharMap')[_0x2ed2be(0x8c)](applyCharMap(monospaceCharMap, _0xfa253b)), $('.upperAnglesCharMap')[_0x2ed2be(0x8c)](applyCharMap(upperAnglesCharMap, _0xfa253b)), $('.greekCharMap')[_0x2ed2be(0x8c)](applyCharMap(greekCharMap, _0xfa253b)), $(_0x2ed2be(0x522))['html'](applyCharMap(symbolsCharMap, _0xfa253b)), $(_0x2ed2be(0x3cb))[_0x2ed2be(0x8c)](applyCharMap(currencyCharMap, _0xfa253b)), $('.asianStyleCharMap')[_0x2ed2be(0x8c)](applyCharMap(asianStyleCharMap, _0xfa253b)), $('.asianStyle2CharMap')[_0x2ed2be(0x8c)](applyCharMap(asianStyle2CharMap, _0xfa253b)), $(_0x2ed2be(0x47))[_0x2ed2be(0x8c)](thickBlockFramed(_0xfa253b)), $('.diametricAngleFrame')[_0x2ed2be(0x8c)](diametricAngleFrame(_0xfa253b)), $(_0x2ed2be(0x26c))[_0x2ed2be(0x8c)](wavyJoiner(_0xfa253b)), $(_0x2ed2be(0x2cf))[_0x2ed2be(0x8c)](dottyJoiner(_0xfa253b)), $(_0x2ed2be(0x537))[_0x2ed2be(0x8c)](kirbyHug(_0xfa253b)), $(_0x2ed2be(0xdd))[_0x2ed2be(0x8c)](vaporwaveText(_0xfa253b)), $(_0x2ed2be(0x224))[_0x2ed2be(0x8c)](vaporwaveText1(_0xfa253b)), $('.vaporwaveText2')['html'](vaporwaveText2(_0xfa253b)), $('.littleSparkles')[_0x2ed2be(0x8c)](littleSparkles(_0xfa253b)), $(_0x2ed2be(0xb3))[_0x2ed2be(0x8c)](weirdBox(_0xfa253b)), $(_0x2ed2be(0xdf))[_0x2ed2be(0x8c)](thickBox(_0xfa253b)), $(_0x2ed2be(0x498))[_0x2ed2be(0x8c)](zigzagJoiner(_0xfa253b)), $(_0x2ed2be(0x3d9))[_0x2ed2be(0x8c)](hashJoiner(_0xfa253b)), $('.starJoiner')[_0x2ed2be(0x8c)](starJoiner(_0xfa253b)), $(_0x2ed2be(0x45d))[_0x2ed2be(0x8c)](connectedJoiner(_0xfa253b)), $(_0x2ed2be(0x21e))['html'](arrowjoin(_0xfa253b)), $(_0x2ed2be(0x3de))['html'](dotBoxtwo(_0xfa253b)), $('.dotBox')[_0x2ed2be(0x8c)](dotBox(_0xfa253b)), $(_0x2ed2be(0x274))[_0x2ed2be(0x8c)](diametricBox(_0xfa253b)), $(_0x2ed2be(0x262))[_0x2ed2be(0x8c)](arrowBox(_0xfa253b)), $('.curlybrackets')[_0x2ed2be(0x8c)](curlybrackets(_0xfa253b)), $('.singlewavyJoiner')[_0x2ed2be(0x8c)](singlewavyJoiner(_0xfa253b)), $('.firework')[_0x2ed2be(0x8c)](firework(_0xfa253b)), $('.stinky')[_0x2ed2be(0x8c)](stinky(_0xfa253b)), $(_0x2ed2be(0x163))[_0x2ed2be(0x8c)](heartsBetween(_0xfa253b)), $('.arrowBelow')[_0x2ed2be(0x8c)](arrowBelow(_0xfa253b)), $(_0x2ed2be(0x10c))[_0x2ed2be(0x8c)](crossAboveBelow(_0xfa253b)), $(_0x2ed2be(0x4c6))[_0x2ed2be(0x8c)](wingdings(_0xfa253b)), $('.fullCrazy')[_0x2ed2be(0x8c)](fullCrazy(_0xfa253b)), $('.crazyWithFlourishOrSymbols')[_0x2ed2be(0x8c)](crazyWithFlourishOrSymbols(_0xfa253b)), $(_0x2ed2be(0x461))[_0x2ed2be(0x8c)](cuteText(_0xfa253b)), $(_0x2ed2be(0x17))[_0x2ed2be(0x8c)](star0(_0xfa253b)), $(_0x2ed2be(0x98))[_0x2ed2be(0x8c)](star1(_0xfa253b)), $(_0x2ed2be(0x243))[_0x2ed2be(0x8c)](star2(_0xfa253b)), $(_0x2ed2be(0x2bc))[_0x2ed2be(0x8c)](star3(_0xfa253b)), $('.star4')['html'](star4(_0xfa253b)), $(_0x2ed2be(0x3f6))[_0x2ed2be(0x8c)](star5(_0xfa253b)), $(_0x2ed2be(0x3c3))[_0x2ed2be(0x8c)](star6(_0xfa253b)), $(_0x2ed2be(0x11c))['html'](star7(_0xfa253b)), $('.star8')[_0x2ed2be(0x8c)](star8(_0xfa253b)), $(_0x2ed2be(0xd4))[_0x2ed2be(0x8c)](star9(_0xfa253b)), $('.star10')['html'](star10(_0xfa253b)), $(_0x2ed2be(0xc0))[_0x2ed2be(0x8c)](heart0(_0xfa253b)), $(_0x2ed2be(0x418))['html'](heart1(_0xfa253b)), $(_0x2ed2be(0x12d))['html'](heart2(_0xfa253b)), $(_0x2ed2be(0x1de))[_0x2ed2be(0x8c)](heart3(_0xfa253b)), $(_0x2ed2be(0x15a))['html'](heart4(_0xfa253b)), $(_0x2ed2be(0x52))['html'](heart5(_0xfa253b)), $(_0x2ed2be(0xfd))[_0x2ed2be(0x8c)](heart6(_0xfa253b)), $(_0x2ed2be(0x1da))[_0x2ed2be(0x8c)](heart7(_0xfa253b)), $('.emoticon0')[_0x2ed2be(0x8c)](emoticon0(_0xfa253b)), $(_0x2ed2be(0x23e))[_0x2ed2be(0x8c)](emoticon1(_0xfa253b)), $(_0x2ed2be(0x228))['html'](emoticon2(_0xfa253b)), $(_0x2ed2be(0x53c))[_0x2ed2be(0x8c)](emoticon3(_0xfa253b)), $('.emoticon4')['html'](emoticon4(_0xfa253b)), $('.emoticon5')[_0x2ed2be(0x8c)](emoticon5(_0xfa253b)), $(_0x2ed2be(0xcf))[_0x2ed2be(0x8c)](emoticon6(_0xfa253b)), $(_0x2ed2be(0x227))[_0x2ed2be(0x8c)](emoticon7(_0xfa253b)), $(_0x2ed2be(0xde))[_0x2ed2be(0x8c)](thankyou0(_0xfa253b)), $(_0x2ed2be(0x1e6))[_0x2ed2be(0x8c)](thankyou1(_0xfa253b)), $('.thankyou2')[_0x2ed2be(0x8c)](thankyou2(_0xfa253b)), $(_0x2ed2be(0x106))['html'](thankyou3(_0xfa253b)), $(_0x2ed2be(0xa0))['html'](thankyou4(_0xfa253b)), $('.thankyou5')['html'](thankyou5(_0xfa253b)), $(_0x2ed2be(0x1d2))[_0x2ed2be(0x8c)](thankyou6(_0xfa253b)), $(_0x2ed2be(0x2b9))[_0x2ed2be(0x8c)](thankyou7(_0xfa253b)), $(_0x2ed2be(0xf))[_0x2ed2be(0x8c)](sad0(_0xfa253b)), $(_0x2ed2be(0x4ad))[_0x2ed2be(0x8c)](sad1(_0xfa253b)), $(_0x2ed2be(0x490))[_0x2ed2be(0x8c)](sad2(_0xfa253b)), $('.sad3')['html'](sad3(_0xfa253b)), $(_0x2ed2be(0x374))[_0x2ed2be(0x8c)](sad4(_0xfa253b)), $('.sad5')['html'](sad5(_0xfa253b)), $(_0x2ed2be(0x33))[_0x2ed2be(0x8c)](sad6(_0xfa253b)), $(_0x2ed2be(0x247))[_0x2ed2be(0x8c)](sad7(_0xfa253b)), $('.cuteText1')[_0x2ed2be(0x8c)](cuteText1(_0xfa253b)), $(_0x2ed2be(0x434))[_0x2ed2be(0x8c)](cuteText2(_0xfa253b)), $(_0x2ed2be(0x1af))[_0x2ed2be(0x8c)](cuteText3(_0xfa253b)), $(_0x2ed2be(0x1b))[_0x2ed2be(0x8c)](cuteText4(_0xfa253b)), $(_0x2ed2be(0x52a))[_0x2ed2be(0x8c)](cuteText5(_0xfa253b)), $('.crazyWithFlourishOrSymbols1')[_0x2ed2be(0x8c)](crazyWithFlourishOrSymbols1(_0xfa253b)), $(_0x2ed2be(0x3cf))[_0x2ed2be(0x8c)](crazyWithFlourishOrSymbols2(_0xfa253b)), $(_0x2ed2be(0x31))['html'](crazyWithFlourishOrSymbols3(_0xfa253b)), $('.crazyWithFlourishOrSymbols4')[_0x2ed2be(0x8c)](crazyWithFlourishOrSymbols4(_0xfa253b)), $('.crazyWithFlourishOrSymbols5')[_0x2ed2be(0x8c)](crazyWithFlourishOrSymbols5(_0xfa253b)), $('.fullCrazy1')[_0x2ed2be(0x8c)](fullCrazy1(_0xfa253b)), $(_0x2ed2be(0x17d))[_0x2ed2be(0x8c)](fullCrazy2(_0xfa253b)), $('.fullCrazy3')[_0x2ed2be(0x8c)](fullCrazy3(_0xfa253b)), $('.fullCrazy4')[_0x2ed2be(0x8c)](fullCrazy4(_0xfa253b)), $(_0x2ed2be(0x3c6))[_0x2ed2be(0x8c)](fullCrazy5(_0xfa253b)), $(_0x2ed2be(0x2b4))[_0x2ed2be(0x8c)](wrap1(_0xfa253b)), $(_0x2ed2be(0x2fb))[_0x2ed2be(0x8c)](wrap2(_0xfa253b)), $('.wrap3')['html'](wrap3(_0xfa253b)), $(_0x2ed2be(0x6))[_0x2ed2be(0x8c)](wrap4(_0xfa253b)), $(_0x2ed2be(0x320))[_0x2ed2be(0x8c)](wrap5(_0xfa253b));
    }
    $(_0x2c113b(0x3d0))[_0x2c113b(0x38e)](function() {
        var _0x4be36b = _0x2c113b;
        $(_0x4be36b(0x9e))[_0x4be36b(0x398)]('');
    });

    function _0xa0bd4d() {
        var _0x313251 = _0x2c113b,
            _0x56445a = document['querySelector'](_0x313251(0x43e)),
            _0x5e3832 = _0x56445a[_0x313251(0x85)](_0x313251(0x48e));
        document['querySelectorAll'](_0x313251(0xe))[_0x313251(0x333)](_0x52a42f => {
            var _0x38bb6d = _0x313251;
            _0x52a42f[_0x38bb6d(0xcb)](_0x38bb6d(0x38e), () => {
                var _0x5c0b8d = _0x38bb6d;
                _0x5e3832[_0x5c0b8d(0x14a)] = _0x52a42f['querySelector']('p')['innerText'], _0x3594c9(_0x5e3832), _0x56445a['classList'][_0x5c0b8d(0xfc)](_0x5c0b8d(0x216)), setTimeout(() => {
                    var _0x555578 = _0x5c0b8d;
                    _0x56445a['classList'][_0x555578(0x51c)]('copied-show');
                }, 0x3e8);
            });
        });
    }
    _0xa0bd4d();

    function _0x3594c9(_0x1b7c28) {
        var _0x6bb385 = _0x2c113b,
            _0x4c6351 = document['createElement'](_0x6bb385(0x3ab));
        _0x4c6351[_0x6bb385(0x14a)] = _0x1b7c28[_0x6bb385(0x30)] || _0x1b7c28['value'], document['body'][_0x6bb385(0x22d)](_0x4c6351), _0x4c6351[_0x6bb385(0x27a)](), document[_0x6bb385(0x336)]('copy'), _0x4c6351[_0x6bb385(0x51c)]();
    }
});
